{"tree_elements": [{"text": "The uproar that occurred after the match between three-time grand slam winner Serena Williams and Naomi Osaka in the finals of the 2018 U.S. Open last August, had many people raising questions about sexism and racial discrimination in sports."}, {"text": "It started when Williams’ coach, Patrick Mouratoglou, was spotted using hand signals to coach her from the stands. This action is considered illegal in Grand Slams, which are the four most important tennis tournaments held around the world annually. Williams claimed she did not spot the coach or take any of the advice, but she was penalized nonetheless. She was issued a “code violation,” which is a warning given to players who disobey or break the rules."}, {"text": "The umpire, Carlos Ramos, issued a second code violation when Williams smashed her racket on the court out of frustration after missing a backhand during a crucial point in the match. The third violation came when she started arguing with Ramos, calling him a “liar” and a “thief” for making calls that resulted in a loss of points on Williams’ side."}, {"text": "These violations raised more than just questions about sexism and racism in tennis but also highlighted how women and people of color are mistreated in the sports community. This has not been the first instance when Carlos Ramos has umpired tennis matches with strict and unfair rulings. He once penalized English player, Andy Murray, when he misheard “stupid umpiring” as “stupid umpire.” Ramos has also penalized Venus Williams, Serena’s older sister, for receiving coaching behind the stands."}, {"text": "Irena Chen, a sophomore on South’s girls’ tennis team, said, “I think what happened to Serena Williams was about gender, or the umpire suddenly wanted to follow the rules.” Chen is referring to how many rules in tennis are up to the interpretation of the umpire. To her, it appeared that Ramos all of sudden wanted to become strict and that resulted in him giving out unnecessary penalties on the basis that Williams is a woman."}, {"text": "Williams’ actions during the 2018 U.S. Open Final are ones that are often seen in men’s tennis matches around the world. Male players have smashed their tennis rackets or talked back to the umpire out of anger and frustration, but they weren’t penalized to the degree that  Williams was. For example, Serbian tennis player Novak Djokovic smashed his racket in the second set of one of his matches at the 2018 French Open. He was not penalized for this action and later went on to win the match."}, {"text": "Williams’ finals match was not the only sexist-related controversy that took place during this year’s U.S. Open. Earlier in the tournament, Alize Cornet, a French tennis player, was issued a warning for adjusting her shirt on the court. Cornet briefly took off her shirt, with a sports bra underneath, when she realized she had it on backward during her ten-minute heat break, which is a period of time where players are able to cool off when the temperatures get exhaustingly high. When she returned to the court, umpire Christian Rask issued her a code violation. Although he later excused her of this violation, his initial reaction was a disturbing one. Men constantly take off their shirts in sports due to the hot weather and to cool off, but if a woman does it in order to fix her shirt, the action is seen as inappropriate or obscene."}, {"text": "It is unjust decisions, like the ones made against Cornet and Williams, that make female athletes like us question the fairness in the way men and women are treated in the sports world."}, {"text": "Instances like Cornet’s and Williams’ are raising awareness about the double standards in women’s sports. These situations show how women are held accountable for things that are overlooked in men. Women cannot break their rackets on the court without being seen as emotional and angry, but when men do it, it is passed off with a ‘boys will be boys” type of attitude."}, {"text": "The only way to stop other women from being discriminated against in the future is to eliminate these double standards. It is important to build a new perception that holds women to the same expectations and rights as men."}], "file_structural_elements": {"title": "2018 U.S. Open: A fight for the trophy and a fight for equality", "date": "November 16, 2018", "writer": {"": {"name": "Naqsh Mitra ", "year": ""}, "bijQTp8MbBbMBsVjvq8V": {"name": "Varsha Gollarhalli", "year": "2018"}}, "description": "     The uproar that occurred after the match between three-time grand slam winner Serena Williams and Naomi Osaka in the finals of the 2018 U.S. Open last August, had many people raising questions about sexism and racial discrimination in sports. \n     It started when Williams’ coach, Patrick Moura", "image": null}}