{"tree_elements": [{"text": "When gym teacher David Colon took over as the coach of the varsity boys’ volleyball team this year, he had one message in mind to guide his squad through their season: “Set the standard.”"}, {"text": "With a 15-10 record and their first division title since 2018, it’s safe to say the boys did just that. “I am very proud of our entire team being division champions this year,” said junior outside hitter Nithin Pillai. “I am also very proud of how much we have all improved over the season.”"}, {"text": "It’s been a story of overcoming adversity and getting better each day for the Pirates this year. Struggling at times with COVID absences and a difficult opening schedule, the team posted a record of just 5-7 after their first month of play."}, {"text": "“We had quite a rough start at the beginning of the season,” said senior setter Shiloh Duan."}, {"text": "It took a renewed emphasis on the mental aspect of the game to turn things around."}, {"text": "“Our team is heavily influenced by our mood on the court,” said Pillai. “And while that was a big problem at the beginning of our season, we learned to overcome it by ensuring that nobody was feeling down after a point.”"}, {"text": "Between post-point huddles, celebrations, and the leadership of seniors like Duan, the boys quickly turned things around, winning eight of their last nine regular season contests. Pillai would go on to finish the season with a team high 177 kills, and Duan posted 223 assists while leading the team with 42 aces and 114 service points. It was a staggering output in his return to the court after a gruesome left knee injury last season that left him in rehab for several months. Both Pillai and Duan were second team all-conference selections in the Burlington County Scholastic League (BCSL)."}, {"text": "It was the effort of numerous players, however, that helped the team truly reach their peak."}, {"text": "“Depth is one of the biggest strengths of this team,” said Coach Colon. “We have capable players all over the court and on the bench that can hop in at any point and play at a high level.”"}, {"text": "Clearly, coaches around the conference felt the same way, and showed it in their all-conference voting. Joining Pillai and Duan on the all-conference second team were senior opposite Will Zhang and junior middle blocker Carlton Cummings. Senior libero Alex Yuan, who had a team high 208 digs, and senior middle blocker Guhan Pradeep, who finished third in the state with 90 blocks, were both selected to the all-conference first team."}, {"text": "Despite eventually falling to Northern Burlington in the conference semifinals, the season was still an enormous success, and one that the players will remember fondly in all aspects."}, {"text": "“I don’t think I can name a favorite moment, but chilling and stretching post practice has always been fun,” reminisced Yuan."}, {"text": "The feeling of camaraderie is a sentiment echoed by his teammates."}, {"text": "“The thing I will miss most about being on the volleyball team is just playing with my teammates, my family,” said Duan. “High school volleyball is something that cannot be replaced.”"}, {"text": "The boys won’t have to look far to remember. The newly added 2022 on the gym’s division title banner can’t be replaced either."}, {"text": "PHOTO BY GRACE YUAN"}], "file_structural_elements": {"title": "A banner season for boys’ volleyball", "date": "June 22, 2022", "writer": {"xcHHOYKQ8MJMj6FRgYiE": {"name": "Danny McElroy", "year": "2021"}}, "description": "When gym teacher David Colon took over as the coach of the varsity boys’ volleyball team this year, he had one message in mind to guide his squad through their season: “Set the standard.”\nWith a 15-10 record and their first division title since 2018, it’s safe to say the boys did just that. “I am ve", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/Screenshot-2022-06-22-at-2.40.27-PM-900x385.png"}}