{"tree_elements": [{"text": "From practices to matches, changes in the 2020-21 sports season modified the way we look at high school sports such as the boys volleyball season."}, {"text": "In order to accomodate for the coronavirus pandemic, South’s volleyball season was shortened and matches were held in close succession. The shortened schedule, the late start, the close proximity of games and inability to practice during the weekends because of COVID guidelines led to significantly less practice for team members before a game. There were also fewer games because the team competed only in the Burlington County Scholastic league, which includes approximately eight to nine teams."}, {"text": "The result of these changes was  a season like never before. “We’ve actually had more games than practices,” said senior Neev Ramani, Boys Varsity Volleyball Captain."}, {"text": "However even with all the struggles, the team won 11 of their 15 games, despite not having enough practice time."}, {"text": "“We just went right out there and started playing, so we kind of had to adjust during game time, but they’ve done really great up to this point,” said Boys Junior Varsity Coach Kevin Lynch, who played volleyball during college."}, {"text": "This pressure on court has helped lead the players to form tight bonds with their teammates. “We’re very well connected,” said Ramani. Their connections on the court can also be credited to their relationship off the court, since many of the team members have trained and spent time together in the past."}, {"text": "Ramani especially admires the first-year varsity players who adapted to the new season. “Accepting the role, stepping into it and really taking charge from that point,” was Ramani’s description of his younger teammates."}, {"text": "The challenges of the season have allowed the team members to grow not only as people, but as players. “I like the competitive aspect and the way we can measure our growth with stats, it’s really motivating to see yourself grow from game to game,” said sophomore Varsity player Rayhaan Amjath."}, {"text": "Starting the 2021 year, there was significant doubt regarding a volleyball season: “Beginning of the school year, we didn’t know what was going to happen,” said Kate Dobinson, the district Athletic Director. “So, we’ve been moving through season-by-season basis.” With only one positive coronavirus case in the winter season, the administration deemed spring sports to be safe. “Because we have had such success with the winter season, we felt content with our protocols, our students and our coaches,” said Ms. Dobinson."}, {"text": "The boys were especially grateful for this decision to have a volleyball season even if it was unusual. “They are so happy to be out there and they just appreciate having a season at all,” said Junior Varsity coach Mr. Kevin Lynch."}, {"text": "Even with all the obstacles of a pandemic, the team continues to persevere through these challenges to end the season on a successful note together."}, {"text": "Photo Courtesy of David Colon and Neev Ramani"}], "file_structural_elements": {"title": "A boy’s volleyball season like never before", "date": "June 18, 2021", "writer": {"l7VmOCUaYoPYE1PNDIbH": {"name": "Shivani Sadasivam", "year": "2020"}, "yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "      From practices to matches, changes in the 2020-21 sports season modified the way we look at high school sports such as the boys volleyball season. \n     In order to accomodate for the coronavirus pandemic, South’s volleyball season was shortened and matches were held in close succession. The s", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/Screen-Shot-2021-06-18-at-7.12.52-PM-900x655.png"}}