{"tree_elements": [{"text": "After 80 years of March Madness, the NCAA (National Collegiate Athletic Association) canceled the tournament due to the coronavirus pandemic."}, {"text": "The March Madness tournament started in 1939 when the University of Oregon defeated Ohio State University 46-33."}, {"text": "The alliterative name has its origins in March 1908 when the IHSA (Illinois High School Association) began hosting a statewide basketball tournament. Henry V. Porter, an assistant executive secretary with the IHSA, wrote a news article in the Chicago Tribune about the tournament titled “March Madness”. Ever since that article and championship became popular, the term “March Madness” has been used when referring to the basketball season."}, {"text": "In 1982, CBS (Columbia Broadcasting System) sports broadcaster Brent Musburger, used the term during his network’s NCAA tournament reporting. Now, both tournaments on the highschool and college levels use the term."}, {"text": "For the first 12 years of the college basketball tournament, only eight teams were invited to participate. Now, the tournament consists of 68 teams, 16 teams from the four divisions—  North, South, East and West."}, {"text": "The 2020 NCAA championship game was supposed to occur Monday, April 6. However, on March 13, NCAA President Mark Emmert and the Board of Governors, the highest governance body in the NCAA,  canceled the Division I men’s and women’s 2020 basketball tournaments."}, {"text": "A week before the cancellation, the NCAA announced the games would be played excluding the fans due to social distancing. But soon after, many colleges such as Duke University and the University of Kansas shut down their athletic department. Colleges and high schools around the globe have shut down due to the pandemic."}, {"text": "Junior Matthew Dorfman said, “I get why they canceled it. But it’s unfortunate because March Madness is one of the best sporting events of the year.”"}, {"text": "Because the tournaments were canceled, Dan Gavitt, the NCAA senior vice president of basketball, announced that they will not be releasing nor creating official brackets. The importance of brackets is to see how teams are progressing throughout the tournament. Gavitt believes that it’s not fair to release a bracket due to the incomplete season."}, {"text": "Junior Annie Klugerman said, “When I was younger, my brother and my dad always followed brackets so I also became interested. Basketball is one of my favorite sports to watch so I take my brackets very seriously.”"}, {"text": "March Madness brackets originated from a chess tournament hosted in 1851. It is common for chess players to participate in brackets in order to keep track of their progress. The NCAA took these ideas and made a very efficient and fair bracket that pleased all fans and their teams."}, {"text": "As time went on, brackets became more popular. Today, over 60 million Americans fill out unofficial brackets each year for fun."}, {"text": "The cancellation of the March Madness tournaments not only affects college athletes but also affects the students at South. Klugerman said, “During school, I would try to watch the games with my friends when I got the chance to see how the teams were doing.”"}, {"text": "Though March Madness was canceled after years of tradition, it was for the best. The NCAA knew it was the smartest decision to keep not only the athletes and coaches safe from the coronavirus, but the fans as well."}], "file_structural_elements": {"title": "A pause on March Madness", "date": "May 3, 2020", "writer": {"t1wNGC5vCu2m5zKSZgLI": {"name": "Sophia Englezos", "year": "2020"}}, "description": "     After 80 years of March Madness, the NCAA (National Collegiate Athletic Association) canceled the tournament due to the coronavirus pandemic. \n     The March Madness tournament started in 1939 when the University of Oregon defeated Ohio State University 46-33. \n    The alliterative name has its", "image": null}}