{"tree_elements": [{"text": "“For the couple of days of practice we got before quarantine started, I had never felt more confident that this was going to be the season full of new records and wins,” said senior Vrinda Attri, a member of South’s Girls Golf team. “I was looking forward to performing and making it to States to see all of the team’s efforts play out during my final months.” But quarantine extended to the end of the school year — which meant that the final season for all sports, including girls golf, would be canceled."}, {"text": "“At first, I felt like I missed out on everything,” said senior Shreya Hariharan, a player for the team. “I was devastated that the other seniors and I wouldn’t have a Senior Day, our last tournaments or the team bonding activities.”"}, {"text": "While other senior golfers shared in Hariharan’s regret, the girls stayed strong and helped support each other through this unprecedented time. Not only did the team keep in contact during quarantine, but the team members also planned a special surprise for the senior players who missed out on their last season."}, {"text": "On Thursday, May 21, Coach Michelle Walsh and the underclassmen players surprised the seniors with gifts and four signs for their Senior Day (one sign for each individual senior and one main sign for all the seniors). Hariharan said, “I felt so lucky to be a part of an amazing team who truly wanted us to end the year on a positive note.”"}, {"text": "The main sign was bright and colorful, proudly displaying the names of the seniors–Vrinda Attri, Shreya Hariharan and Isabella McCloskey– and the message, “We Love Our Girls Golf Seniors!” Although these seniors missed out on their last season, they did not miss out on the love and support from their fellow teammates and coach."}, {"text": "Coach Walsh said, “We stayed in touch, exchanged golf fitness drills, did a drive by for senior day, bought senior gifts, made posters, etc.; [we did] everything we could do to honor our seniors while keeping our health and safety as top priority.”"}, {"text": "Because of the quarantine canceling their season, the girls have learned to always remain optimistic and to appreciate what they have. “This experience has taught me that there is nothing more important than being grateful and living in the moment. Not only is this the key to playing to your fullest potential in any sport or activity, it allows you to focus on the positives and enjoyment through the toughest situations, on and off the golf course,” Attri said."}, {"text": "Hariharan said, “I want my teammates to know that we should not feel discouraged by this setback. My pride for Girls Golf hasn’t diminished and we should still have that motivation for the next time we practice and play.”"}, {"text": "Hariharan added, “And for other teams going through the same situation: Do not feel hopeless! We can only hope for next year to be normal. I hope the underclassmen in all sports can get back up and have the best season next year to make up for this year.”"}, {"text": "Coach Walsh said, “Our Pirate spring athletes had to swallow a tough one this year (as did everyone), but we will move past this time. We will learn from it and hopefully become even closer and more caring as a result of these trying times.”"}, {"text": ""}, {"text": "PHOTO COURTESY OF MADOKA KONDO AND MICHELLE WALSH"}], "file_structural_elements": {"title": "An inspiration for all: South’s Girls Golf Team supports seniors during this time of change", "date": "June 19, 2020", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "     “For the couple of days of practice we got before quarantine started, I had never felt more confident that this was going to be the season full of new records and wins,” said senior Vrinda Attri, a member of South’s Girls Golf team. “I was looking forward to performing and making it to States t", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/Screenshot-2020-06-19-at-11.50.31-AM.png"}}