{"tree_elements": [{"text": "“Pirates on 3, family on 6,” yells senior captain Josh Raeter. The crowded circle of athletes from the boys’ varsity basketball team roars together."}, {"text": "As the starters take the court, fist bumping the referees and doing handshakes with their teammates, the Pirate fans cheer on the players."}, {"text": "The boys’ varsity basketball team has made their return."}, {"text": "Due to the pandemic, in the 2020-21 season, the Pirates only battled the North Knights four times, all of which they won. With their success against North in the 2020-21 season, the boys felt ready for any competition that would come their way in the Colonial Valley Conference."}, {"text": "“It was a really great feeling because although we got to play last year, it was frustrating because we only got to practice and play in a limited amount of games,” said junior Ben Jaclin, point guard for the team."}, {"text": "Overall, the missed playing time left players with less experience and chemistry between them."}, {"text": "Coach Hussong said, “We’ve only had 1 or 2 players with varsity experience coming into this year. Some challenges we’ve faced are being able to handle the grind of the season, being able to handle different settings, away games, gyms. Being able to respond to different adversities, that is something you have to learn from experience.”"}, {"text": "Throughout the season, the South basketball team also combated the opinions and perspectives of opposing teams, hoping to leave their opponents stunned with their skills."}, {"text": "“I feel they’re going to look at us and think that we are probably unprepared for the moment, when in fact I think that even though we didn’t have a season last year, through practice, we are prepared for whatever other teams throw at us,”, said junior Bryson Amos-Whitfield, who plays shooting guard."}, {"text": "Four-year varsity Captain Rickey Boone added that teams would be impressed by the Pirates’ apt abilities and skills. He expressed that opposing teams “should perceive us as a dangerous competition. The competition saw how we played in our first games, how we kept it close and fought until the end.”"}, {"text": "The Pirates have kept a positive and confident mentality. This only brought them more success."}, {"text": "For example, the Pirates pulled off some impressive victories, including a 69-66 overtime win over Nottingham, and a 69-58 victory against Hamilton West, led by Boone and Jaclin with 19 points each."}, {"text": "The Boys’ Basketball team don’t dwell too much on the future: they want to embrace each moment in full during this exciting season. In fact, Coach Hussong emphasized the importance of focusing on the present rather than the future: “We like to look at everything as a day-by-day process. We want to focus on getting better everyday, whether it’s a practice, a game, a new opponent, an old opponent--, we want to improve our performance everyday. When we stack those positive days, we will reach our goal of winning as many games as possible.”"}, {"text": "PHOTO BY RAY HANSON"}], "file_structural_elements": {"title": "Basketball team is back in full force", "date": "May 5, 2022", "writer": {"": {"name": "Ryan Collins", "year": ""}}, "description": "     “Pirates on 3, family on 6,” yells senior captain Josh Raeter. The crowded circle of athletes from the boys’ varsity basketball team roars together.\n     As the starters take the court, fist bumping the referees and doing handshakes with their teammates, the Pirate fans cheer on the players.\n  ", "image": "https://thepirateseye.org/wp-content/uploads/2022/05/Screenshot-2022-05-05-1.13.02-PM.png"}}