{"tree_elements": [{"text": "Ever since the coronavirus pandemic created the need for quarantine, there has been much uncertainty surrounding the 20-21 school sports season. The New Jersey State Interscholastic Athletic Association (NJSIAA) delayed the winter sports season to 2021.  This meant that South’s basketball teams would wait even longer to get back on the court."}, {"text": "Following the cancellation of the fall sports season, South athletes began to lose hope for a winter sports season this year. However, many were surprised and delighted by the announcement that the basketball season would simply be pushed to January 2021."}, {"text": "“I was actually kind of surprised,” said Lily Akman, a junior on the Girls’ Varsity Basketball team. “I’m happy for my senior teammates who will get to play for their last year.” Other teammates shared this sentiment, and they are excited to play another season."}, {"text": "The delay in the basketball season was due in part to Executive Order 196, signed on Nov. 17 by Gov. Murphy, which stated, “Regardless of the capacity of the room, such limit shall never be larger than 25 persons or smaller than 10 persons.” With the new guideline, many South athletes were no longer able to work out at gyms, and so made adjustments to their workouts in order to maintain fitness."}, {"text": "Senior Ved Chugh, a forward on the Boys’ Varsity Basketball team has been making efforts to stay in shape by establishing a workout program. “I started getting up early to run and then it got cold, so I stopped doing that, but I’m lucky enough that we have weights and a bike at home, so I get my cardio in and lift weights as well,” said Chugh."}, {"text": "Katie Hsiao, a sophomore on the Girls’ Varsity Basketball team, has also been consistently working out in order to stay fit. She said, “Before basketball started, I would work out six days a week, but then once basketball started it definitely brought me more in shape because of its high cardiovascular activity.”"}, {"text": "Senior Andy Bae, captain of the Boys Varsity Basketball team, has remained optimistic, encouraging his teammates to stay active during the pandemic. However, it has been tough for athletes to maintain the motivation to train."}, {"text": "“For me, motivation is a huge part of working everyday,” said Bae. He suggested that athletes should try to establish a fitness goal so they have a motivation outside of the basketball season."}, {"text": "Akman also recommended several ways to keep up with physical training during the pandemic. “Try to gather motivation to actually do something,” she said. “I think the biggest problem with me, personally, for staying in shape is not having motivation to do anything.” She recommended establishing a workout schedule in order to help athletes remain active."}, {"text": "Chugh offered some suggestions to help South athletes find exercises to incorporate into their workout routine. “It’s hard to go into gyms and do heavy weight training, but I know a bunch of my friends are into calisthenics.” Calisthenics use gravity in order to provide resistance for exercises and can easily be done at home. It includes workouts such as push-ups and pull-ups."}, {"text": "As the pandemic continues to be active, athletes have made efforts to stay competitive and in shape. Fortunately for South’s athletes, practice began in January and their efforts to stay fit during the pandemic are paying off."}, {"text": "Although this year’s winter sports season is different from a traditional winter season, South’s winter sports teams are participating in in-person practices and competitions against North."}, {"text": "“We didn’t even think we would have a season, so just to be out there one last time with my team is amazing,” said Chugh."}, {"text": "With the dedication and perseverance basketball requires, many players have set goals for themselves to reach for this season."}, {"text": "“Usually I lack confidence in a way, both on and off the court, and I feel like just being more confident will make me an overall better player,” said Hsiao. She added that teams should try their best to remain safe so the season can continue."}, {"text": "Bae also set a goal, not only for himself but for the team to accomplish. “We just want to play team basketball,” said Bae. Regarding his past few years on the team, he said, “There were a lot of upsets, the chemistry wasn’t there to be honest, but this time I want to play basketball with my brothers.”"}, {"text": "With the winter sports season underway, South’s basketball teams look to stay safe and make the most out of their season."}, {"text": ""}, {"text": "PHOTOS COURTESY OF ANDY BAE AND KATIE HSIAO."}, {"text": "IMAGE BY ISHITA JADON."}], "file_structural_elements": {"title": "Basketball update", "date": "February 12, 2021", "writer": {"QRo3uk5mtYwXdbxUvUF1": {"name": "Edward Kim", "year": "2021"}, "BY2v1lYi6QIU4XeyEcp2": {"name": "Abram Chen", "year": "2020"}}, "description": "    Ever since the coronavirus pandemic created the need for quarantine, there has been much uncertainty surrounding the 20-21 school sports season. The New Jersey State Interscholastic Athletic Association (NJSIAA) delayed the winter sports season to 2021.  This meant that South’s basketball teams ", "image": "https://thepirateseye.org/wp-content/uploads/2021/02/basketball-2-900x506.jpg"}}