{"tree_elements": [{"text": "“I hope that these boys were able to create memories that will last a lifetime,” said Coach Michael Hussong, a Health and Physical Education teacher, about South’s Boys Volleyball seniors. “And I hope that I was able to provide them the tools to succeed in the next chapter of their lives.”"}, {"text": "But schools shut down as a result of the coronavirus pandemic and the seniors missed out on their last season at South– a season they had high hopes for."}, {"text": "Coach Hussong explained, “After reaching the conference semi-final last season as a younger team, we felt we had the makings of a championship season.”"}, {"text": "All the seniors from the team had been working hard during their off time hoping to prepare for a season of wins and glory. “They spent countless hours in the gym working on their craft,” said Coach Hussong."}, {"text": "“It’s sad that my last season was over before it really started,” said senior Atman Mohanty, a member of the Boys Volleyball team. “I know we would’ve gone farther than we did last year.”"}, {"text": "Senior Raghav Ramesh was also excited for his final season.“I was really looking forward to playing North again along with the playoffs and county tournament.”"}, {"text": "Mohanty, also known as “Mop” to his friends because of his “long and messy hair,” shared a similar sentiment as senior Sahil Banerjee, another player on the team. All three seniors were disappointed that they could not spend their last season together."}, {"text": "Banerjee, known as “Ace Boogie,” said, “We have a very talented and focused squad and it’s just disappointing that I couldn’t go out there and compete with my guys one last time.”"}, {"text": "However, the team is not letting the quarantine stop them from playing, training and staying connected."}, {"text": "Both seniors are playing by themselves in their neighborhood and are staying physically fit over the quarantine. Furthermore, Mohanty said, “We’ve had Google Meets as a team to talk now and then.”"}, {"text": "Ramesh has also been in contact with his fellow players. “I’m still able to keep in touch with teammates and it was nice to see the coaches visit us during this time.”"}, {"text": "The boys’ close bond as a team has been one of the highlights for the graduating seniors. “The Boys Volleyball team has some of South’s unique personalities and that’s what made me enjoy playing every year,” said Mohanty."}, {"text": "In fact, many of Mohanty’s best memories on the team are a result of these unique personalities. “I’ll never forget Arjun Jaswal blasting ‘All I Do Is Win’ by DJ Khaled every bus ride home,” he shared."}, {"text": "“My favorite memory from last year was the first round of the county tournament and we were playing one of the top teams with the risk of getting eliminated,” said Ramesh. The team was elated after they won the close match. “It proved that what coaches say to their players aren’t just empty words of encouragement but instead when coupled with our hard work, those words help us defy expectations,” he said."}, {"text": "These memories of comradery and success have been a key part of the seniors’ high school careers."}, {"text": "“It has been quite the journey and I wouldn’t want to go to battle with any other group,” said Banerjee about his teammates."}, {"text": "Mohanty said, “It was a blast playing with you guys,” he said, “and I can’t wait to see where we all end up four years from now!”"}, {"text": "Ramesh said he hopes that the team can play together again in the future."}, {"text": "Mohanty advised prospective players to hit the gym and try playing. Ramesh added, “You should work hard, have confidence in your abilities, and support your teammates in order to be successful.”"}, {"text": "Banerjee told his fellow Pirates to follow their passion."}, {"text": "“Remember hard work trumps talent. The late, great Kobe Bryant was my idol for life and his success taught me to become obsessed with whatever your passion may be,” said Banerjee."}, {"text": "During these hard times, the Boys Volleyball team has stayed together and remained optimistic for the future."}, {"text": "Coach Hussong described his pride in the seniors as teammates and role models, even during quarantine. “These boys led by example and although they were not able to compete, they still showed the toughness and resilience that we try to instill in each and every player in the program.”"}, {"text": "“I hope that our seniors can always look back on their time as a member of the volleyball team in the most positive light,” Coach Hussong said. “I am proud to have had the opportunity to coach them and develop relationships with them.”"}, {"text": "Photo Courtesy of Sahil Banerjee"}, {"text": ""}], "file_structural_elements": {"title": "Boys Volleyball: Seniors last season", "date": "June 19, 2020", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}, "bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "     “I hope that these boys were able to create memories that will last a lifetime,” said Coach Michael Hussong, a Health and Physical Education teacher, about South’s Boys Volleyball seniors. “And I hope that I was able to provide them the tools to succeed in the next chapter of their lives.”\n    ", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/Boys-Volleyball-900x643.jpeg"}}