{"tree_elements": [{"text": "*link to='http://highschoolsports.nj.com/game/score/4603917/'*North on April 24 with a final score of 2-3*/link*"}, {"text": "*link to='http://highschoolsports.nj.com/game/score/4607798'*against Lawrenceville Prep on May 7*/link*"}, {"text": "The team’s achievements extend beyond just these two wins– they have a long history of success. “We’ve won the MCT (Mercer County Tennis Championship) 11 times in a row,” Coach Arnold said. “[Also,] we’ve been ranked number two in the state for the last three years in a row.”"}, {"text": "The secret behind their victories is not just plenty of practice. The team shows confidence and passion for the sport they love."}, {"text": "“We’re not result oriented. We’re just looking to get the best out of ourselves,” said senior Alex Yang, team captain. “We’re just looking for a good last run, and to have fun playing.”"}, {"text": "Not only are the players committed to the sport, but they have an unbreakable loyalty to each other. “The thing that we pride above all is being a team and supporting each other no matter what happens,” said senior Siddharth Paratkar, team manager. “The team spirit, […] the comradery that we have is more important than a record for the season,” he added."}, {"text": "Their closeness as a team helps keep their goal in sight."}, {"text": "“We’ve been ranked number two in the state for the last three years in a row, so the day we get to be ranked number one, that’s our goal,” said Coach Arnold."}, {"text": "Yang echoed his ambition. “Last year we got to the finals, so this year we want to see if we can not only match that but see if we can win the state finals.”"}, {"text": "PHOTO COURTESY OF NAMAN SARDA"}], "file_structural_elements": {"title": "Boys Varsity Tennis aces history making match", "date": "May 21, 2019", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "     The South Boys’ Varsity Tennis Team is having a strong year, with big wins such as against North on April 24 with a final score of 2-3.\n     Boys’ Varsity Tennis coach Richard Arnold spoke about their game against Lawrenceville Prep on May 7. “We beat Lawrenceville Prep, which was the first tim", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/IMG-2455-e1558463428183-900x782.jpg"}}