{"tree_elements": [{"text": "Batter up! The great American sport, baseball, has started its season. South’s varsity team is led well by Coach Don Hutchinson and Captain Sean Austin Hodges, a senior at South. The varsity team is made up of fifteen players."}, {"text": "Coach Walter Conner leads the junior varsity team.  The junior varsity team has four captains: junior Seungha Jung, sophomore Morgan Mayer, sophomore Matt Thibault, and sophomore Matt Dorfman."}, {"text": "During practice, the team focuses on its strategy and teamwork. As Hodges said, “Our teamwork is good […] we have a lot of talent on our team. We’re definitely going to improve as the season goes on.”"}, {"text": "Games began in April. The team beat Princeton Day School with a score of 14-6. They scored 14-2 against Lawrence High School and 9-3 against Princeton High School."}, {"text": "Coach Conner said, “The team puts [in] a lot of effort. They get better and better [throughout] the year.”"}, {"text": "Not only is teamwork important, but so is each player’s passion for baseball, as it motivates them to work harder."}, {"text": "Every individual player tries their best to improve. They all have experience in baseball and they use these skills to further develop their abilities."}, {"text": "Mayer said, “I mean, [baseball] is a sport that I really love. I’ve been playing it since I was a little kid. It’s kind of my life.”"}, {"text": "Passion drives the team’s interest in the sport to the fullest while also helping them learn. Hodges reflected, “I’ve started playing probably since kindergarten with T-ball. It’s something I’ve always enjoyed and stuck with for all this time.”"}, {"text": "As the season continues, the team will grow closer and stronger. As Coach Conner said, “There is no disunity when they’re unified.”"}, {"text": "PHOTO BY GRACE CHOE"}], "file_structural_elements": {"title": "Boys Baseball: Teamwork makes the dream work", "date": "May 21, 2019", "writer": {"": {"name": "Grace Choe ", "year": ""}}, "description": "     Batter up! The great American sport, baseball, has started its season. South’s varsity team is led well by Coach Don Hutchinson and Captain Sean Austin Hodges, a senior at South. The varsity team is made up of fifteen players.\n     Coach Walter Conner leads the junior varsity team.  The junior ", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/IMG-4544-e1558464460736-900x881.jpg"}}