{"tree_elements": [{"text": "For the first time the WW-P Cheer team won Grand Champions at the Colonial Valley Conference (CVC) Cheerleading Competition on Nov. 12."}, {"text": "They also placed first in the Game Day Division. Following the CVC competition, the team traveled to the CURE Insurance Arena in Trenton on Nov. 19 to compete at the Universal Cheerleading Association’s NJ Regional Competition. The team secured a second place finish in the Game Day division. They received a bid for nationals in the Game Day division and will compete in the National High School Cheerleading Competition in February 2023 at the ESPN Wide World of Sports Arena in Orlando, Florida."}, {"text": "The two divisions are Game Day and Traditional. Routines in the Game Day division include what is usually performed during sports games: chants, cheers and fight songs. Traditional routines include stunts, jumps, dance and a pyramid."}, {"text": "The South and North cheer programs merged due to low participation.  This is only the second year with a United program, and the girls are closer than ever. The team is led by three captains. Jahnai Minott (‘23), the only captain from South, said, “In the past, especially my freshman year, the girls were very mean and didn’t like including new people like me. Now, we have become more of a very open and loving team that makes new people feel comfortable.”"}, {"text": "With their ability and faith in each other, the cheerleaders pulled through at competitions to reach nationals. But getting to this spot has been no easy task. The team has spent hours preparing themselves for competitions."}, {"text": "“Our team has worked very hard to perfect each routine,” said Head Varsity Coach Morgan Palmer."}, {"text": "Every competition has been a learning step for the team. “Before this routine [at regionals], they had another routine that didn’t go as well. They were nervous and we had to make some last minute changes due to an injury the week prior. As usual, the girls still did their best on the mat and finished strong,” said Assistant Varsity Coach Ferrante."}, {"text": "For many cheerleaders, this season holds special memories. One particularly memorable experience for the coaches and cheerleaders was the Pine Forest cheerleading camp in Pennsylvania. The camp was a sleepaway camp with other teams from the Northeast. At the end of the week, the girls performed the “United Rumble” and brought home the traditions award."}, {"text": "“They spent every waking moment together and formed into a team that continuously supported one another and encouraged each other,” said Coach Ferrante."}, {"text": "South and North’s separate cheer programs have had a history of success As a united team, they continue that legacy."}, {"text": "“This team is paving the way for future WW-P Cheer United teams,” said Coach Palmer."}], "file_structural_elements": {"title": "Cheers for the cheer team", "date": "January 6, 2023", "writer": {"D3a0mfwQpbfGAc3OHPFr": {"name": "Deana Hu", "year": "2022"}}, "description": "     For the first time the WW-P Cheer team won Grand Champions at the Colonial Valley Conference (CVC) Cheerleading Competition on Nov. 12. \n     They also placed first in the Game Day Division. Following the CVC competition, the team traveled to the CURE Insurance Arena in Trenton on Nov. 19 to co", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/65108-900x663.jpg"}}