{"tree_elements": [{"text": "Think back to Feb 13. The sun was setting in New Jersey, and over 2,500 miles away in Inglewood, California, two teams destined for greatness prepared to go head-to-head in Super Bowl 56 at SoFi Stadium."}, {"text": "The Cincinnati Bengals, an underdog team with a young player core behind the captainship of rising star quarterback Joe Burrow, faced a superstar-riddled Los Angeles Rams, who found the missing link for their team, in quarterback Matthew Stafford. With Stafford behind the helm, the Rams were favored to win Super Bowl 56 rings before the end of the summer."}, {"text": "This National Football League (NFL) title game was unlike any seen before. The matchup didn’t include Tampa Bay quarterback Tom Brady, the San Francisco 49ers or retired Denver Broncos quarterback, Peyton Manning, for the first time in years."}, {"text": "“This year, you could say, it was the Super Bowl America wanted,” said senior Satvik Srinivas."}, {"text": "When it comes to the 2022 NFL champions, the Rams put everything on the line by going out and getting the best of the best. At the start of the season, they made countless big-money trades and acquired players such as Matthew Stafford, Odell Beckam Jr, and Von Miller. However, trades of that caliber weren’t cheap; the Rams had to make many sacrifices, too."}, {"text": "“They sold the farm,” said Joseph Porter, a history teacher at South, in reference to trading away all their draft picks. This along with a remarkable amount of money spent is playing a huge factor into the Rams’ newfound uncertainty abouts their future."}, {"text": "Looking at the other side, the Bengals were an unconventional Super Bowl competitor as they lacked the roster depth compared to the Rams. However, many viewed this type of underdog team as appealing and entertaining to watch."}, {"text": "Srinivas said, “This team wasn’t supposed to be here, but I think that doesn’t matter, especially in a league like the NFL. All these players are top-notch, cream of the crop players.”"}, {"text": "The game itself played out as projected by critics, experts, and fans from all around. The Rams did an overall great job at collapsing the pocket and getting to Burrow, while the Bengals put all their chips in for the huge plays downfield."}, {"text": "“Their pass rush with Donald, Von Miller, Leonard Floyd, and all of them getting to Burrow every single play was easily the deciding factor,” said junior Quinn Ferri about his biggest takeaway from the game."}, {"text": "At the end of the day, the Bengals couldn’t quite capitalize on mistakes made by Stafford, and failed to find their groove that they had successfully achieved in their prior playoff matchups, which ultimately led to their demise. The Rams on the other side, played the exact kind of football they had all year, the kind of football that leads to a team hoisting the Lombardi trophy when it was all said and done."}, {"text": "But, as the Super Bowl run falls short for the Bengals’ Cinderella story, we must not forget their journey from expected failure to improbable success."}, {"text": "“We all know a lot of people doubted them coming into the year, a lot of people predicted them to have three to five wins, which is crazy to think they were in the Super Bowl at the end of it,” said Ferri."}, {"text": "Joe Burrow himself also had an amazing story and journey to the Super Bowl. Coming off a season-ending injury last year, he put up amazing numbers in countless regular-season games and showed the experience and nerves of a veteran once he stepped foot into the playoff scene."}, {"text": "Srinivas said, “Joe Burrow is one of those players. Some players have it, and Joe Burrow has it,”"}, {"text": "At the end of the day, the Bengals fell short, and the Rams triumphed. However, when looking to the future the opposite might be said. The Rams could characterize their future as a dark tunnel back to mediocrity while the Bengals recently found light at the end of their tunnel through their young superstars."}, {"text": "Sirinivas said, “Bengals fans should expect to be right back where they were this season.”"}, {"text": "IMAGE BY MARISSA WHITNEY"}], "file_structural_elements": {"title": "Cinderella story falls short", "date": "March 28, 2022", "writer": {"eBIZaiuXNJHFsRIhK5lH": {"name": "Elias Deleger", "year": "2021"}, "DBWPYcvzOSF3dyRvXqwQ": {"name": "Dean Hunsberger", "year": "2021"}}, "description": "     Think back to Feb 13. The sun was setting in New Jersey, and over 2,500 miles away in Inglewood, California, two teams destined for greatness prepared to go head-to-head in Super Bowl 56 at SoFi Stadium.\n     The Cincinnati Bengals, an underdog team with a young player core behind the captainsh", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/finalsuperbowlimage-pdf-900x506.jpg"}}