{"tree_elements": [{"text": "The 24th Winter Olympic Games have concluded in Beijing, China. Athletes traveled from around the world to compete against each other, with hopes of bringing home medals for their respective countries. The Olympics kicked off with the traditional opening ceremony on Feb. 3, and the games finished on Feb. 20."}, {"text": "Due to the pandemic, this year’s Winter Olympics were different than years prior, with a limited amount of spectators, and no international fans were permitted. As for the athletes, well-known figure skaters including Nathan Chen, Anna Shcerbakova, Yuzuru Hanyu, and others captivated audiences all around the globe with their immense talents."}, {"text": "“I am always amazed at the abilities and talents of the athletes involved since I can’t even put skates on correctly,” said Mr. Joseph Porter, an American studies teacher.  “The things their bodies can do is absolutely astounding to me.”"}, {"text": "At the Olympics there are five different figure skating events: the team event, ice dance, pairs, women’s individual, and men’s individual. Figure skating primarily focuses on technical elements such as jumps, combined with artistry and choreography to evaluate the skaters’ performance. Team USA took the bronze medal in ice dance, silver in the team event, and the highlight: Nathan Chen secured a gold medal in the men’s individual event."}, {"text": "“Nathan Chen or Yuma Kagiyama were my favorites to watch compete,” said senior Victoria Tiep."}, {"text": "Figure skating was at the forefront of this year’s Olympics due to a doping controversy surrounding Russian skater Kamila Valieva. According to NPR, she is a minor who had a positive drug test back in Dec. 2021, but the results weren’t reported until Feb. 8 after she had already competed in the team event a day prior. Despite these circumstances, the Court of Arbitration for Sport allowed her to compete in the women’s individual event. As a result of the enormous pressure put on her, she publicly broke down and stumbled to fourth place which left her out of medal contention."}, {"text": "“There’s always some sort of scandal or drama that happens unfortunately,” said senior Vaibhavi Raj, “but we can’t control anything about it so it is what it is.”."}, {"text": "The next Winter Olympics are set to take place in 2026 in the cities of Milan and Cortina d’Ampezzo in Italy. For the upcoming Olympics, there is speculation as to what figure skaters will return to make a comeback, while there is also the new upcoming generation of skaters who are hoping to make their first Olympics a success."}, {"text": "IMAGES BY MARISSA WHITNEY"}], "file_structural_elements": {"title": "Dancing on Ice in Beijing", "date": "March 23, 2022", "writer": {"MNQBpPiewE2i25uloP4l": {"name": "Marissa Whitney", "year": "2021"}}, "description": "The 24th Winter Olympic Games have concluded in Beijing, China. Athletes traveled from around the world to compete against each other, with hopes of bringing home medals for their respective countries. The Olympics kicked off with the traditional opening ceremony on Feb. 3, and the games finished on", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/Screenshot-2022-03-23-1.07.32-PM.png"}}