{"tree_elements": [{"text": "According to district officials, The New Jersey State Interscholastic Athletic Association (NJSIAA), the primary governing body concerning kids’ sports, may not be putting students’ health first when it comes to recommending them to “return to play.”"}, {"text": "In a statement issued to USA Today, the NJSIAA stated that it will answer “no questions” concerning their financial status."}, {"text": "On Aug. 6, WW-P superintendent Dr. David Aderhold officially announced the cancellation of fall sports."}, {"text": "“Professional and collegiate athletic programs must endure changing conditions such as daily COVID-19 testing, altered living arrangements, and constantly shifting schedules due to the cancellation of games. These teams have access to resources that far exceed our local school districts, and yet we pretend that school districts can pull off our seasons simply because we desire the return to normalcy,” said Dr. Aderhold in his Aug. 6 letter concerning the matter."}, {"text": "The announcement was met with widespread disappointment and anger from students and parents. The lack of communication from the administration when making the decision, as well as the fact that all but 11 schools in New Jersey are participating in fall sports, contributed to the strong feelings and protests that occurred afterward."}, {"text": "But in a Sept. 19 email directed towards parents and students involved in the #letusplay movement, WW-P Superintendent Dr. David Aderhold stated that the NJSIAA’s request of hundreds of thousands of dollars to offset debt has “laid bare the questionable motivating factor behind the NJSIAA’s decision to risk the health and safety of student-athletes.” This factor, as Dr. Aderhold stated, prompted the NJSIAA to speed up the process in which schools could get kids back onto the field quicker."}, {"text": "WW-P Athletic Director and former South student-athlete Katherine Dobinson reiterated the sentiment, saying, “I think it is fair in any situation that people are going to question motives.”"}, {"text": "On Sept. 30, New Jersey Governor Phil Murphy signed a budget bill for the entire state of New Jersey; one that gave the NJSIAA a one-time payment of a reported $625,000 to offset the debt that occurred during the months of the coronavirus pandemic."}, {"text": "“I actually did not know about the debt,” said Emma Gardenburg, a senior involved in the #letusplay movement."}, {"text": "“When we were talking in groups for the #letusplay movement, no one brought up making money for this organization. It was all about wanting to play,” said senior Daniel Grund, who was a student leader advocating for a return to fall sports."}, {"text": "The #letusplay movement was a response to the decision of WW-P to cancel the school’s fall sports teams. The movement helped spread the message of camaraderie and joy that comes with playing sports and demonstrated togetherness and collaboration in a time of distance and isolation."}, {"text": "Questions about the NJSIAA remain, but most schools are moving along in the process to play fall sports regardless of the accusations. WW-P accounts for two (North and South) out of the 11 schools opting not to participate in fall sports."}, {"text": "Princeton High School, WW-P’s neighbor school, opted to participate in fall sports. It was fully virtual academically until Oct. 1, in which a tentative plan to integrate students in person was initiated."}, {"text": "“We are cautiously optimistic,” said Mike Dzbreski, Health and Athletic Director for Princeton High School. In addition to a website detailing information on the coronavirus, Princeton High School has also invested money, research, and “constant communication” to ensure the safety of students."}, {"text": "When asked about the NJSIAA’s intentions, Dzbreski said, “They’re trying to do what’s in the best interests of kids.” This is a sentiment shared by many of the other schools as well, as WW-P is the only school to directly address the NJSIAA’s intentions publicly."}, {"text": "Does this matter in the big picture though?"}, {"text": "“If we don’t have NJSIAA then what would we have? You have to have a governing body in the state of NJ that oversees athletics.”"}, {"text": "As for the money?"}, {"text": "“Whether or not they need money . . . it’s money well spent,” Dzbreski said."}, {"text": "Forgetting about which side one supports, the students at South are using their voices to do something they love. Whether or not you agree with the return to play, the movement, as Grund said, was to “get our movement out there” and to “get the district and community behind us.”"}, {"text": "While there is no announcement as to whether winter sports will take place in WW-P, the possibility of spring sports looks increasingly likely, as many of the fall sports programs have been pushed to the spring. For now, though, the only thing one can do is wait."}, {"text": "Image by Ishita Jadon."}], "file_structural_elements": {"title": "Fall sports dilemma: To play or not to play", "date": "November 9, 2020", "writer": {"": {"name": "Leo \"Satch\" Berger", "year": ""}}, "description": "     According to district officials, The New Jersey State Interscholastic Athletic Association (NJSIAA), the primary governing body concerning kids’ sports, may not be putting students’ health first when it comes to recommending them to “return to play.”\n     In a statement issued to USA Today, the", "image": "https://thepirateseye.org/wp-content/uploads/2020/11/9651FE96-835B-4A17-BF25-14AC23A0FE02-900x675.jpeg"}}