{"tree_elements": [{"text": "The boys’ and girls’ fencing teams made their return to the strip, playing area where they hold matches, after a year-long hiatus due to the COVID pandemic. There was uncertainty about this season due to the turnover of players–last year’s seniors graduated and new players joined. But Pirates showed their mettle: the girls’ team finished fifth and the boys’ team finished third in the state."}, {"text": "Two years ago, pre-pandemic, both the boys’ and girls’ teams finished with winning records and qualified for the State Tournament. But last year both teams had a modified season and they only competed against North due to COVID. As a result, they entered this season with many new faces and only a few experienced members."}, {"text": "The boys’ and girls’ teams welcomed in new head coach Henry Hill and assistant coach April Licato two weeks before the season started. Coach Hill is a math teacher at Community Middle School, and Coach Licato is a math teacher at High School North."}, {"text": "“I coached the past two years as an assistant coach at a different school, so I was familiar with a very specific culture I had spent a lot of time in,” said Coach Hill. “[At South], the culture is just so different, and finding ways to both take the culture that was already here and accept that as well as making small changes I thought were important, was something I wanted to do.”"}, {"text": "Despite the switch to new coaches, the transition still went smoothly and both teams prepared for the season ahead. “The biggest thing that I admire about our team is that no matter what, we keep going, we keep trying,” said senior Anushya Shankar, the girls’ fencing team captain."}, {"text": "This passionate mentality led to the girls’ team finishing with a 7-5 record, including a quarterfinal appearance at the at the State Tournament, and a second-place finish at the District 6 tournament."}, {"text": "“Finishing second at Districts was definitely one of my favorite moments this season and from my fencing career in high school,” said Shankar."}, {"text": "The boy’s fencing team also had a remarkable season, as they had an 11-3 record, placing third at States and first at the District 6 tournament. Boys’ fencing captain Arnav Rastogi said, “It’s my senior year, so there’s no better way to end my career. Finishing first in your District and third in the State, it’s an exceptional feeling.”"}, {"text": "Looking back at this season, Rastogi emphasized that the boys’ team was successful because they fenced as a team. Their wins were a result of every single fencers’ contributions, rather than a select few’s efforts. “If one person does bad, the entire team picks us up, and that’s really been a theme this season. I didn’t fence my best at Districts, but my teammates picked me up and we got the win, so we really put an emphasis on the team this year and continuing the winning culture that we’ve established,” said Rastogi."}, {"text": "Similarly, Shankar said how proud she was of the girls’ team and their determined spirit. She recalled that in a suspenseful State tournament matchup against Indian Hills High School the score was 12-12 going into the final three bouts."}, {"text": "“I just remember that whole third round, even though we were down, even though score-wise it wasn’t looking good for us, we still really pushed and we still kept the energy going, and I think that’s what ultimately led us to win,” she said."}, {"text": "Through their perseverance and teamwork, both the boys’ and girls’ fencing teams left their mark on the New Jersey high school fencing scene this season."}, {"text": "“I’m really glad they could do it for themselves,” Coach Hill said. “Being able to give them a long post-season and really give them an opportunity to excel this year was awesome.”"}, {"text": "PHOTOS BY ARNAV RASTOGI AND ANUSHYA SHANKAR"}], "file_structural_elements": {"title": "Fencing team leaves its impact on the strip", "date": "March 23, 2022", "writer": {"QRo3uk5mtYwXdbxUvUF1": {"name": "Edward Kim", "year": "2021"}}, "description": "The boys’ and girls’ fencing teams made their return to the strip, playing area where they hold matches, after a year-long hiatus due to the COVID pandemic. There was uncertainty about this season due to the turnover of players–last year’s seniors graduated and new players joined. But Pirates showed", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/Screenshot-2022-03-23-1.23.06-PM.png"}}