{"tree_elements": [{"text": "“Working out keeps me sane and clears my head,” said senior Amy Deng. “Because everything is virtual, we’re pretty much staring at technology the whole day which I honestly don’t think is that healthy. I don’t bring my phone when I go running, and it feels really nice,”."}, {"text": "Keeping up with an active lifestyle allows a break from sitting in front of a screen practically all day. COVID-19, a new deadly virus, turned into a pandemic in early March, causing millions of Americans to abruptly change their accustomed day to day schedule as states called for lockdowns."}, {"text": "On March 21, New Jersey Governor Phil Murphy announced a statewide “stay at home” order, which included an evening curfew and restrictions on large gatherings. Additionally, schools shifted to virtual learning state-wide. Approximately 1.37 million students were impacted: many of them athletes looking forward to another spring season."}, {"text": "Since South’s spring sports season and other recreational clubs have been cancelled, many athletes are seeing that finding the motivation to stay physically active can be difficult. Although most athletes may be upset about this situation, they can discover new hobbies or activities that can bring back high spirits."}, {"text": "One of South’s wonderful gym teachers, Ms. O’Connell, has great advice for staying physically active: “My suggestion is to keep your body moving continuously throughout the day, take small exercise breaks. Try to find fun ways to sneak in exercise and keep it fresh. If all you can do is go for a walk then get outside and enjoy the fresh air! This will definitely make you feel better.”"}, {"text": "Junior Priyanka Kaul was disappointed about her cancelled softball season, but she has been making the best of quarantine."}, {"text": "“I’ve been practicing inside my garage with my softball equipment. It’s been better for my schedule because it gives me a lot more time to practice and work out, but also worse because I can’t get better by going to the gym or the field,” Kaul said. These flexible adjustments that Kaul is making during quarantine demonstrate her commitment in refining and maintaining her softball skills."}, {"text": "Even under the quarantine, athletes are not restricted from practicing on their own and working with the equipment they have at home. Athletes can use this time to improve on their overall abilities in order to come back to their next season even stronger."}, {"text": "Moreover, Deng, a dancer, admitted,“Life’s going to go on after quarantine so if I have all this time, why not be productive?” Deng has an intense workout routine that includes running, HIIT (high intensity interval training), strength training and dance. Deng is devoted to continuing an active lifestyle, which has helped her feel more motivated and happy during quarantine."}, {"text": "Running may not be everyone’s forte, but the options for physical activity are endless. Going on a bike ride, jumping rope on your driveway or following at-home workouts are just a few alternatives to vigorous exercises. For example, YouTube channels such as “Chloe Ting” and “Emi Wong” offer a wide variety of at-home workouts to choose from, such as full body, legs, abs and arms."}, {"text": "Junior Irena Chen said, “I have been watching YouTube workout videos to stay physically active and they are quick to do.” Most workout videos available online are short and easy to follow, so people can find workouts that are suitable for them."}, {"text": "Exercising should never be a tasking activity; in fact, there are always other options available for a fun workout. Even if it takes time to find a physical hobby that you enjoy, the discovery will be very rewarding. As Gene Tunney, a world-class professional boxer, once said: “Exercise should be regarded as tribute to the heart.”"}], "file_structural_elements": {"title": "Fitness during quarantine", "date": "June 15, 2020", "writer": {"IEgx27jeMWPMtV0BxA2O": {"name": "Melissa Liu", "year": "2021"}}, "description": "     “Working out keeps me sane and clears my head,” said senior Amy Deng. “Because everything is virtual, we’re pretty much staring at technology the whole day which I honestly don’t think is that healthy. I don’t bring my phone when I go running, and it feels really nice,”.  \n     Keeping up with ", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/Screen-Shot-2020-06-15-at-12.02.23-PM-900x599.png"}}