{"tree_elements": [{"text": "For the first time in over 30 years the USA National Men’s soccer team beat the Mexican National Men’s soccer team three times in one year."}, {"text": "This is a gratifying turn of events for USA soccer fans. Four years ago, USA failed to qualify for the 2018 World Cup. “When the USA soccer team didn’t qualify in 2018, I felt embarrassed and frustrated,” said sophomore Daniel Pulido. It was a heartbreak for the players to not play in the most popular sporting event in the world."}, {"text": "Years of losses was an eye-opener for the squad and made them realize that they needed to improve in many areas. On the field, the team created so many chances to score but couldn’t seem to put the ball in the back of the net."}, {"text": "Today, the Fédération Internationale de Football Association (FIFA) has ranked the USA soccer team 12th in the world, just below Germany, the winners of the 2014 World Cup."}, {"text": "Fans all over the United States are starting to put their faith in the team again. “I think they’re the best candidate in the CONCACAF to make it far,” said junior Johnny Cruz."}, {"text": "The United States is just one point behind first place, and if they can overtake Canada they will be in prime position to win entry in the North American Qualification. With six games left, it’s going to be a very intense finish, as Mexico, the USA, Canada and Panama are all within two points of each other. They are all fighting for the top spot in the group to make the 2022 World Cup, which will be held in Qatar."}, {"text": "“My favorite player on the team is Christian Pulisic,” said senior Dylan Elias."}, {"text": "When Pulisic is not playing for the USA team he is playing at Chelsea, a soccer club based in London, England. Another standout player is Weston McKennie, who plays for the club Juventus in Italy. Everyone who plays for the United States also plays for a club team which can either be a team abroad or here in the United States."}, {"text": "The United States soccer team’s winning streak is gaining attention and adding fans from around the world."}, {"text": "In a November article on CBS Sports online, Roger Gonzalez said, “I think the results have put this team on a sure path to the 2022 World Cup, and they’ve handled some massive challenges along the way. They still have to go to Mexico and Costa Rica, but United States Men’s National Team fans can feel confident in them qualifying.”"}, {"text": "Three years ago no one respected the USA National Men’s team in world soccer, but today they have emerged as one of the best teams in the world."}, {"text": "PHOTO BY MAJOR LEAGUE SOCCER"}], "file_structural_elements": {"title": "Flight to Qatar imminent for US Men’s soccer team?", "date": "January 18, 2022", "writer": {"DBWPYcvzOSF3dyRvXqwQ": {"name": "Dean Hunsberger", "year": "2021"}}, "description": "     For the first time in over 30 years the USA National Men’s soccer team beat the Mexican National Men’s soccer team three times in one year.\n     This is a gratifying turn of events for USA soccer fans. Four years ago, USA failed to qualify for the 2018 World Cup. “When the USA soccer team didn’", "image": null}}