{"tree_elements": [{"text": "After a series of athletic adjustments due to COVID-19, South’s sports are fi- nally getting back to routine; one team that’s starting this season is the Girls Golf team."}, {"text": "The South Girls Golf Team is coached by Michelle Walsh and began practic- ing as soon as winter arrived. With practices continuing during the spring season, the golf team is excited to start building a team relationship with their players."}, {"text": "“We want to continue to build on the culture of sportsmanship,” said Mrs. Walsh. “I hope to rebuild the culture we had pre-COVID with the golf team.”"}, {"text": "Golf may be a sport based on indivi- dual play, but the girls all share a positi- ve experience with each other when it comes to bonding as a team."}, {"text": "“I swear, we are the best team,” said sophomore Zofia Bath excitedly, a varsi- ty player who has been on the team for 2 years. “The girls on this team are like my second family.”"}, {"text": "Because of COVID-19, the golf team started late last year with a few restric-tions. This included following all safety protocols to keep practices safe and pre- vent the spread of COVID-19."}, {"text": "“We weren’t allowed to play in out-side tournaments, and social distancing interfered with group events like banquets,” explained Ms. Walsh."}, {"text": "While golf may have had a rough sta- rt last year, the girls are back, ready to play, and ready to work hard. They have to leave school early with practices starting at 2:15 p.m. and coming back home at 6 p.m."}, {"text": "Through these everyday practices, the golf girls are priming themselves to start off a series of tournaments throughout the season."}, {"text": "“We split up into groups when we go out, and you’re always in the same group,” said freshman Ayla Mir, who started her first season with the golf team. “It’s nice to talk to people who have something in common with me, because not a lot of girls play golf in our school. The girls I’ve been with, I get to talk to a lot.”"}, {"text": "The girls have a lot of discussions while practicing, allowing them to connect with their teammates. “When together, we talk about our lives and tell jokes,” said freshman Kali Gupta. “We also talk about friends, and have those stupid conversations everyone does when we don’t know that we’re talking about.” On the field, the girls support each other too."}, {"text": "“In matches, the scores of the top four girls are added up and compared to the opposing team’s top four scores, so it really is a team sport,” said Bath."}, {"text": "“It’s a great, great group of people and it’s a sport that you can play for the rest of your life,” said Mrs. Walsh."}], "file_structural_elements": {"title": "Girls’ golf aces its comeback", "date": "June 20, 2022", "writer": {"": {"name": "Suhani Gupta", "year": ""}}, "description": "     After a series of athletic adjustments due to COVID-19, South’s sports are fi- nally getting back to routine; one team that’s starting this season is the Girls Golf team.\n     The South Girls Golf Team is coached by Michelle Walsh and began practic- ing as soon as winter arrived. With practices", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/image2-900x675.png"}}