{"tree_elements": [{"text": "Extensive conditioning, swim practices as early as 6:45 a.m. and hours perfecting technique have paid off for the Pirate swimmers. On Jan. 17, the girls’ swim team reached an outstanding 12-0 undefeated record that has not been achieved since 2016,  while the boys’ swim team reached an impressive 10-2 record."}, {"text": "To top off a great season, the girls’ team came in second place at the Annual Mercer County Swim Tournament, only losing to Hun, a private school and placing first in the division for public schools. With an impressive season coming to an end and reaching the semifinals at sectionals it is important to reflect on the process of reaching such a significant accomplishment."}, {"text": "Before the girls’ swim team embarked on this arduous journey, the team collectively set up a goal to work towards, a crucial step in creating a successful season."}, {"text": "Senior Gabby Khoury, the girls’ swim team co-captain, said, “The biggest [goals] were to have an undefeated season, to dominate in the Pirate Invitational.” The Pirate Invitational is a home meet where the South team invites other local teams She added that their other goals were to “place higher than sixth at Counties and to finally beat Manasquan High School in the sectional bracket.”"}, {"text": "Pirate swimmers certainly achieved their goal of an undefeated season. For the past four years, the girls’ team has lost to Manasquan in the Sectionals tournament. Their victory over Manasquan this year reflects their hard work."}, {"text": "Khoury said, “A lot of girls seemed like they were afraid to fail or lose, so they would have an excuse in the back of their minds as to why they didn’t win. We urged the girls to just leave everything in the pool. If someone had a bad race the whole team was quick to cheer them up with any comedic material that they had.”"}, {"text": "Not only did setting goals comradery and humor contribute to Pirate success, strong leadership from the co-captains, Khoury, Shefali Kumar and Karina Chao, led to an undefeated season."}, {"text": "Coach Turner, head swim coach, said, “We have three really great captains this year and our group of seniors are just really great leaders to help work towards that undefeated season.” In team sports, captains bring the team together. Since the swimmers compete individually, the swim captains must create a support system so team members are mindful of working together."}, {"text": "Khoury said, “As a captain, it’s your job to lead your team and keep things in place.” Khoury continued, “Not a lot of people think that swimming is a team sport, but you are working with your teammates to accumulate more points than your rivals.”"}, {"text": "As a result, it is crucial for the Pirate swimmers to collaborate and compete in areas that will help the team the most."}, {"text": "Most importantly, Pirate girls swimmers were motivated to achieve an undefeated season. During the 2017 swim season, they were only one match away from an undefeated season, only losing to North."}, {"text": "Coach Turner said that the girls’ team“ have been pretty close with undefeated seasons and the seniors especially wanted to improve upon how they did so they have always been working towards an undefeated season.” Turner continued, “Last year, we only lost one meet and came sixth in counties and I think they were upset they didn’t really feel that the results proved what South swimming is about so this year they wanted to improve.”"}, {"text": "Varsity swimmer Ashley Own said, “This season, I set more goals for myself not just long term, but for each day. Each practice there was always a certain objective and I would always strive to achieve it.”"}, {"text": "For this season, in particular, many swimmers focused on the swim team instead of the club team."}, {"text": "With the combination of technique, organization, leadership and motivation, the Pirate girls’ swimmers were on the road to success. However, naturally, in every journey to success, there are obstacles."}, {"text": "Own explained, “During Counties, one of our top swimmers was, unfortunately, unable to race. At first, the news caused a lot of worrying and doubt. ” She said, “Many girls had to swim more events than they were originally supposed to and we had to switch around our lineups. It was just a matter of who was willing to rise to the occasion and I think all of us  did.” She added, “In the end, we really pulled through.”"}, {"text": "Even with obstacles to overcome, the Pirate girls’ team ended with a successful season.      “In the future, I hope the girls continue to keep the excellence of this swim team.” Khoury said, “The culture that has been built and maintained is something that has affected my entire high school experience.”"}, {"text": "PHOTO COURTESY OF NAQSH MITRA"}], "file_structural_elements": {"title": "Girls pirate swimmers dominate 2018 – 2019 swim season with undefeated track record", "date": "March 28, 2019", "writer": {"": {"name": "Cathy Xiang", "year": ""}, "uCLiBSNVw88B8cvjzOCS": {"name": "Naqsh Mitra", "year": "2018"}}, "description": "     Extensive conditioning, swim practices as early as 6:45 a.m. and hours perfecting technique have paid off for the Pirate swimmers. On Jan. 17, the girls’ swim team reached an outstanding 12-0 undefeated record that has not been achieved since 2016,  while the boys’ swim team reached an impressi", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/Screenshot-2019-03-28-at-4.51.15-PM.png"}}