{"tree_elements": [{"text": "“Go Knirates!” shouted the WWP girls Ultimate Frisbee team, adrenaline rushing as they watched the seven players on-field run toward the disc. Remembering those games now, the team often wonders, “What if times were different?”"}, {"text": "The WWP girls team was founded as Wind Dragons in 2014. After splitting into North Knights and South Pirates in 2017, the team reunited again in 2019. Unfortunately, the team’s first year back together was cut short by the coronavirus pandemic, as many tournaments, scrimmages and other activities were canceled."}, {"text": "“I miss going to tournaments and going to practice so much,” said co-captain Eveline Shiao, a senior at North. “After a long stressful day at school, it felt amazing to go outside and exercise with friends.”"}, {"text": "North sophomore and team treasurer Urjita Kaishan added, “The renewed sense of drive and determination I felt before games was something I had never experienced before. I can’t wait to get back on the field with my teammates and go to tournaments once it’s safe.”"}, {"text": "As the co-captain of the team, South senior Wenyi Guo said that it has been difficult to manage elements virtually. “I find it hard to maintain the team and try to be in action as much as possible virtually. I just don’t find the motivation sometimes.”"}, {"text": "Shiao said, “Because we don’t have tournaments and we can’t hold in-person practices, I lose motivation to get outside. And I am sure it is not just me.”"}, {"text": "Despite these circumstances, the team has been keeping a positive attitude and striving to stay in touch with each other and with the sport itself."}, {"text": "The team organizes many events, one of them being weekly workouts. “We are very fortunate to have Trisha, our wonderful secretary, host workouts to get us up and moving,” said Kaishan."}, {"text": "Trisha Kopparthi, a junior at South, believes that although these sessions cannot replicate frisbee games, they might provide a similar getaway to her teammates much like in-person practices did before the pandemic."}, {"text": "Once in a while, the spirit captains, who are usually responsible for sustaining intra- and inter-team chemistry, also hold bonding sessions: a two-hour zoom meeting where teammates can hop off and on anytime to join the others in games such as Pictionary, Among Us and Paranoia."}, {"text": "Shiao explained that her favorite memory from the night was playing Among Us. Kopparthi said that simply talking to her team cheered her up."}, {"text": "Allison Millinger, co-spirit captain and a sophomore at North said, “We got to see a lot of different kids who might not have been able to come to workouts.”"}, {"text": "Meanwhile, Shiao and Guo are planning to continue Winter Conditioning using a virtual platform to better prepare for a potential spring/summer season. “Normally, we would get together once a week to run together,” said Shiao. Currently, they are devising a workout that adheres to the COVID-19 guidelines while also maintaining the rigor from the previous years."}, {"text": "As the captains are working to keep the team physically active, the other players are finding new ways to connect with the Frisbee community. This emphasis on being spirited and active comes from the nature of the community and sport itself. Guo said, “Ultimate Frisbee values the spirit of the game, as players, we all try our best to protect the integrity of the game and we never put winning/losing over the feelings of any players.”"}, {"text": "Like the community, the WWP girls team makes great efforts to be inclusive and welcoming. “Ever since my first day of playing, I have been shown so much positivity, encouragement and kindness,” said Kopparthi. “I am truly so grateful for everyone on the team and I am fortunate to have met them all.”"}, {"text": "To many on the team, Ultimate Frisbee is their second family and the team keeps them moving forward during these times. “I know that I am supported by everyone on the team for who I am and they push me to be a better player, person and friend,” said Millinger."}, {"text": "Shiao said: “I have hope that things may return to normal in the spring and I just have to keep my head up.”"}, {"text": "Hucking: to throw over a long distance."}, {"text": ""}, {"text": "PHOTOS COURTESY OF TANVI SINGH."}], "file_structural_elements": {"title": "Hucking through the pandemic", "date": "February 4, 2021", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "     “Go Knirates!” shouted the WWP girls Ultimate Frisbee team, adrenaline rushing as they watched the seven players on-field run toward the disc. Remembering those games now, the team often wonders, “What if times were different?” \nThe 2018 South Pirates Girls Ultimate Frisbee team convenes for a ", "image": "https://thepirateseye.org/wp-content/uploads/2021/02/WWP-Fall-2019-900x694.jpg"}}