{"tree_elements": [{"text": "This school year, South gym goers are excited as ever as they had the opportunity to show their progress in the first Iron Pirate competition of the year."}, {"text": "The biannual Iron Pirate competition is an individual event where participants demonstrate their one repetition maximum in bench press, squat, and deadlift. The lowest amount of weight a male must lift in order to receive the Iron Pirate title is 500 pounds when combining all three weights. Checkpoints go up from there by earning Elite at 600 pounds, Boss Black at 700, Boss Red at 800, and the 1,000 pound club."}, {"text": "For females, 300 pounds results in the South Strong title, 400 pounds for Elite, Boss Red at 500 pounds, and Boss Green and Gold at 600 pounds."}, {"text": "Lifting 800 pounds to some who do not regularly enter the gym might sound like an unattainable feat, and that may stand true for many after listening to some of the more impressive competitors."}, {"text": "“Once I heard Iron Pirate was back, I’ve been training ever since I was able to come to the weight room,” said senior Owen McCarron.“It’s five days a week in school, one day a week on the weekends, but I have Sundays off.”"}, {"text": "To newcomers who are just starting their weight room careers, that amount of dedication and time commitment may seem daunting, but many have a less stressful routine that is also as effective."}, {"text": "“I am going around three days a week.” said senior Guhan Pradeep, previous Iron Pirate."}, {"text": "This type of routine incorporates rest days after every workout to maximize muscle growth and strength. “It’s different for everyone as it’s based on your own body,” said Pradeep."}, {"text": "A common and intimidating reason many are shy to expose themselves to the weight room environment is the self-consciousness that comes with competing with others. But these gym enthusiasts are nothing but hype men for the newcomers, creating one of the most supportive and tightly knit sports environments."}, {"text": "“I started off watching a lot of Youtube and finding videos of trusted lifters and other athletes,” said McCarron."}, {"text": "McCarron isn’t afraid to admit that the best way to begin is by starting small. “There’s nothing ever wrong with it.”"}, {"text": "This competition included many new faces to the scene, such as junior Alexis Contes. Her experience in the South weight room began two months ago."}, {"text": "“I suggest that newcomers go with people that they know,” said Contes when asked about how she followed through to prepare for the Iron Pirate competition."}, {"text": "The competition was open to all interested. It included an attainable introductory weight of 300 or 500 pounds."}, {"text": "Weight room supervisors, language arts teacher Daniel Brack and social studies teacher Mike Garzio, are always there to encourage students and to help out with correct form."}, {"text": "“Motivating others to see the benefits of strength training and getting people to challenge themselves is a passion of mine,” said Mr. Brack. “I love coaching people to lift weights and seeing them get better and better at the lifts. It’s the main reason why I supervise the weight room.”"}, {"text": "Although it’s too late for a new audience of interested athletes to participate in this winter’s Iron Pirate competition, the opportunity is still available later in the school year. A second Iron Pirate competition will occur this upcoming spring."}, {"text": "PHOTO BY ELIAS DELEGER"}], "file_structural_elements": {"title": "Iron Pirates back in competition", "date": "January 18, 2022", "writer": {"eBIZaiuXNJHFsRIhK5lH": {"name": "Elias Deleger", "year": "2021"}}, "description": "     This school year, South gym goers are excited as ever as they had the opportunity to show their progress in the first Iron Pirate competition of the year.\n     The biannual Iron Pirate competition is an individual event where participants demonstrate their one repetition maximum in bench press,", "image": "https://thepirateseye.org/wp-content/uploads/2022/01/Eliasironpiratearticleimage.png"}}