{"tree_elements": [{"text": "The stands shook, the players lined up, the crowd thundered and television viewers cheered throughout the country on Feb. 2 for the 54th National Football League Super Bowl."}, {"text": "The San Francisco 49rs played the Kansas City Chiefs at Hard Rock Stadium in Miami, FL for the NFL Super Bowl championship. With a final score of 20-31 the Chiefs walked away with the Vince Lombardi trophy at the end of the night–their first Super Bowl appearance and win in 50 years."}, {"text": "The Chiefs also previously played at the very first Super Bowl in 1967, losing to the Green Bay Packers 35-10."}, {"text": "Joseph Porter, coach of the North and South United Football team and American Studies II teacher, thought this history would help the Chiefs during the Super Bowl, “They have been around the playoffs for a while so I definitely thought they had the experience to make a run.”"}, {"text": "The game started with a victory for the 49rs at the coin toss for the ball. The San Francisco team elected to kick the ball off to the Chiefs and start defensively. The quarter ended with a score of 3-7, the Chiefs with the upper hand. In the second quarter the roles were reversed 7-3 and the teams tied."}, {"text": "Senior Abhinav Pandey said it was the most impressive thing about the game. “Usually it’s never really a tie at the Super Bowl, so that was pretty interesting.”"}, {"text": "The halftime show, featuring Shakira and Jennifer Lopez, entertained fans as they waited for the tied game to start again."}, {"text": "Third quarter the 49rs played strong, making 10 new points to the Chief’s 0."}, {"text": "Facing a 10 point deficit, Chiefs quarterback 24-year-old Patrick Mahomes kept his cool, leading the team to victory with three touchdown runs in the last six minutes and 13 seconds of the game."}, {"text": "“When Patrick Mahomes hits those huge third down plays, that was like ‘alright, I feel like now they’ll get away with this,’” Mr. Porter said."}, {"text": "Abhinav Pandey said, “I think the biggest mistake the 49rs made is when they got loose towards the end. They were up 10 and they thought ‘oh I think the game is in our hands’ and their defense loosened up a bit.”"}, {"text": "Mr. Porter agreed, “You have to play the entire game because it’s the Super Bowl.”"}, {"text": "The 49rs ended up walking home with nothing. Mr. Porter explained how during the fourth quarter, the team struggled with their playing momentum. “They threw huge, huge interceptions. Momentum’s a physical force; but you can feel it too. The energy just goes out of you.”"}, {"text": "On the other side, the Chiefs remained determined. “They had so many different weapons: the quarterback is amazing, the receivers are good, the defense is really good,” said Mr. Porter about his outlook on the team."}, {"text": "For Junior Ishita Pandey, the Chiefs’ biggest asset was their quarterback. “Winning the game and turning the whole game in the last quarter was just amazing.”"}, {"text": "The NFL agreed, awarding Mahomes Most Valuable Player. “To see him rallying the troops on the sideline, watching the defense, cheering for his teammates and keeping his attitude positive, that’s huge,” said Mr. Porter."}, {"text": "Mahomes ability to overcome a deficit has been one of the Chiefs’ highlights this season. During their American Football Conference championship game against the Tennessee Titans, Mahomes was able to bring the team back from another 10 point deficit."}, {"text": "Many are optimistic about Mahomes’ future with the Chiefs."}, {"text": "“It’s changing up the old guard now. Patrick Mahomes is only 24 years old. Tom Brady [of the New England Patriots] is 42, to put that in context. So [Mahomes] has a long career ahead of him,” said Mr. Porter."}, {"text": "Mr. Porter and Pandey both plan to watch the Super Bowl next year. “I think it should be like a national holiday,” said Mr. Porter."}, {"text": ""}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Kansas City Chiefs bring home Super Bowl victory after 50 years", "date": "February 13, 2020", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "The stands shook, the players lined up, the crowd thundered and television viewers cheered throughout the country on Feb. 2 for the 54th National Football League Super Bowl.\nThe San Francisco 49rs played the Kansas City Chiefs at Hard Rock Stadium in Miami, FL for the NFL Super Bowl championship. Wi", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/KC-Chiefs-1-900x670.jpg"}}