{"tree_elements": [{"text": "Football, basketball, and baseball have long been the staples of American sports. But another lightning fast, physical competitor is slowly captivating much of the country’s youth: lacrosse."}, {"text": "According to a 2018 study by Samford University, the total number of lacrosse players in North America increased from 1.2 million in 2007, to 2.9 million in 2017. But what makes lacrosse so enticing to high school students who make up the majority of that figure?"}, {"text": "“I think what draws people is the unique nature of the sport,” said senior Owen Birkland, who plays on the boys varsity team. “The high pace and the skill work needed to compete forces new kids to learn and work hard at the sport, and this year we had a lot of new kids, especially seniors.”"}, {"text": "One of those first time players, senior attackman Amaan Modan, said the speed of the game drew him in."}, {"text": "“I enjoyed the quick tempo of the game and how the transition from defense and offense is very quick and fluid,” he said."}, {"text": "Several other players think the accessibility for new and ambitious students are enticing."}, {"text": "“Anyone can learn how to throw and catch with a lacrosse stick,” said junior goalie Isabella Colitsas. “But to get really good at it is very challenging.”"}, {"text": "There is much more to lacrosse than just the mechanics of the game and the on-field experience. Senior midfielder Becca Arbeiter, who has played since she was in first grade, gets plenty of emotional fulfillment from the sport as well."}, {"text": "“I really like being part of a team,” she said. “Getting to be goofy at practice with everyone else is fun and you’re not scared of being judged on our team.”"}, {"text": "In a sports season featuring other more individualized sports like track and field and tennis, lacrosse provides that cooperative option for Arbeiter and other students."}, {"text": "“That idea of winning as a team and losing as a team has always been really inspiring to me, and I think I really get that through lacrosse,” said Colitsas."}, {"text": "Just like much of the rest of the country, the boys and girls lacrosse teams continue to grow, a trend that the graduating seniors hope will continue in the future."}, {"text": "“I think the most important thing is that people don’t feel scared to start lacrosse,” said Arbeiter."}, {"text": "So next spring, if you’re looking for something to spend your time on, consider picking up a lacrosse stick, and join the millions of students around the country setting a new trend."}], "file_structural_elements": {"title": "Lacrosse gains national popularity", "date": "June 22, 2022", "writer": {"xcHHOYKQ8MJMj6FRgYiE": {"name": "Danny McElroy", "year": "2021"}, "DBWPYcvzOSF3dyRvXqwQ": {"name": "Dean Hunsberger", "year": "2021"}}, "description": "Football, basketball, and baseball have long been the staples of American sports. But another lightning fast, physical competitor is slowly captivating much of the country’s youth: lacrosse.\nAccording to a 2018 study by Samford University, the total number of lacrosse players in North America increa", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/Screenshot-2022-06-22-at-5.25.41-PM-900x455.png"}}