{"tree_elements": [{"text": "The lacrosse players crowd together for a team photo, grinning as they proudly hold their lacrosse sticks in front of South’s bleachers. Little did they know that this would be their last photo with the class of 2020."}, {"text": "Because the coronavirus pandemic closed schools and shifted learning online, sports teams could no longer meet and the seniors missed their last season."}, {"text": "This spring season was important, especially to the girls lacrosse team."}, {"text": "“We really thought we were going to beat North,” said senior Kaitlynn Mattia, captain of the team, commenting on North’s three-year win over South. “This was going to be our year.”"}, {"text": "They also missed Senior Night, a celebratory event where seniors play their last home game at South."}, {"text": "“What I was looking forward to was Senior Night because that’s always something special,” said senior Amanda Guest, a co-captain with Mattia."}, {"text": "But even during quarantine, the girls lacrosse team continued to support their seniors on the day that would typically be Senior Night."}, {"text": "“The underclassmen on the team got together and put together gift bags and made them their senior t-shirts that they usually would wear in school that day,” said girls lacrosse coach Tracy Klugerman."}, {"text": "Despite this, the seniors still miss playing on the field."}, {"text": "“Even if you were having a tough day or if it was stressful or bad, there were always your friends on the lacrosse team to count on,” Guest said."}, {"text": "Being teammates, practicing and playing together built a long-lasting friendship between the seniors. “It was a nice, close-knit group of friends that was very team-oriented, very competitive,” Coach Klugerman said."}, {"text": "Their teamwork and spirit helped them through difficult times."}, {"text": "Guest described a challenging game they had in Delran, N.J. The field was in a bad condition with rocks and it had to be spray painted immediately before the game. Even while the players were stressed, they battled through the rough situation together and ended with a victory."}, {"text": "Players connect through Google Classroom, a team group chat and even play together on the turf at South under groups of 10."}, {"text": "Though the seniors are leaving South without playing their last season, they have made a lasting impact on their team and have high hopes for the younger players."}, {"text": "“I feel like we’ve definitely taken the program as a class to another level and I really want them to continue that because I really think they can,” Mattia said."}, {"text": "Photo Courtesy of Amanda Guest"}, {"text": ""}], "file_structural_elements": {"title": "Missing a season will not sacrifice their everlasting bond", "date": "June 19, 2020", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     The lacrosse players crowd together for a team photo, grinning as they proudly hold their lacrosse sticks in front of South’s bleachers. Little did they know that this would be their last photo with the class of 2020.\n     Because the coronavirus pandemic closed schools and shifted learning onl", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/Girls-Lacrosse-900x601.jpg"}}