{"tree_elements": [{"text": "The coronavirus pandemic affected our world and impacted our daily lives in immeasurable ways and athletes are no exception. National sports safety standards have changed in accordance to the Center of Disease Control’s (CDC’s) guidelines. This issue garnered attention on whether or not opening national fall sports would be safe. Many strategies were proposed on how to continue sports while maintaining social distancing measures and the CDC’s safety guidelines. However, many national sports were on hold due to concerns about safety."}, {"text": "*link to='https://thepirateseye.org/1999/sports/conflict-brewing-fall-sports/'**/link*"}, {"text": "*link to='https://www.espn.com/espn/story/_/id/28871525/coronavirus-cancellations-reactions-sports'*ESPN*/link*"}, {"text": "*link to='https://www.sportingnews.com/us/nfl/news/nfl-covid-rules-coronavirus-football-2020/rovse8r08zbu1quh7y3joydah'*sportingnews*/link*"}, {"text": "Mr. Joseph Porter, an American Studies teacher, WW-P United Coach and former NFL player, voiced his views in an email interview: he believes that the NFL could take a few ideas from the NBA on how to keep players safe from the virus. He said, “There is always going to be a discourse between safety and freedoms, so if you really want to protect the players, then you have to be willing to isolate them from everyone not associated with the team. Games have already been postponed because one person on a team contracted the virus from an outside member.  In the climate we are in currently, I genuinely don’t think it is feasible to allow players to conduct life as usual and protect them with the best efficiency. Testing procedures are evolving rapidly but the ‘bubble’ idea from the NBA, I think, would be the most effective way to limit the spread.”"}, {"text": "Tennis"}, {"text": "Tennis allowed players to compete in this pandemic. As a result, the US Open was held in Queens, New York at the empty USTA Billie Jean King National Tennis Center. The US Open is a professional tennis tournament for 128 singles players and 64 doubles teams. The participants compete to win the US Open which is one of the four grand slam tournaments. The other three tournaments include the Australian Open, French Open and Wimbledon, which is held in London, United Kingdom."}, {"text": "During the US Open, however, French tennis player Benoit Paire contracted COVID-19. As a result, he and other French tennis players were removed from the tournament."}, {"text": "When the French Open began, only about 200 fans were allowed to attend the matches. Many professional players expressed disapproval about allowing spectators due to the pandemic."}, {"text": "Sophomore Kavya Karra said, “In the professional circuit I think tennis should have run the way it did, as long as it was safe and they followed CDC guidelines.”"}, {"text": "She also said, “The US open was done safely because they established a bubble among the players and staff there. Nothing harmful came out of it and with no fans they still played it on TV for spectators to watch.”"}, {"text": "The coronavirus pandemic had sports organizations thinking twice about whether or not to let their players play. While fans have been disappointed at the absence of the 2020 sporting events, the most important thing is to stay safe and healthy and to look forward to receiving the vaccine."}, {"text": "Image by Ishita Jadon."}], "file_structural_elements": {"title": "National sports during COVID-19", "date": "January 12, 2021", "writer": {"qwSEbaCBnPbIwsO0WXu3": {"name": "Prisha Priyadarshini", "year": "2022"}}, "description": "     The coronavirus pandemic affected our world and impacted our daily lives in immeasurable ways and athletes are no exception. National sports safety standards have changed in accordance to the Center of Disease Control’s (CDC’s) guidelines. This issue garnered attention on whether or not opening", "image": "https://thepirateseye.org/wp-content/uploads/2021/01/9131BD5C-5467-4113-88E7-2520FAC6B633-900x675.jpeg"}}