{"tree_elements": [{"text": "Vincent Valenzuela (‘90) lost his tennis challenge match 32 years ago at tryouts on South courts. Today, on those same courts, he is coaching the girl’s varsity tennis team."}, {"text": "Coach Valenzuela was hired as the new head girl’s tennis coach in June 2022 and replaced Coach Carla Crawbuck. He works with assistant Coach Daniel Sierzega. His previous coaching experience was at Rutgers Prep where he was the girls’ tennis coach from 2005-08.  Besides coaching, Valenzuela has other roles. He is a study hall proctor, an independent college counselor and a small business owner."}, {"text": "Speaking about his role as a coach, Mr. Valenzuela said he was inspired to take the position this summer since he has coached various ages and sports. “The experience is much better than I expected,” said Coach Valenzuela. He has much to be positive about in his first season."}, {"text": "The girl’s tennis team boasted a 14-3 record this year. For the second year in a row, the team won the Mercer County Tournament in September, held annually at Mercer County Park. The girls faced tough opponents and still surpassed their score from last year of 23.5 points with a score of 24 points, which are collected based on wins and performance."}, {"text": "Coach Valuenzuela’s success in his first year coaching girl’s tennis has not gone unnoticed. “He’s a coach who brings the team together through his energy,” said singles player Eliana Du (‘24)."}, {"text": "“I really like the advice he gives us technically for tennis,” Du said. “He always tells us, when you see a shortfall, you should move into the net. If you’re doubles, don’t be afraid to get closer to the net.”"}, {"text": "The girls have gotten stronger on the court and as a group. Team bonding activities like picnics and going to the U.S. Open together have been memorable moments for the players and the new coach.  The team has also done more psychs this year, which are themed outfits that players wear to school on match days to “psych” themselves up. Coach Valenzuela stays involved in team activities and encourages his players to do these psychs."}, {"text": "“He’s a part of the team, and he’s always there, and he’s really nice,” said singles player Alice Nadtochiy (‘26). “It’s great to have a coach that actually cares.” The new coach guides his team through stressful situations and matches."}, {"text": "“Coaching is another way of teaching,” said Coach Valenzuela."}, {"text": "The girl’s tennis program includes a Varsity team, a Junior Varsity team, and a third team. Coach Valenzuela makes sure that no one feels left out in this competitive environment. “He always loves including people,” said doubles player Emily Yam (‘25). All players are welcome at bonding nights, where the players have fun spending time together outside of school. Previous bonding night activities included preseason dinners and preparing for senior night."}, {"text": "Coach Valenzuela says one possible change he wants to make after the season is the addition of a booster club like other South sports programs have. A booster club is a club usually run by the parents of players in the organization and is meant to help support the efforts and activities of the team."}, {"text": "“My goal is that the girls I coach continue to want to play the game of tennis after high school and beyond,” said Coach Valenzuela."}], "file_structural_elements": {"title": "New girls tennis coach", "date": "November 17, 2022", "writer": {"D3a0mfwQpbfGAc3OHPFr": {"name": "Deana Hu", "year": "2022"}}, "description": "     Vincent Valenzuela (‘90) lost his tennis challenge match 32 years ago at tryouts on South courts. Today, on those same courts, he is coaching the girl’s varsity tennis team.\n     Coach Valenzuela was hired as the new head girl’s tennis coach in June 2022 and replaced Coach Carla Crawbuck. He wo", "image": "https://thepirateseye.org/wp-content/uploads/2022/11/Coach-Valenzuela-talks-to-team-manager-Isabella-Colitsas-23-while-his-team-takes-on-Princeton-high-schools-girls-tennis-team-900x675.jpg"}}