{"tree_elements": [{"text": "Days are getting shorter, leaves are falling and temperatures are dropping. For fall athletes, that marks the end of their season, but for winter athletes, it is just the beginning."}, {"text": "Four new coaches will join the winter athletic programs: Christopher Gero as the boys varsity basketball head coach; Sean Thompson as the wrestling coach; and Zachary Kumor and Coach Julia Giordano as the girl’s basketball head and assistant coach."}, {"text": "Athletic Director Kate Dobinson said, “We have a great wealth of knowledge within our programs in regards to our coaching staff.”"}, {"text": "Anyone who has been in the sports industry knows: the better the coach, the better the player. Wrestling: Coach Sean Thompson (‘17)"}, {"text": "Coach Thompson spent four years at South as a student athlete,where he was an outstanding wrestler. He accumulated over a hundred wins in his wrestling career. He then attended Gettysburg College, where he continued his athletic career and was an outstanding student athlete."}, {"text": "After graduating, he coached at Community for a year. When the opening for wrestling coach opened at South, because of Coach Warren Gerstacker’s retirement, he jumped at the opportunity."}, {"text": "Coach Thompson said about the upcoming season,“I’m definitely looking forward to it and waiting to see what wrestlers we get and hopefully any new faces and any current members that get me on this team.” Basketball: Coach Christopher Gero, Coach Zachary Kumor and Coach Julia Giordano"}, {"text": "Coach Gero has been helping out with the boys’ basketball team for many years. Coach Gero said only the coachable, and hardest working players will be allowed to join the program, on any level."}, {"text": "Coach Kumor and Giordano both spent eight years coaching the girls basketball team at GMS."}, {"text": "Coach Kumor, a former basketball player at the college level, has been coaching for over 5 years. While coaching, he and Coach Giordano got involved on both the varsity and middle school level."}, {"text": "Taking winter sports is not only a good way to become part of the community, but teaches you valuable life skills."}, {"text": "Coach Kumor, a math teacher at Grover, played Division III basketball at Elmira University. He said, “I think that there are a lot of things that are taught on the court that are invaluable life skills, such as time commitment, time management, and understanding how to be able to juggle multiple things.”"}, {"text": "Instead of worrying about whether you will make the team, or if you’re good enough, your mentality should resemble Simone Biles, a 4 time gold medalist who said, “I’d rather regret the risks that didn’t work out than the chances I didn’t take at all.”"}, {"text": ""}, {"text": "PHOTO BY DEANA HU"}], "file_structural_elements": {"title": "New coaches this winter season", "date": "November 17, 2022", "writer": {"h5iYDRm76aX63ZO61oDR": {"name": "Vedant Trivedi", "year": "2022"}, "mh38fiAmuzMDZgv35Wvb": {"name": "Kavya Chauhan", "year": "2022"}}, "description": "Coach Kumor and Coach Giordano, former basketball coaches at Grover middle school, join South’s coaching lineup\n     Days are getting shorter, leaves are falling and temperatures are dropping. For fall athletes, that marks the end of their season, but for winter athletes, it is just the beginning. \n", "image": null}}