{"tree_elements": [{"text": "Sophomore Ronan Keenan was nominated as one of the best ice hockey players in the Colonial Valley Conference."}, {"text": "Keenan’s first experience on the ice was at the age of three when his dad taught him how to skate."}, {"text": "Later, his dad introduced him to ice hockey. Keenan said, “My dad was a big influence because he got me into hockey and helped make it such a big part of my life.”"}, {"text": "Keenan’s parents are an integral part of his success as an ice hockey player. They are both from Canada and his dad played high school hockey. His mom is a fan of the sport."}, {"text": "His brother, P.J. Keenan, was part of South’s high school team. Keenan looked up to him and started taking classes. “I saw how fun high school hockey was for him and how cool it was to see him get [newspaper] interviews,” Keenan said."}, {"text": "Because of his brother’s influence, he joined the North, South ice hockey team. “I’m happy with the success the team has found,” Keenan said. They ended the season with 14 wins, seven ties, and four losses."}, {"text": "The team had an overall record of 7-2 in the conference division, ending with a ranking of fourth in the Colonial Valley Conference."}, {"text": "Keenan participated in the David Baker charity game which helped raise money for military families. During the game, Chris Cordasco, a freshman on the team, scored a goal off of one of his passes."}, {"text": "“It was cool to know that I had helped create a goal,” Keenan said. “I was also able to score a couple of goals which was good as the game meant so much for Baker and his family and they were able to raise money.”"}, {"text": "Where to position yourself on the court is an important strategy, and Coach Glen Binger helped Keenan with this during games. This included where to best maneuver yourself to make a goal."}, {"text": "“Our assistant coach, Matt Strober, has a good personality and he’s able to keep everyone’s morale high,” Keenan said."}, {"text": "Coach James Nobilio has pushed him to the role of captain of the team. A lot of work comes with being a captain and Keenan enjoys having players look up to him as a leader."}, {"text": "“You have to make sure the kids aren’t messing around and you have to prepare the team and get everyone going for games, but honestly, I’ve been looking forward to being one of the captains on the South team since middle school and I love it.”"}, {"text": "Reflecting on his experience as a captain, Keenan said, “It has helped me realize that I have to be there more for the team and play as a leader.”"}, {"text": "PHOTO COURTESY OF RONAN KEENAN"}], "file_structural_elements": {"title": "Passionate ice hockey player Ronan Keenan reflects on success of WW-P team and winter season", "date": "March 28, 2019", "writer": {"H8JGfXSA6j0tGHRfmEUq": {"name": "Saru Daway", "year": "2018"}}, "description": "     Sophomore Ronan Keenan was nominated as one of the best ice hockey players in the Colonial Valley Conference.     \n     Keenan’s first experience on the ice was at the age of three when his dad taught him how to skate.\n   Later, his dad introduced him to ice hockey. Keenan said, “My dad was a b", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/Screenshot-2019-03-28-at-4.39.18-PM.png"}}