{"tree_elements": [{"text": "Junior Sibana Gonzalez has been part of the Girls’ Varsity Volleyball team for three years and is just beginning her journey as one of New Jersey’s top players with dreams of playing Division 1 and going professional."}, {"text": "Gonzalez’s volleyball career began in Puerto Rico, a U.S. territory. She was encouraged by her gym teacher who helped build the confidence she needed to fully commit to the sport she loved. She said, “I was drawn to the sport and I quit ballet for it because it interested me so much, and I loved the sport itself.”"}, {"text": "Her experience didn’t stop short of spectacular as she competed in many tournaments and expos in Chile and her hometown in Puerto Rico. She proceeded to go on to compete in the US Nationals in 2017 at the age of 13."}, {"text": "As the years went on, Gonzalez’s perseverance and dedication to the sport could be credited to her success, as she says in her own words, “I was my own rival.”"}, {"text": "Gonzalez is her own biggest critic as she consistently expects more from herself every game. Both on and off the court, she strives for her own growth and her team’s. “I want to become better than how I was yesterday,” she said."}, {"text": "Gonzalez’s love and passion for the sport only strengthened as she was able to join her new Pirate teammates out on the court freshman year. She is a dream player for coaches as she has a fond passion for teamwork. She said, “As a team we all help each other. We build different relationships and compete together.”"}, {"text": "The Pirate’s Volleyball team is no stranger to teamwork and team chemistry. Their success on the court is no coincidence to their play, as Gonzalez explained, “We have very strong chemistry. We all are around the same skill level and the positive energy is what really affects our team. And that’s what brings us to where we are right now.”"}, {"text": "When it comes to the end of her time in the green and gold, Sibana has high expectations for the continuation of her volleyball career. “I would like to play D1 in college, it has always been my dream,” Gonzalez said."}, {"text": "Gonzalez received the Rookie of the Year Award and Best Spike Award at South. She was also ranked the top freshman volleyball player in New Jersey and Top 4 player in the state by NJ Power Rankings."}, {"text": "Gonzalez’s future success is in the minds of many. At South, she has already carved her legacy in stone."}, {"text": "PHOTO BY SIBANA GONZALEZ"}], "file_structural_elements": {"title": "Pirate’s Pick: Pirate superstar Sibana Gonzalez", "date": "November 11, 2021", "writer": {"eBIZaiuXNJHFsRIhK5lH": {"name": "Elias Deleger", "year": "2021"}}, "description": "Sibana Gonzalez poised to spike the volleyball.\nJunior Sibana Gonzalez has been part of the Girls’ Varsity Volleyball team for three years and is just beginning her journey as one of New Jersey’s top players with dreams of playing Division 1 and going professional.\nGonzalez’s volleyball career began", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/image2-660x900.jpg"}}