{"tree_elements": [{"text": "The runners walk out onto the track. They get into their stances. Only a second or two passes, but feels like years as the breeze tickles their skin. The starting gun fires, and South senior Dean Lourenco flies off the blocks. Seconds later, he crosses the finish line and claims a convincing first place win."}, {"text": "It’s the first race he’s ever run."}, {"text": "“No one expected it, not even myself,” Lourenco said."}, {"text": "Unprecedented successes have been a hallmark of Lourenco’s short but sweet winter track career, which began during last year’s coronavirus-affected season when South only ran in meets against crosstown rival North. Lourenco ran a total of nine races across the 55, 200, and 400 meter distances last year. He won all of them."}, {"text": "“I practically have no experience at all. I never did track in middle school or high school up until Jan. 2021,” he said."}, {"text": "Lourenco’s skill isn’t entirely a shock though. His time playing lacrosse in the spring suggested he might perform at a high level in sprinting."}, {"text": "“I was always a decently speedy guy,” he said. “That was my role for lacrosse for a while, so I thought track would work.”"}, {"text": "Judging by his performance, it has worked well. And although this year will be his first time running in a multi-school meet, it stands to reason Lourenco will continue to compete for the podium against a wider range of competition now that he knows what he’s capable of."}, {"text": "“I’ll admit that I wasn’t pushing myself in practice until I saw my potential after that first meet,” he said. “That surprise in myself, my coaches, and my teammates made me fall in love with track.”"}, {"text": "For Lourenco, more than just the wins brought him back to track this year."}, {"text": "“I also love the team, it’s a good group of people because we push each other to get better but also know how to goof off.”"}, {"text": "Lourenco said his only regret is not joining the team earlier."}, {"text": "“If you have any desire to do something, jump on it,” he said. “I would have had a lot more great memories if I did this sooner.”"}, {"text": "Track has been a fulfilling experience for Lourenco, despite his short time being involved. Yet he remains uncertain about his future with it because lacrosse remains his priority sport."}, {"text": "“I don’t see myself committing to a college based on track,” he said. But his experiences have left an indelible impression on him. “I’m never going to rule out running if I have the opportunity wherever I end up.”"}, {"text": "No matter what happens in the future, though, Lourenco knows his time on the track will be worth it. And for what may be only his second and last season running competitively, he has only one goal in mind."}, {"text": "“I want to put on the best show I can.”"}], "file_structural_elements": {"title": "Pirate Pick: Dean Lourenco sprints to the top", "date": "January 18, 2022", "writer": {"xcHHOYKQ8MJMj6FRgYiE": {"name": "Danny McElroy", "year": "2021"}}, "description": "     The runners walk out onto the track. They get into their stances. Only a second or two passes, but feels like years as the breeze tickles their skin. The starting gun fires, and South senior Dean Lourenco flies off the blocks. Seconds later, he crosses the finish line and claims a convincing fi", "image": "https://thepirateseye.org/wp-content/uploads/2022/01/Dannypiratepickarticleimage.png"}}