{"tree_elements": [{"text": "Ranked 6th in the country for boys 15 and under, Avi Agarwal has competed in some of the most prestigious competitions in the country and continues to climb to the top. He has played for Team USA and has even captained the renowned Princeton Junior Squash Team. The fact that freshman Agarwal has accomplished so much during his four-year career as a junior squash player is not surprising."}, {"text": "“Avi’s greatest trait is focus,” wrote Princeton Junior Squash coach Bill Ramsey in an email interview. “In my career as a coach, I have seen only a handful of players who possess the level of focus that he has for the game of squash.”"}, {"text": "Agarwal did not play any racket sports before squash but now plays badminton and tennis for fun as well. He started as a recreational player – an underdog – with everyone betting against him. You could only imagine their surprise when he won his first tournament, in which he was seeded last."}, {"text": "“Since that day, I was hooked on the game,” said Agarwal. “I had tried a lot of sports before squash, and I was never very good at them, so my parents and I had very low expectations for this tournament. I won my first match, easily and soon progressed.”"}, {"text": "Now he has a full trophy case, and in this season alone has played the Junior Championship Tournaments (JCTs)  around the country in Cincinnati, Philadelphia, and Baltimore.\n     “Avi is a prolific competitor with 60 tournaments in four years on his resume,” wrote coach Ramsey. “Of those 60 tournaments, he placed in the top four in 28 of them, with nine first-place finishes.”"}, {"text": "“During a match, my only focus is to play the best I can play in the moment,” said Agarwal. “I disregard anything I can’t control, and I try to make the best of every circumstance.”"}, {"text": "Like any sport, squash becomes extremely competitive, requiring a lot of precision, and both physical and mental perseverance. Every athlete knows what it feels like to have an off day. Agarwal stated that when things get hard, he always looks back at his love of squash. “It is this love that helps me actually enjoy being under pressure and physical stress”, he said."}, {"text": "Even while being ranked among the top in the country, Agarwal stays humble, thanking his coaches for teaching him everything that he knows, and crediting them for all of his victories."}, {"text": "“When I moved to New Jersey two years ago, I had terrible technique and poor movement around the court, so my shots were inconsistent, and I got tired quickly,” Agarwal said. “The coaches at Princeton improved my grip, my movement, and my swing, all of which were instrumental in my success. They are all extremely positive and knowledgeable, and I have been able to feed off that to find success.”"}, {"text": "This month, Agarwal is set to play the US Open, the biggest tournament of the season, and the biggest tournament that many athletes will play during their entire careers. At this competition, he will be playing against world-class athletes from various countries around the globe."}, {"text": "Rather than heading out to compete with the sole purpose of winning, Agarwal said that he will be “taking this as a great experience” because he will be playing amazing athletes from all over the world. He intends on watching and learning from other athletes."}, {"text": "“I see the US open as an opportunity,” said Agarwal. “My goal is to reach round 16, and everything after that is a bonus to me.”"}], "file_structural_elements": {"title": "Pirate Pick: Avi Agarwal", "date": "January 23, 2019", "writer": {"LpDIeLwdu280NdPILdWj": {"name": "Ashna Garikapati", "year": "2020"}}, "description": "    Ranked 6th in the country for boys 15 and under, Avi Agarwal has competed in some of the most prestigious competitions in the country and continues to climb to the top. He has played for Team USA and has even captained the renowned Princeton Junior Squash Team. The fact that freshman Agarwal has", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/IMG_2165-e1548283398388.jpg"}}