{"tree_elements": [{"text": "In track, the runner must believe that they will win against all odds."}, {"text": "South track star, senior Sameer Das said, “[The] mindset that has led me to victory is to always step to the line knowing that I can win.”"}, {"text": "Das says that he has gotten so far in track because of his motto “to run fearless.” His thinking and belief in himself led him to win the 3200 meter run at the Group 4,  New Jersey State Interscholastic Athletic Association (NJSIAA) Central Jersey meet one year after a stress fracture in his left shin."}, {"text": "Das joined winter track his freshman year and loved it ever since. “I knew after my first distance practice that it was right for me. We went on a 6-mile progressive run and I tried to outrun the older guys in my first practice. It felt like something clicked that day and I never really looked back,” Das explained."}, {"text": "Track, specifically distance running, became Das’s speciality right away, but all seemed to go in a downward spiral after his stress fracture. “It’s been a very unsteady road to recovery, and there were times where I wasn’t sure if running is what I wanted to continue doing,” Das said."}, {"text": "With love and support of his track team, family and teachers, he was able to push past the incident and recover. “You support the heck out of them,” Track and Field Coach, Matthew Coburn said. “That’s how I helped Sameer. I trusted that he wanted to do well for himself in running; trusted he had a plan to reach his goal; and trusted that he was able to do what it would take to get to his goal. All he needed was support to know it was all going to fall into place.”"}, {"text": "Right after Das was injured, he tried finding the best plan to get back onto the track. “Sameer recovered from his injury by being smart. He became very in tune with his body and trusted the signals it was giving him on what he should and should not be doing,” Coach Coburn said."}, {"text": "Das struck everyone speechless, including himself, at the NJSIAA Central Jersey meet. “I just wanted to compete well and focus on advancing to the Meet of Champions, but I definitely was not expecting a win,” Das said."}, {"text": "He also had a lot of encouragement from home.  He said that his mother is his “biggest source of motivation.”"}, {"text": "“She believes in me when no one else does, and her resilient personality and support has been the backbone of any bit of success I’ve had in my life. I owe everything to her, and she’s taught me to believe in myself. That’s what gives me the extra push at the end of a race or tough run,” Das said."}, {"text": "Track has shaped him into the person he is today. “Above everything, track has turned me into a leader. Some of my ugliest and most difficult moments in high school have taken place on our school’s bright red track. I had this idea of hard work before I started running, but the experiences I’ve gone through in this sport have made me tap into a part of myself I never knew I had,” Das said."}, {"text": "As the high school track journey Das has comes to a close, he will continue his running career in a Division 1 Track and Field program at Harvard University next year."}, {"text": "“He’s responsible but more importantly he’s a good person. He’s dedicated, loyal, intelligent. There is no height he cannot reach, both in running and in life,” Coach Coburn said."}, {"text": "Coburn added “He’s a legacy.”"}, {"text": ""}], "file_structural_elements": {"title": "Pirate Pick: Sameer Das’s Race to Success", "date": "June 20, 2019", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "          In track, the runner must believe that they will win against all odds. \n     South track star, senior Sameer Das said, “[The] mindset that has led me to victory is to always step to the line knowing that I can win.”       \n     Das says that he has gotten so far in track because of his mot", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/states-600x900.jpeg"}}