{"tree_elements": [{"text": "The whistle blows and senior Dana Jung dives into the pool, smooth and graceful, the water splashing in her wake. While the water may be cold, Dana’s passion and the hope of first place is the heat that drives her when she races."}, {"text": "Jung started swimming when she was eight. Once she got in the water, it was only a matter of time before she decided that this was the sport for her. “I like the balance between the individual and the team competition,” she said."}, {"text": "Jung swam with the Hamilton Aquatic Club for nine years. She no longer swims for her club team, though she is an active member of the South’s swim team."}, {"text": "Jung first joined her freshman year. After three years of hard work and dedication, she’s leading the girls’ swim team as one of its co-captains."}, {"text": "There are many responsibilities that come with the position, such as organizing parties and leading the Pirate cheer. “It’s stressful when it comes to planning things, but overall it’s very fun,” she said.\nOne important duty of being captain is making sure that the team acts as one cohesive unit. “It’s important we try to avoid cliques and class divisions,” said Jung. “Uniting the team is a big part of our responsibility.”"}, {"text": "“We’ve had a successful season,” Jung said. Out of the 13 total dual meets the girls team have had, they have won 12 of them."}, {"text": "Fellow captain of the boys team, senior Edward Yin, has known Jung since they were freshman. “She has really strong leadership skills and always makes sure that everything is accounted for when making decisions.”"}, {"text": "The swim team’s head coach, Jessica Bidwell, has coached her since her freshman year. “She’s very vocal and does everything with a smile,” she said."}, {"text": "On competition days, the pressure is on. The events each person swims can change depending on the meet, a term used to describe swim competitions."}, {"text": "“Dana is one of those dynamic swimmers that can swim pretty much anything we put her in,” said Bidwell. “She’s never one to complain and definitely understands the component of being a part of the team.”"}, {"text": "Before competing, however, every athlete needs to practice. Training and conditioning is an important part of physical performance, but mental training is also a major component. “Of course you have to be in good physical shape,” Jung said, “but I see swimmers psych themselves out and go into a race with a negative mindset, which is already setting them up for a slower race.”"}, {"text": "To make sure she doesn’t get too burdened by pressure, Jung stops any encroaching negative thoughts before they can take root. “Whenever I’m nervous about the competition, I always try to focus on my own race and my own lane.”"}, {"text": "In addition to this, Jung does various activities to help her handle the stress. “I listen to music because it calms my nerves and gets me pumped up for the races,” she said. “I find that cheering for other swimmers also helps me go into my races with a positive mindset.”"}, {"text": "Outside of the pool, one of her favorite past times is baking and crafting, which are activities that are stress busters for her. She advises other student athletes to think about their mental health and and well being by finding an outlet for built-up stress."}, {"text": "Coach Bidwell also has suggestions for student-athletes who might feel bogged down by anxious thoughts and feelings. “Have open communication with your coach and rely on upperclassmen because they’ve figured out what works for [a competitive mindset].”"}, {"text": "The team also uses various relaxation techniques after a hard practice or before an important meet. “We’ll listen to music and put on meditation tracks when they’re cooling down and sometimes we’ll turn the lights off, tell them to float and focus on their breathing,” said Coach Bidwell."}, {"text": "For Jung, swimming is an outlet where she can build close relationships with those just as passionate about the sport as she is. “High school swimming can get very tiresome, but going through it all with my teammates makes the whole experience so much more enjoyable,” she said."}, {"text": "Swimming is a mental and physical sport. It requires diligence, commitment and can be extremely difficult."}, {"text": "Pressures may build up, and the team may face unexpected turns but Jung continues to maintain a positive attitude in the face of adversity. Jung said, “At the end of the day, you’re only competing against yourself.”"}, {"text": ""}, {"text": "PHOTO COURTESY DANA JUNG"}], "file_structural_elements": {"title": "Pirate Pick: Senior Dana Jung makes a splash in South’s ‘Bubble’", "date": "February 13, 2020", "writer": {"SbITCtXVmWYkqTpn6l43": {"name": "Eugenia Ma", "year": "2019"}}, "description": "The whistle blows and senior Dana Jung dives into the pool, smooth and graceful, the water splashing in her wake. While the water may be cold, Dana’s passion and the hope of first place is the heat that drives her when she races.\nJung started swimming when she was eight. Once she got in the water, i", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/DanaDiving-900x539.jpg"}}