{"tree_elements": [{"text": "Wearing Pirate green and gold basketball uniforms, five players step onto the court. The crowd cheers in anticipation as the timer on the scoreboard hits zero. The starting five gather into a huddle. Standing at the heart of the huddle is Benjamin Jaclin (‘23)."}, {"text": "Ben is a three-year varsity basketball player and has been one of South’s best. Last year, he scored a total of 287 points and played in all 18 games. He led the team in three pointers with 35, while having the second most assists and steals. His highest scoring game was against Allentown last January where he scored 24 of the team’s 77 points in a 77-51 victory."}, {"text": "The key to Ben’s success on the court is versatility. Fellow varsity teammate Kai Hanson (‘23) said, “He can score in many different ways. He’s a willing shooter. He’ll beat you off the dribble and score a layup if you play too aggressively on defense, and he has a variety of offensive moves he can go to.”"}, {"text": "Ben’s basketball career was shortened by the coronavirus pandemic. In his sophomore year the team only played four games, all against North. Ben said that although sweeping North was an amazing experience, he wished he could have had a full season."}, {"text": "“I went from playing on the freshmen team as a freshmen, to immediately starting on varsity the following year during our shortened COVID-19 season. Although that was a great experience and it was nice to play at that high level at such a young age, my first full varsity year wasn’t until junior year,” said Ben."}, {"text": "He showed his talent in the 4 games of his sophomore year by scoring a total of 72 points in 4 games. From then on, he has been nothing short of spectacular."}, {"text": "Hard work, dedication, and determination are the qualities of a star athlete and"}, {"text": "Ben’s coaches and teammates say he has them all. Whether he’s playing in front of a crowd, working in practice, or perfecting his game at home, he gives his best effort and makes it look effortless."}, {"text": "“Last year, he continued to show his offensive abilities, as he was one of our go-to scorers while also growing into a leadership role,” said Hanson."}, {"text": "Now a senior, Ben is a true leader. His demanding presence is felt both on and off the court. Head Varsity Coach Christopher Gero said, “Ben will be relied upon in many different ways for this upcoming season.”"}, {"text": "Ben has decided not to play basketball in college despite receiving interest at the Division III level. He said he will look for a chance to play for fun in a club or an intramural organization."}, {"text": "Looking back at his career, he said, “I love basketball and I’m so happy I’ve pursued it throughout my childhood and into my teenage years.”"}, {"text": "But his time on the courts is not over just yet. South is eagerly waiting to see what he will do in his last season. With every shot Ben takes, he continues to set a new standard of excellence for years to come."}], "file_structural_elements": {"title": "Pirates Pick: Ben Jaclin", "date": "January 6, 2023", "writer": {"D3a0mfwQpbfGAc3OHPFr": {"name": "Deana Hu", "year": "2022"}, "mh38fiAmuzMDZgv35Wvb": {"name": "Kavya Chauhan", "year": "2022"}}, "description": "     Wearing Pirate green and gold basketball uniforms, five players step onto the court. The crowd cheers in anticipation as the timer on the scoreboard hits zero. The starting five gather into a huddle. Standing at the heart of the huddle is Benjamin Jaclin (‘23).\n     Ben is a three-year varsity ", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/36106.jpg"}}