{"tree_elements": [{"text": "Driven, confident, devoted, tenacious, dominant are words people think of when they describe number 10 on the Pirate Girl’s Soccer team, Alexis Contes (‘23). The co-captain of High School South’s girl’s soccer team has had an impressive career playing for South. Competing on the varsity team since freshman year, she has played three stellar seasons as a forward. This season, she scored a notable 8 goals and two assists, including a hattrick against Florence High School on Oct. 4. She helped the team maintain a record of four wins to two losses to date. But aside from her accomplishments on the field, what makes Contes such a good player?"}, {"text": "Well, if there is anything a person can immediately tell about her, it is that she “is a player who puts forth 120%,” said head coach Elisa Mastroianni."}, {"text": "Assistant coach Gabriel Marquez said, “Alexis is driven, puts in her full efforts, and plays the game to the last second. She acknowledges her mistakes and strives to be a better player each day.”"}, {"text": "“Dynamic” on the field, Contes was able to sprint, dribble and kick her way to captaincy – a decision that was fueled by her commitment and perseverance on and off the field."}, {"text": "“Alexis is very knowledgeable [about] the game and her understanding of the flow of the game as it is being played,” said Coach Marquez. “This coupled with her perseverance and hard-working dedication allows her to model the expectations of a Pirate Girls Soccer player.”"}, {"text": "“Alexis is dedicated to the game of soccer and leaves her heart out on the field,” added Coach Mastroianni."}, {"text": "Teammates of Contes also agree with the Coaches. “She has a lot of confidence on the field, and that really transfers to you,” said her teammate, Keziah Thankachan (‘25)."}, {"text": "When it comes to her own feelings about being captain, Contes views the role as nothing out of the ordinary. “My goal is to make sure the team stays organized in their activities and that everyone just feels included and a part of this team,” she said."}, {"text": "Although Contes’ personal achievements are remarkable, her happiness still seems to lie"}, {"text": "in the well-being of her team. “I just think the best part [about soccer] is sharing your experiences with your teammates,” she said."}, {"text": "Her coaches also see this, mentioning how she attended every summer practice this year just to show up for the team,"}, {"text": "even though she was injured."}, {"text": "“Recognizing her own limitations on the field and really playing [to] her strengths to better the team as a whole” in addition to “[making] an effort to ensure everyone belongs” and getting to know the team were part of the reason many of her own teammates wanted her to be captain, said her coaches."}, {"text": "“She knows how to discipline the team and encourage us at the same time,” said Thankachan."}, {"text": "While she inspires her teammates, Contes has certain people who inspire her, including soccer player Alexis Sánchez – fellow number 10 and forward who plays for the Chilean national team."}, {"text": "“He always has a smile on his face when he’s playing,” she said. “He just plays with a lot of passion, and he’s always around his teammates.”"}, {"text": "Just like the trait she admires so much in her idol, Contes also shows a lot of passion on the field. She plays the game because she likes it, and everyone can tell."}, {"text": "“Alexis enjoys playing the game of soccer and appreciates anyone who uplifts the game like her,” said Coach Mastroianni."}, {"text": "As she goes to college, Contes will carry that passion with her. Although she is not actively looking to play in college, if given the opportunity, says she would love to “walk onto a team.” While it takes a lot of work to get to where Contes is today, there are a few things she recommends that can be applied anywhere. Her piece of advice to future Pirate soccer players is to “make sure you’re doing it because you really, really love it… there will be days where you’re like, ‘I don’t want to go to practice,’ but"}, {"text": "you can still show up, and show out.”"}], "file_structural_elements": {"title": "Pirate’s Pick", "date": "November 17, 2022", "writer": {"rX3hx9WOOLdUxxe9lrqF": {"name": "Nirati Iyer", "year": "2022"}}, "description": "     Driven, confident, devoted, tenacious, dominant are words people think of when they describe number 10 on the Pirate Girl’s Soccer team, Alexis Contes (‘23). The co-captain of High School South’s girl’s soccer team has had an impressive career playing for South. Competing on the varsity team si", "image": null}}