{"tree_elements": [{"text": "“His pace and speed put him in the top 25 percent of men high school Épée fencers,” said fencing team coach Kyle Lewis about senior Vinayak Ganesan’s technique. “It’s when he slows down and asks himself questions such as ‘What’s the most effective touch right now?’ that he enters the echelon of the top 10 percent.”"}, {"text": "Ganesan has been fencing Épée since seventh grade in the Princeton Hillsboro YMCA fencing club. Before fencing, Ganesan participated in mixed martial arts and ice skating. Ganesan said that when he started high school, “I wanted another sport that really clicked with me and that sport was fencing.”"}, {"text": "Soon after Ganesan started fencing, he developed a sprain in his meniscus, a knee injury, after a trip to India before his freshman year. “That was definitely the biggest injury, for fencing and for my lifetime,” said Ganesan. The injury made him anxious enough to wonder if he could start fencing for South at the beginning of high school."}, {"text": "Despite the injury, Ganesan was quick to bounce back into action at the start of the season and felt a rush of confidence as he returned onto the fencing strip. “After I overcame [the injury], it was more like I can do whatever I want to do,” said Ganesan."}, {"text": "As freshman year flew by and the high school workload increased, Ganesan had much more on his plate. From academic pressures to extracurricular activities throughout the school year, he had to learn how to manage his time. “For me, it’s not so much about balance; it’s more like juggling.”"}, {"text": "This honest approach to life as a student has helped him remain a dedicated captain of the fencing team. Coach Lewis said, “Vinayak was so helpful and steadfast that at the end of the season [last year] Coach Roman and I decided that due to his role in helping us, his ability and for continuity, he was the best choice [for team captain].”"}, {"text": "As the captain, the whole team looks up to Ganesan. “My responsibility as a team captain is more to control the culture of the team and also develop camaraderie among teammates,” said Ganesan. Aside from that, he says, he also has the responsibility to analyze what went wrong during a game and how the team can improve."}, {"text": "Not only is Ganesan an astute and dependable captain, but he is also a great fencer. During the USA Summer Nationals in 2017, Ganesan placed 23rd in Division 3 and 32nd in Division 2. Fencers are split into divisions based on certain requirements and skill levels to ensure a fair duel."}, {"text": "Coach Lewis explained what makes Ganesan a skilled fencer. “When he takes the time to go through that thought process, you see Vinayak disassembling his opponents.”"}, {"text": "Senior Sibhy Rajesh, captain of the foil squad, further explained, “His biggest strength on the strip is his explosiveness and speed.”"}, {"text": "When Ganesan has trouble on the strip during a fencing bout, he tries to clear his head. “I’m the type of person that really follows momentum, so the minute my momentum breaks, I stutter. And I usually just take a walk to the end of the strip and back to try and clear my head and calm down.” During times like these, Ganesan tells himself, “It’s just one touch, it’s not that big of a deal.”"}, {"text": "Coach Lewis commented on Ganesan’s attitude, “It’s the best way to approach the sport. You’ll lose touches and bouts as you fence but you need to move on and approach the next bout with the same enthusiasm.”"}, {"text": "Ganesan has come a long way in his fencing career. He said he didn’t join fencing to become a top player. “I joined fencing to have fun,” said Ganesan. “And then once I got good, I started to push myself.”"}, {"text": ""}, {"text": "PHOTO COURTESY OF VINYAK GANESAN"}], "file_structural_elements": {"title": "Pirate Pick: Vinayak Ganesan fences to the top", "date": "February 13, 2020", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "“His pace and speed put him in the top 25 percent of men high school Épée fencers,” said fencing team coach Kyle Lewis about senior Vinayak Ganesan’s technique. “It’s when he slows down and asks himself questions such as ‘What’s the most effective touch right now?’ that he enters the echelon of the ", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/VinnyImage-2.jpg"}}