{"tree_elements": [{"text": "Over 43 percent of the world loves soccer and fans were on the edge of their seats during the World Cup held in Qatar."}, {"text": "This year’s game has attracted more attention because of the fact that the two arguably  best players in the world are playing their last World Cup. Who are these two players playing in the twenty second World Cup?"}, {"text": "Alien Lionel Messi, and the Robot Cristiano Ronaldo, both top two all time goal scorers and trophy holders, and both looking for their first world cup win."}, {"text": "According to Sporting News Cristiano Ronaldohas scored over 800 hundred goals in his soccer career. Growing up in poverty, he started playing at the age of 17, with absolutely nothing but a passion for soccer. Ronaldo had a dream:"}, {"text": "To make his father proud. Now boasting a net worth of over 500 million dollars, he has exceeded every expectation put in place for him. Playing for the biggest clubs including, Real Madrid and Manchester United."}, {"text": "Ronaldo’s biggest rival whilst also being his friend, Lionel Messi the only one close to being compared to Ronaldo. Not only does Messi match Ronaldo in skill, but Messi also has 7 Ballon d’Ors, which are awards given to  the best overall player every year."}, {"text": "Even though he had heart issues as a child, professional soccer team F.C. Barcelona took the chance and signed him at the age of 13, paying for all his treatment because of his insane talent.  After twenty years, Barcelona finally released Messi, and now he is currently playing for Paris Saint Germain."}, {"text": "No matter how hard the players try to deny the rivalry, the media makes it next to impossible for Ronaldo and Messi to think otherwise. Over the years, both have won titles like the Golden Boot, but also lost titles to other players such as the Ballon d’Ors. Because of that, the question of whether Ronaldo or Messi is superior  has mostly turned to people’s opinion and what they believe."}, {"text": "*link to='/cdn-cgi/l/email-protection#e19284808fcf87848585848c80a1969691939285cf8e9386'*Sean Feddema*/link*"}, {"text": "“I respect the way Messi has kept himself out of the limelight and just lets the playing do the talking for itself,” he said."}, {"text": "Mr. Feddema is referring to Ronaldo’s current condition of him not being able to find a club to play at because of his sore attitude towards the managers and players of his previous club Manchester United. Messi on the other hand gets along with all his players and coaches, respecting all of them."}, {"text": "On the other hand, Yash Tripati (‘26) said,”Ronaldo is the hardest worker no matter what team he’s on. He is one of the hardest workers off the field too.”"}, {"text": "Wherever you see Ronaldo’s practice on youtube, you always see him pushing himself past his comfort zone, and one step ahead of his teammates, when it comes to training."}, {"text": "Messi, though, works hard but when you see Ronaldo you can feel the difference in effort from them."}, {"text": "Regardless, this debate between Ronaldo and Messi will never end. Ronaldo might not be the fastest, he still dominates the air, and in corners. Messi is only 5 feet 7 inches tall, but still finds a way to get around every player on the opposing team."}, {"text": "Messi and Ronaldo will go down in soccer history  as the fiercest, most determined and most skilled players ever."}], "file_structural_elements": {"title": "Ronaldo vs Messi", "date": "January 6, 2023", "writer": {"mh38fiAmuzMDZgv35Wvb": {"name": "Kavya Chauhan", "year": "2022"}}, "description": "Over 43 percent of the world loves soccer and fans were on the edge of their seats during the World Cup held in Qatar.\nThis year’s game has attracted more attention because of the fact that the two arguably  best players in the world are playing their last World Cup. Who are these two players playin", "image": null}}