{"tree_elements": [{"text": "Along with winter comes the new season for sports, such as cross country, basketball, fencing, swimming, and wrestling. These are just a few of the sports you can sign up for this winter with so much more that might interest you."}, {"text": "Tryouts for all sports begin Nov. 19-21. But tryouts for diving, swimming and ice hockey start Nov. 5. Practices officially start Nov. 26. If you want to know more information about equipment and other things to prepare for your winter sport, you can talk to the athletic director or the coach for your sport. You can also go to the athletic department section on the school website to look at more schedules and calendars."}, {"text": "Speaking to other students who have had experiences, preferably the team captain, or the coach of the sport you want to join, is also a helpful way to get more details. Contacting them can let you get an idea about the structure of the group."}, {"text": "If you are looking for a sport to do this season but don’t have any experience, there are options to try out for a team that has no cuts, such as diving. Diving allows all types of levels to join including beginners."}, {"text": "Another example is cross country, which is a sport that allows students of all levels to join."}, {"text": "Joining a sport you are unfamiliar with can help you figure out if you are hoping to try out again."}, {"text": "Not only are you learning a new sport by trying out but participating in these activities is also a good way to have something to do after school and to make new friends."}, {"text": "Ananya Udyavur, a sophomore, said, “It’s rewarding to be part of a team and have teammates supporting you and that’s why you should try out for sports.”"}], "file_structural_elements": {"title": "Seasons Greetings! Winter sports takeoff", "date": "November 14, 2018", "writer": {"H8JGfXSA6j0tGHRfmEUq": {"name": "Saru Daway", "year": "2018"}}, "description": "     Along with winter comes the new season for sports, such as cross country, basketball, fencing, swimming, and wrestling. These are just a few of the sports you can sign up for this winter with so much more that might interest you.\n     Tryouts for all sports begin Nov. 19-21. But tryouts for div", "image": null}}