{"tree_elements": [{"text": "Senior Isabella McCloskey got into position and stared down at the small golf ball resting on the tee. She leaned forward, took aim, and the sound of a gentle “swoof” echoed through the air as her club contacted the ball, sending it flying across the field."}, {"text": "McCloskey has been playing for South’s Varsity Girls Golf team since her freshman year and found success in several of her competitions, including those in Mercer County, Copper Hill and at the state level."}, {"text": "Her experience with golf did not begin in high school. McCloskey said, “I actually started playing in 4th or 5th grade. My mom offered to take my sisters and I golfing, and I really enjoyed it.”"}, {"text": "Michelle Walsh, one of South’s guidance counselors and the varsity coach of girls golf, recalled watching the then young McCloskey play golf with her family and friends. Ms. Walsh said, “I actually met Isabella when she was nine years old and took golf lessons at Princeton with her two sisters. I watched her grow and grow and next thing I knew, she was already in high school.”"}, {"text": "Even from that age, McCloskey put her heart and soul into golf, playing whenever she could under any condition. Ms. Walsh explained, “When she was at Grover, she and her sisters would go to Cranbury from 3 pm to 5:30 pm. They would play golf everyday in all types of weather: sunny, rainy, cloudy, you name it – they were out there.”"}, {"text": "Dedication and passion aren’t the only reasons McCloskey is looked up to. Not only does she work hard, she also motivates her teammates to do the same. McCloskey is an amazing team player and is supportive of the other girls on the team."}, {"text": "“Another player will come in, play, and get to their personal best. She’ll know it and she’ll congratulate them,” said Ms. Walsh."}, {"text": "This attitude is contagious, building confidence and morale, strengthening the bond among teammates. McCloskey said, “It can get frustrating sometimes when you take a bad shot or get in a bad position. It’s really important to keep your composure to get out of bad situations and recover from bad shots.”"}, {"text": "This is why the sense of community calms down the players and keeps them relaxed under the pressure of competitions."}, {"text": "Golf is a very social sport. “I get to know the girls very well because we spend a lot of time with each other,” McCloskey said. “During practice, we’re talking, sharing tips and helping each other out.”"}, {"text": "In the future, McCloskey plans to continue golf. She said, “In college, I want to join the golf team. It would be a great way to continue strengthening my game and meeting new people.”"}, {"text": "McCloskey encourages other people to try golf. “Golf is a great escape from reality and stress from school, because you are surrounding yourself in nature and playing something that you really enjoy.”"}, {"text": "For people just beginning golf or people who have yet to start playing, McCloskey suggested, “Anyone who’s a beginner should remember that it’s hard at first, but if you keep practicing it’s really fun and rewarding. For people that have never tried it, they should pick it up because it is a sport you can really play your entire life.”"}, {"text": ""}, {"text": "PHOTO COURTESY OF MICHELLE WALSH"}], "file_structural_elements": {"title": "Senior Isabella McCloskey Putts the ‘Go’ in ‘Golf’", "date": "June 19, 2020", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "     Senior Isabella McCloskey got into position and stared down at the small golf ball resting on the tee. She leaned forward, took aim, and the sound of a gentle “swoof” echoed through the air as her club contacted the ball, sending it flying across the field.\n     McCloskey has been playing for S", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/Screenshot-2020-06-19-at-11.31.31-AM.png"}}