{"tree_elements": [{"text": "Senior Tegveer Gill “is one of the best athletes walking around in our school. That’s how gifted he is,” said Coach Beth Fitzpatrick."}, {"text": "As he begins his last season at South, Gill hopes the team will achieve a high seed (tournament ranking) in the Mercer County Tournament and play in the New Jersey State Interscholastic Athletic Association (NJSIAA or States) Tournament."}, {"text": "Junior Andy Bae said, “Since it is his last season, this is going to be his last chance to accomplish something in terms of sports, so I think that’s what is going to push him through this year and help him achieve states, a high seed in the conference and win a lot of games.”"}, {"text": "Fitzpatrick said, “He is the ultimate teammate.” Fitzpatrick, who is the Junior Varsity Coach for the girls basketball team, has watched Gill play since he was a freshman. “He loves to deflect and support from the background but he is also so talented.”"}, {"text": "Bae said, “I play two sports with Gill, soccer and basketball, and there are a lot of things I’ve learned from Teg. The first thing is his mentality, because it is really hard to find an athlete, especially in high school, that has a strong mentality in those tough game deciding situations.”"}, {"text": "Gill was introduced to basketball in fourth grade and he said playing for the high school was always a dream of his. Gill said, “Just being able to do it now is really cool [and to be able to play as captain] is definitely exciting. It’s something I’ve looked forward to since I was a kid.”"}, {"text": "Along with basketball, Gill has been on South’s boys soccer team since he was a sophomore and the varsity soccer team’s state tournament win–the first in ten years– last fall was in part due to him."}, {"text": "”What he did in Monroe, we would have never won that game without him,” said Fitzpatrick.  “He took the team on his back and [said], ‘we are not losing’,” she said."}, {"text": "“He doesn’t like the spotlight so he sent this beautiful ball to Jude [Ferri], who put it in the back of the net. That epitomizes, right there, who he is.”"}, {"text": "Bae explained, “He really sees everything on another level that not everyone can see. In a tough situation, where things can be very chaotic, he remains very calm and he knows what to do. That’s what makes him special.”"}, {"text": "Fitzpatrick believes that winning a State game will “catapult him into basketball.” Fitzpatrick described Gill as a “leader by example.”"}, {"text": "Having made varsity as a freshman, Fitzpatrick said, “[H]e’s always been an underclassman on varsity so everyone respects and looks up to him. But he’s shy about that so he just does his thing and gained everyone’s respect.”"}, {"text": "She added,  “[It] just shows how much talent he has, that he can play at that level at such a young age.”"}, {"text": "In addition to skill, she continued,“Teg has this special gift where he elevates everyone else around him and their game. He makes them better.”"}, {"text": "Bae agreed, “As a captain, he’s not really outspoken but he does his job really well and that makes the underclassmen and the other athletes want to keep up with his intensity.”"}, {"text": "Gill explained that in previous years, “[W]e’ve had really disappointing seasons and our chemistry has been off.” As a captain, he hopes “to change that and become closer as a team.”"}, {"text": "Gill’s ability to uplift others will be crucial for him in getting his teammates “to care about the team and believing in everyone’s self.”"}, {"text": "This season will be Gill’s last as a student athlete. For now, Gill is focused on just trying to do the best he can and looks forward to playing in a state game."}, {"text": "Bae said, “He’s not the ordinary, typical guy. He’s passionate about the sport he plays. When you play right next to him, you see the eagerness that he has and I’m going to miss that a lot.”"}], "file_structural_elements": {"title": "Senior Tegveer Gill: “One of the best athletes”", "date": "December 20, 2019", "writer": {"bXXGgMig9e1Wk6o1Nt2M": {"name": "Gauri Nema", "year": "2019"}}, "description": "     Senior Tegveer Gill “is one of the best athletes walking around in our school. That’s how gifted he is,” said Coach Beth Fitzpatrick. \n     As he begins his last season at South, Gill hopes the team will achieve a high seed (tournament ranking) in the Mercer County Tournament and play in the Ne", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/IMG_2158-900x600.jpg"}}