{"tree_elements": [{"text": "Long pre-season hours, extensive conditioning and hours perfecting serves and volleys have paid off for South’s girls’ tennis team. On Sept. 27, the South girls’ tennis team achieved an undefeated record of 5-0, a record that had not been achieved since before 2011 ."}, {"text": "To top off a start to a great season, the South girls’ tennis team placed third in the Annual Mercer County Championships (MCTs), behind Princeton High School and Hightstown High School. In a tennis tournament, there are five competing positions or flights: first singles, second singles, third singles, first doubles and second doubles."}, {"text": "In the first singles, freshman Kavya Karra won the flight; sophomore Melissa Liu placed second in the second singles flight and first doubles; junior Claire Yin and senior Allison Li placed fourth in the first doubles flight. With an impressive beginning, it is important for the girls’ tennis team to maintain its success and apply their hard work for the remainder of the season."}, {"text": "Before the girls’ tennis team embarked on their journey, the team collectively set a goal to work towards in creating a successful season.\nSenior Rekha Ramanathan, the team’s co-captain, said, “We definitely wanted to do well at MCTs and place at least in the top four. For the past two years, no one on the team won a flight so we were hoping that at least one of us could win this year.”"}, {"text": "The team achieved the goal: three out of five teams broke into the top four places in their respective sections of the MCT."}, {"text": "To add on to the success of the MCT, the girls’ tennis team is on an undefeated streak. However, these stellar results did not come without hard work."}, {"text": "Junior Shreya Ashok, a varsity doubles player (a player who plays with a partner), said, “We would have practice every single day when we weren’t having a match. The volley, serve and return drills we had made sure that we were able to stay consistent during our matches.”"}, {"text": "Not only did hard work and setting goals help the South girls’ tennis team start off strong, but so did the strong leadership from co-captains Allison Li and Rekha Ramanathan."}, {"text": "Ashok said, “The captains definitely pushed us to do the best we could. Stretching is an example. The captains encouraged us to stretch and do a dynamic warmup before every game to prevent cramping and calm our nerves. Even though it takes some work, the results are really rewarding.”"}, {"text": "Not only were the captains crucial to the team’s success, but so were the players on the team. Karra, winner of the Mercer County Championship, contributed greatly to the team as she has not lost a single match."}, {"text": "Ramanathan said, “As a nationally ranked player, she contributes a lot of depth to our team. She plays her hardest and she never gives up when she’s on the court.”"}, {"text": "With all this early success, the girls’ tennis team must continue their hard work and success as the state tournament is approaching."}, {"text": "Ashok said, “Every year, it’s really difficult for South because we are placed in a group with Princeton and Hightstown, our biggest rivals. We have to really continue working hard if we want to continue to replicate our success.”"}, {"text": "This year, the girls’ tennis team is seeded seventh in the state tournament and is set to play Hillsborough High School in the first round and second seed Hunterdon Central Regional High School in the second round."}, {"text": "Ramanathan said, “In the future, I hope we can continue to have these elements of hard work and success to go on and even win states. It’s an ambitious goal but I know"}, {"text": "PHOTO COURTESY OF CATHY XIANG"}], "file_structural_elements": {"title": "Serving up wins: South girl’s tennis team dominates court", "date": "November 1, 2019", "writer": {"": {"name": "Cathy Xiang", "year": ""}}, "description": "Long pre-season hours, extensive conditioning and hours perfecting serves and volleys have paid off for South’s girls’ tennis team. On Sept. 27, the South girls’ tennis team achieved an undefeated record of 5-0, a record that had not been achieved since before 2011 .\nTo top off a start to a great se", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/GirlsTennisTeam-e1572629389437.jpg"}}