{"tree_elements": [{"text": "For the first time in Olympic history, skateboarding will be added to the Tokyo 2021 Games. Due to the Coronavirus pandemic, the summer Olympics was postponed to 2021."}, {"text": "The Olympic Games originated in ancient Greece almost 3,000 years ago and became a world event in the late 19th century. The first modern Olympics took place in 1896 in Athens, Greece. These games included 230 participants from 13 nations who competed in 43 events. Today, there will be approximately 11,091 participants from 206 nations in 339 events, present in the 2021 Olympics."}, {"text": "Out of many competitors in the 2021 Olympics, only 80 people were selected to compete in the skateboarding games."}, {"text": "The skateboarding games will be separated into forty men and forty women. Twenty of each gender will be competing in the park competition and the street competition."}, {"text": "In the park competitions, each round consists of the skater’s best of three 45-second runs, receiving points that will sum up their final score in the tournament."}, {"text": "In the street competitions, 20 skaters will compete in four rounds of five skaters. In the rounds, also known as heats, the skaters must perform two 45-second runs with five tricks."}, {"text": "“Street skateboarding is less professional but more fun in my opinion,” said junior Dylan Blake. “Park skating is cool too but you’re stuck in the confines of the park so there’s only so many places you can go.”"}, {"text": "Though skating is a fun activity for most, there are many speculations about the origins of skateboarding. Most believe the sport began in the 1940s on the west coast by surfers who wanted to bring the feeling of surfing on land. Many people have claimed to have invented the skateboard first, but no one knows for sure."}, {"text": "The peak of popularity of skateboarding was in 1963. The popularity of skateboarding has fluctuated. Now, there are over 11.08 million active skateboarders in the world. This number includes some students at South."}, {"text": "Sophomore Victoria Tiep said, “I really enjoy skateboarding and it has become one of my new hobbies. It helps me destress and motivates me to go outside more. Plus, it’s a fun mode of transportation.”"}, {"text": "Blake agreed and said, “I love skating. it’s fun. My friends and I like riding fast and learning new tricks.”"}, {"text": "Many students at South agree that skateboarding in the Olympics is a great inclusion to sports worldwide."}, {"text": "Teip says, “The Olympics requires athletes who have been training hard for a long time and to do different tricks and go at different speeds on the skateboard requires time, energy, and focus. I think skateboarding will be a great addition to the Olympics.”"}, {"text": "Image by Ishita Jadon."}], "file_structural_elements": {"title": "Skateboarding in the Olympics", "date": "June 19, 2020", "writer": {"t1wNGC5vCu2m5zKSZgLI": {"name": "Sophia Englezos", "year": "2020"}}, "description": "     For the first time in Olympic history, skateboarding will be added to the Tokyo 2021 Games. Due to the Coronavirus pandemic, the summer Olympics was postponed to 2021.\n     The Olympic Games originated in ancient Greece almost 3,000 years ago and became a world event in the late 19th century. T", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/6C66AEED-466C-4D5A-87B6-813393FCBC5F-900x675.jpeg"}}