{"tree_elements": [{"text": "“Who are we?” shouts Coach Coburn."}, {"text": "“Pirates!” roar out the huddled circle made up of members of the Boys’ Varsity Soccer team."}, {"text": "“1..2..3.. South!”"}, {"text": "As the players rush the pitch, throwing their arms in the air, the crowd cheers and the stands tremble. The boys’ soccer team is back."}, {"text": "Because of the pandemic, last year the fall season was cancelled. So the players are grateful and excited to be able to return and play in green and gold again."}, {"text": "“It feels really great because last year we didn’t have a season and all of my other buddies who go to different schools had their seasons,” said Christian Fiuczynski, who plays forward."}, {"text": "With many teams fielding a soccer team last fall in the Colonial Valley Conference, a high school sports league consisting of teams from the Mercer County area, South is in a challenging position. They faced obstacles, such as building chemistry with new teammates, proving other teams of their formidability, and welcoming a new coaching staff."}, {"text": "“Some challenges we’ve faced are underestimating teams,” said midfielder Aidan Grund, a sophomore at South. “We just looked at their records thinking ‘oh they lost to this team, we beat this team,’ and when we played them they caught us by surprise.”"}, {"text": "The team has a new coach: Sean Feddema, an avid soccer fan and history teacher at South. Coach Feddema has been tasked with making hard calls during game time, ensuring their success on the field. Coach Fed, as the players affectionately call him, said, “The biggest challenge to adapt to is, with a large pool of talent, getting out there and putting the right kids on the field at the right time.”"}, {"text": "Fiuczynski added that another challenge has been “playing together as a team.” He said, “Even though there’s a lot of guys who I’ve known from the prior team (two years ago),"}, {"text": "there’s a lot of new guys who’ve shown up, and just as a team in general we’re not the best at these tactics and new ways of playing with each other.”"}, {"text": "Despite these challenges, the boys’ soccer team has seen success in the regular season. They have had big wins including a 1-0 win over Lawrence High School and a 4-0 victory against Florence. They hope to carry over their success into the postseason."}, {"text": "“We’ve been getting better–we’re improving every game,” said Coach Feddema."}, {"text": "South senior and team captain Alan Matthew said, “I have pretty high expectations for us because we’re putting in a lot of effort.”"}, {"text": "Coach Feddema said, “There’s always more you can be doing, whether you’re a coach or player. The second you say ‘my job is done and I’m doing everything I can’ you might as well throw in a towel at that point. We’re always looking for ways to improve.”"}, {"text": "PHOTO BY AIDEN GRUND"}], "file_structural_elements": {"title": "Soccer team back on the field", "date": "November 16, 2021", "writer": {"DBWPYcvzOSF3dyRvXqwQ": {"name": "Dean Hunsberger", "year": "2021"}, "eBIZaiuXNJHFsRIhK5lH": {"name": "Elias Deleger", "year": "2021"}, "QRo3uk5mtYwXdbxUvUF1": {"name": "Edward Kim", "year": "2021"}}, "description": "“Who are we?” shouts Coach Coburn.\n“Pirates!” roar out the huddled circle made up of members of the Boys’ Varsity Soccer team.\n“1..2..3.. South!”\nAs the players rush the pitch, throwing their arms in the air, the crowd cheers and the stands tremble. The boys’ soccer team is back.\nBecause of the pand", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/image2-2-900x600.jpg"}}