{"tree_elements": [{"text": "Exhilarating. Fun. Challenging. These are some of the words the girls on the tennis team used to describe their experience at the Mercer County Tournament (MCT). After six years of consecutive losses at the MCT tournaments, a competition held for high school teams in the Mercer County area, the Girls Varsity Tennis team have put that dryspell to an end: we won. As the team captain, I would say that we reigned champions by not only staying confident during our matches, but also cheering our teammates on."}, {"text": "With a leading number of points among all of the other teams, the team’s score stacked up as the players continued to win their matches. By the end of the tournament, we won first place in the second singles flight and second doubles flight, placed second in the third singles flight and placed third in the first singles flight. Flights are the bracket in which the players compete in depending on their position on the team – singles or doubles – and their rank among their competitors. Overall, the outcome exceeded our expectations."}, {"text": "“I was very excited to showcase my abilities and cheer on the other girls. They have grown into a family for me.”"}, {"text": "Our win is also a result of the hours of practice and drills that began in August, which is when pre-season starts for most fall sports at South. We practiced after school everyday for the past two months for two hours, training with each other unless we had scheduled matches against other school teams. One of our biggest goals for the season was to perform well at the MCTs, whether that was bringing the trophy back home or simply placing top five among the other outstanding teams."}, {"text": "We spent two school days at the Mercer County Tennis Park to play in matches. During the tournament, I often reminded my teammates that our hard work will pay off and that there was no pressure to win. Afterall, we were at the tournament to have fun and show others how much we have improved over the past two years."}, {"text": "“By staying focused and taking the match point by point, alongside hearing the support from my teammates, I could bring the win back for us in my flight,” said freshman Rasika Anandakumar, a second singles player at South."}, {"text": "The second doubles champions, sophomore Anna Zhao and junior Amy Zheng, agreed with Anandakumar."}, {"text": "“I think Amy and I were able to win over North because we tried new strategies and stayed confident throughout the game,” Zhao observed. The second singles and doubles did not drop a set during their tournament, achieving the win in a matter of two sets. Despite the outcome of the tournament,the Girls Varsity Tennis Team had their eyes set on playing the best to their abilities rather than to become champions."}, {"text": "Going into the tournament, junior Prisha Priyadarshini, the first singles player at South, said she was glad to finally get back into tournament play. “It’s been months since I played a tournament due to the pandemic, ” she said. “I was very excited to showcase my abilities and cheer on the other girls. They have grown into a family for me.”"}, {"text": "The family-feel and close bonds are founded on our love and passion for not only the sport, but also the powerful community that we had built. Despite the taxing requirements from a full two-day tennis tournament with at least two full matches each day, my fellow teammates expressed that they were energized each day to support, play, and cheer. Even during times of low energy, we were still high in our spirits."}, {"text": "“It was a memorable experience and as a finalist this year, I hope to come back stronger next year,” said Alyssa Yang, a third singles player. “I had very tough matches, but I continued to advance in the rounds by closing in many shots and staying in the zone.” After playing a grueling four-hour match, Yang was exhausted physically, but high in spirits. The first doubles star player, sophomore Eliana Du was proud of her team’s overall performance and win."}, {"text": "“I am looking forward to future seasons and hopefully we continue to remain at such a competitive level,” Du said . “The team is amazing and we had such a great season so far.”"}, {"text": "This is just the start to the Girls Varsity Tennis team comeback. The meaningful friendships and team spirit led to everyone feeling like all they had to do is play to the best of their abilities, instead of focusing on a win."}, {"text": "This is my final season at South and I can say without hesitation that victory has never tasted sweeter."}, {"text": "PHOTO BY MELISSA LIU"}], "file_structural_elements": {"title": "South Girls tennis: Champions at MCTs", "date": "November 18, 2021", "writer": {"IEgx27jeMWPMtV0BxA2O": {"name": "Melissa Liu", "year": "2021"}}, "description": "Exhilarating. Fun. Challenging. These are some of the words the girls on the tennis team used to describe their experience at the Mercer County Tournament (MCT). After six years of consecutive losses at the MCT tournaments, a competition held for high school teams in the Mercer County area, the Girl", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/IMG_0297-1-1-900x674.jpeg"}}