{"tree_elements": [{"text": "The spotlights shine on the dancers as they clap, stomp and shout to the rhythm of the music. The South Step Team’s performance took place in the playhouse on Feb. 21 during their Black History Month Showcase."}, {"text": "Previously, the team performed at pep rallies. But this showcase allowed the Step Team to perform beside the nationally ranked West Orange Step Team."}, {"text": "Health and Physical Education teacher Amirah Muneer, advisor of the Step Team, said this performance was an opportunity that the team needed. “We got compliments from them [West Orange Step Team] and were invited to their competition next year,” Ms. Muneer said. “That was big for us, for a group that is so well known and has accomplished a lot to invite us to their competition next year and to give us a chance.”"}, {"text": "Ever since the South step team’s debut at the beginning of the year, the team has worked together to get to know and communicate with their teammates, learn stepping fast and efficiently and have fun. All three captains: Senior Nia Kumi, senior Tajae Smith and junior Taniyah Livingston, have grown with the team since its start at the beginning of the 2019-20 school year."}, {"text": "“I realize that communication and the ability to resolve problems is a really big part of being a team. I created a bond with students I didn’t even know before Step,” said Livingston. “We try to make sure that we’re always communicating well, not only to our coach but to the other team members as well.”"}, {"text": "Kumi agreed. “We try to stay on the same page and stay on track, so that we’re all understanding of each other.”"}, {"text": "What makes these performances so inspiring is that all the dancers are moving together, completely in unison. Ms. Muneer said, “A sense of sisterhood really holds this team together. Like sisters, they have their little spats but they always seem to come together when it’s time to perform.”"}, {"text": "With their newfound connection, the team is striving to achieve new goals."}, {"text": "“I would like them to get to a competition level, where we can go and compete against other teams,” said Ms. Muneer. “I want them to be more than just a Step Team here at South, I want them to have their name out there in the county or state.”"}, {"text": "Individually, their ambitions are more personal."}, {"text": "Smith said, “Since I am a senior, I just want the team to take this far and be successful with this.”"}, {"text": "Kumi had similar thoughts. “I just hope that it gets bigger and stronger and thrives. That it’s not one of those things that starts and stops. I hope that we build over the years.”"}, {"text": "The captains and Ms. Muneer spoke about the benefits of joining the Step Team and learning to step. Not only does step improve communication skills, but it is also a good way to form a powerful bond with teammates."}, {"text": "“We’re always going to laugh and joke. We’re very goofy. It’s a good way for everyone to get along with each other,” said Smith. “There are a lot of people on this team who came in here and started making friends and forming deeper connections with the advisor and the other teammates.”"}, {"text": "Kumi added, “You learn how to work with other people and really be a part of something. Everyone is important on the team.”"}, {"text": "While doing step and working with these other steppers, it is important to be open to anything and have fun. Although the steps can get a bit complicated, supportive teammates are always there to help out. Anyone can learn step and everyone benefits."}, {"text": "With a dream for the Step Team, Livingston said, “I hope that in the future, after I graduate and after other step team members graduate, that we leave behind a message for other people to want to join and it becomes a greater project than what it started off as.”"}, {"text": ""}, {"text": "PHOTO COURTESY OF MS. MUNEER"}, {"text": ""}, {"text": "Did you know?"}, {"text": ""}], "file_structural_elements": {"title": "South Step Team steps its way to success", "date": "May 26, 2020", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "     The spotlights shine on the dancers as they clap, stomp and shout to the rhythm of the music. The South Step Team’s performance took place in the playhouse on Feb. 21 during their Black History Month Showcase.\n     Previously, the team performed at pep rallies. But this showcase allowed the Ste", "image": "https://thepirateseye.org/wp-content/uploads/2020/05/unnamed-900x675.jpg"}}