{"tree_elements": [{"text": "For the first time, the Step Team has been approved to become an official club. In previous years, it was an informal student-run activity."}, {"text": "This year, the club has an adviser, Physical Education and Health teacher Amirah Muneer. Students approached Ms. Muneer with the idea of restarting the Step Team."}, {"text": "What is Step?"}, {"text": "Ms. Muneer explained, “Stepping is basically making beats using your body–using your feet, stomping, clapping, hitting different body parts, using your hands, or just creating rhythmic beats using your body.”"}, {"text": "In the team, students have the opportunity to learn step with friends, make new connections and ultimately have fun."}, {"text": "Sophomore Blessing Emiyede, one of the dancers of the Step Team, said, “I hope to gain a lot from my coach, the leaders and every other person in the club.”"}, {"text": "Practices for the team are held from 3-4 p.m. after school. Ms. Muneer spoke about her role as adviser for the club. “I was the captain of my high school step team, so that’s really where [my passion for stepping] started,” said Ms. Muneer. “I really enjoy stepping. I thought I’d be great for advising the team.”"}, {"text": "Since the Step Team members for this season have already been picked, Ms. Muneer plans to hold another tryout next marking period for interested students.    Those who are interested in trying out next marking period can find Ms. Muneer in the female gym locker room office or email her regarding questions or details."}, {"text": "Junior Alize Zaidi participated in the previous unofficial Step Team at South. “What originally got me interested in doing step was watching the original Step Team perform for the Black History assembly,” Zaidi said. “Once it opened up for everyone, my friends joined and so did I.”"}, {"text": "Zaidi added, “What I liked most about it was the energy that everyone had and how it got everyone else hyped.”"}, {"text": "Emiyede had a similar experience when she first joined the Step team. “When I saw how excited my friends were about joining, I decided to give it a go,” Emiyede said. “I was so into it, the flow of making beats by using your feet and hands was hilarious and so intriguing.”"}, {"text": "Not only is stepping a way to let out energy, but it’s also a way to express emotions and feelings through dance. Muneer said, “Because stepping is a rhythmic movement, it gives [students] an outlet to express themselves in a way that’s enjoyable to them, in a way that they’re good at.”"}, {"text": "What Emiyede likes the most is communicating and having fun with her teammates. Emiyede said, “I love the part where we all come together and help each other. One thing we have in mind is not giving up, no matter how hard we [have to] try.”"}, {"text": "The Step Team plans to build up to competition level. “For now, we’ll perform at pep rallies and halftimes at basketball games and home games,” said Ms. Muneer. “I’d love to look at competitions, but we’re starting slow and we’ll kind of see where it goes.”"}, {"text": "Zaidi said, “The restart of the Step Team is exciting and I’m looking forward to seeing more people join and enjoy step. I would recommend it to everyone.”"}, {"text": ""}], "file_structural_elements": {"title": "South steps up the game with its newest addition, The Step Team", "date": "December 20, 2019", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "     For the first time, the Step Team has been approved to become an official club. In previous years, it was an informal student-run activity. \n     This year, the club has an adviser, Physical Education and Health teacher Amirah Muneer. Students approached Ms. Muneer with the idea of restarting t", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/IMG-8168.jpg"}}