{"tree_elements": [{"text": "“Well, it really puts an unforgettable dent in the memories I’ll have from high school,” said senior Seungha Jung, member of the boys varsity baseball team, reflecting on missing the final season of his high school career."}, {"text": "Before the quarantine, the Boys Baseball team had a change in coaches: former coaches, Coach Don  Hutchinson (varsity) and Coach Walter Conner (junior varsity), both retired and two new coaches, Coach Justin Ely (varsity) and Coach Joseph Gambino (varsity and junior varsity) stepped in."}, {"text": "“I wasn’t sure about how the season would go,” admitted Jung."}, {"text": "Jung explained that Coach Ely and Coach Gambino began new initiatives for the baseball team by starting mandatory winter weight room sessions where the team players focused specifically on workouts that would help them during the baseball seasons."}, {"text": "When both coaches announced weight room sessions, Jung and his teammates had confidence with the new coaches and felt optimistic for the new season. Jung said, “I was actually excited to see how this season would turn out and wanted to play games.”"}, {"text": "Unfortunately, due to the quarantine, Jung and the other seniors, Luke Potts, Will Raeter and Ian Muni, missed out on the opportunity to play for their last season."}, {"text": "Jung and Coach Ely were especially hit hard with this news because they felt confident that this season was going to be the best."}, {"text": "“I practiced and trained to make myself be the best player I could be and I felt the best this year, I felt the strongest, the most capable and the most confident I have ever been. Then to be struck with a canceled season really put a personal dent in me,” said Jung."}, {"text": "Coach Ely said, “We had a large senior class with a variety of experiences, mixed with some very talented underclassmen.  This is usually a recipe for success and we were looking forward to seeing what we could accomplish. In addition, we had intentionally given ourselves a tasking schedule to prepare for state playoff time.”"}, {"text": "Losing out on this opportunity to shine was difficult, but nevertheless, the baseball team found ways to continue improving. The seniors found ways to lessen the pain of missing the biggest season of their high school sports career."}, {"text": "“What I have been doing is going out to play catch with my dad. I’ve been doing it for the past two weeks and it brings back memories while also helping me cope with not being able to play the game,” said Jung. Playing baseball with his dad was both a coping mechanism and a way of keeping his skills sharp and staying strong."}, {"text": "Team members and coaches have been looking forward to the next season and have been discussing ways to make it the best season yet. “Although we didn’t have a season to judge ourselves on, our underclassmen showed how dedicated they are to this program,” Coach Ely said. “More importantly, our seniors have left behind a legacy of what they want this program to become.”"}, {"text": "Some seniors are looking ahead to playing in college."}, {"text": "As an afterthought, Jung said, “Hopefully, there is some sort of makeup league that can be formed whenever it’s safe so that players who want to play can enjoy baseball. As for myself, I’ve had thoughts about playing baseball in college as a hobby or club activity but it wouldn’t feel the same as playing with guys you’ve known and seen since middle school.”"}, {"text": "Coach Ely said, “Although this is not what anyone had pictured for the 2020 baseball season, we will be strong and working just as hard for 2021. Go Pirates!”"}, {"text": ""}, {"text": "IMAGE BY PRIYANKA CHAKRABARTI"}], "file_structural_elements": {"title": "South Boys Baseball Team looks forward to brighter seasons and futures ahead", "date": "June 19, 2020", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "     “Well, it really puts an unforgettable dent in the memories I’ll have from high school,” said senior Seungha Jung, member of the boys varsity baseball team, reflecting on missing the final season of his high school career.\n          Before the quarantine, the Boys Baseball team had a change in ", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/ba.png"}}