{"tree_elements": [{"text": "“There are many life lessons that are taught through sports,” said girls softball coach Mark Lee, “and this challenge was a whole new set of lessons for us all.”"}, {"text": "Two weeks into the girls softball season, school and all extracurricular activities were cancelled due to the coronavirus pandemic. As a result, the seniors who had hoped to play a spring sport missed out on their final high school season."}, {"text": "This was particularly disappointing for the girls softball team who was getting ready to start afresh with both a new head coach and new assistant coaches."}, {"text": "Senior Michelle O’ Leary says that she was looking forward to playing under the lead of Coach Lee who had previously assisted the team."}, {"text": "“He does a great job of balancing the competitive nature of softball with having fun, so I really felt it was going to be a good season no matter how we did,” she said."}, {"text": "O’Leary played on the girls softball team for all four years in high school and was one of the two seniors who missed out on the season, along with captain Alyse Dunn. Because there were so many new faces on the team this year, she was hoping to get to know the freshmen better and be able to play games with them."}, {"text": "“They are two of the most considerate and nicest people I have come across in my lifetime,” Coach Lee said of O’Leary and Dunn. “I wish the incoming Class of 2023 only got to interact a little more with them.”"}, {"text": "Besides spending more time with the new players, O’Leary was also excited for the special events planned during her last season."}, {"text": "“Senior year is a chance to celebrate and wrap up your Pirate softball career with events like Senior Night, the North versus South game and the banquet, so it is upsetting to miss out on these experiences,” she said."}, {"text": "An event that she was especially excited for had seniors being recognized at a game with balloons, cupcakes and t-shirts signed by all the team members. Although the team couldn’t partake in the tradition this year, O’Leary says that the seniors didn’t miss out completely on being celebrated."}, {"text": "“The team members drove by our houses this past month, honking and leaving posters, which I really appreciated,” she explained."}, {"text": "As for her hopes for the future, O’Leary says that she isn’t sure whether she will decide to play softball in college. However, she hopes that the team at South will continue on."}, {"text": "“Each year the amount of kids is getting to be less and less and I think it would be a shame if it got to the point where they just did not have a softball team,” she added."}, {"text": "To her fellow softball teammates, she wants to tell them to remember that they still have next year and to keep staying motivated to improve. Most importantly, O’Leary encourages them to lift each other up when things are tough and never forget to have fun."}, {"text": "It is this positive attitude she shared with Dunn that made them so important to the team."}, {"text": "“Alyse and Michelle are always welcome to come back ‘home’ and visit us in the future,” Coach Lee said."}, {"text": "Moving forward, Coach Lee has high hopes for the future, saying that he is excited to be back on the field in 2021 and to have the incoming freshman class join the softball team. Although the time in quarantine is challenging for many, he thinks that it also serves as a great opportunity for everyone to reflect on the things they take for granted."}, {"text": "“When we do return as a team,” Coach Lee said, “I believe we will be more focused than ever and will appreciate the fact we are able to once again do something we all enjoy.”"}], "file_structural_elements": {"title": "Spring Sports: Girls Softball", "date": "June 19, 2020", "writer": {"7QmjWOmuijWLnsmxiDbP": {"name": "Tinney Mak", "year": "2019"}}, "description": "     “There are many life lessons that are taught through sports,” said girls softball coach Mark Lee, “and this challenge was a whole new set of lessons for us all.” \n     Two weeks into the girls softball season, school and all extracurricular activities were cancelled due to the coronavirus pande", "image": null}}