{"tree_elements": [{"text": "The boys’ and girls’ swim teams were back in the water this year to prepare for their long-awaited swim season. Like other winter sports, the swim season was modified last year due to the pandemic."}, {"text": "Last year swim meets were asynchronous. Swimmers competed by sending in times of each swimming event, comparing them with the school they were competing against, and adding up the final score to see which team had the most points to determine the winner. The season also started in late February instead of December, with only seven meets compared to the usual fourteen."}, {"text": "Underclassmen haven’t been able to experience the full winter sports season at South. This year, they finally have the opportunity to compete and once again represent our school with pride."}, {"text": "There is a lot of preparation that goes into getting ready for the season. Practices begin at 5:45 a.m. before the school day. The boys’ and girls’ teams practice and compete together in South’s pool, the Bubble."}, {"text": "“The students have been fine-tuning their skills in the pool while also conditioning their muscles with dry land workouts and their headspace with purposeful, mindful education,” said Samantha Silva, a swim coach and math teacher."}, {"text": "South’s swim teams have consistently ranked amongst the top schools in the Colonial Valley Conference. During the shortened 2020-21 winter sports season, the boys’ team had a 6-2-1 win-loss-tie record, while the girls’ team had a 5-2 record. There are challenges ahead when going against tougher schools. “There are some schools that may be a difficult competition this year, but I expect us to be able to pull through,” said sophomore Rohan Jois."}, {"text": "There’s a lot to look forward to this 2021-22 swim season, so be on the lookout for upcoming meets and events. “The swimmers and I are excited to be cheered on as they showcase their ability in the pool to a live audience! I hope to see a lot of you out there!” Coach Silva said."}, {"text": "PHOTO BY ALAI RUDORFER"}], "file_structural_elements": {"title": "Swimming Into Action", "date": "December 22, 2021", "writer": {"MNQBpPiewE2i25uloP4l": {"name": "Marissa Whitney", "year": "2021"}}, "description": "\n     The boys’ and girls’ swim teams were back in the water this year to prepare for their long-awaited swim season. Like other winter sports, the swim season was modified last year due to the pandemic.\nLast year swim meets were asynchronous. Swimmers competed by sending in times of each swimming e", "image": "https://thepirateseye.org/wp-content/uploads/2021/12/image1-1-1-675x900.jpg"}}