{"tree_elements": [{"text": "“Are you ready kids?” yell the South swimming team captains. The rest of the team responds, “Aye Aye, Captain!” “I can’t hear you!” the captains say. “Aye Aye, Captain,” shouts the rest of the team. The team huddles together, puts their hands in and shouts, “PIRATES!” South’s swimming team is ready to swim. With the winter sports season underway, South’s Boys’ and Girls’ swimming teams are looking to have a great season."}, {"text": "Following the announcement of the modified winter sports season in January, South’s Boys’ and Girls’ swimming teams are making their return to the South Bubble, the school’s pool area. Unlike other sports, the swim team has the opportunity to compete in out-of-district competitions as part of the Colonial Valley Conference, a sports league made up of high schools in the Central Jersey area. This year, however, athletes must follow safety regulations due to COVID-19, in order for competition to be possible."}, {"text": "Regardless, swimmers and coaches are thrilled to have the opportunity to have a season and compete."}, {"text": "“I think it was definitely motivating and a positive part of the year because at first we didn’t think we were going to get a season,” said senior Manit Niwas, co-captain of the Boys’ Swim team. “But the fact that we get to swim with other teams, we get practices, I think it definitely helped a lot of us.”"}, {"text": "Many other members of the swim team have also expressed relief that the season is one step closer to life like it was before the coronavirus pandemic."}, {"text": "“It’s probably one of the more normal things I can maintain in my life right now, so it’s really nice to be able to go in and see people and swim and still be able to stay safe but be able to swim and have fun,” said fellow co-captain Tanya Banerjee, a senior on the Girls’ Swimming Team."}, {"text": "But even before the start of the season, health practices were put in place to ensure that hygiene and health are not risked during practice and competition."}, {"text": "One of the biggest health-based changes this year is the splitting of practices. “We normally have a team of 50+,” said Coach Kathleen Reilly, one of the coaches of the Boys’ and Girls’ swim team. “But because of COVID restrictions, we were limited to 24 swimmers in the water at a time, so we had to divide our practice into two sessions. That’s cutting down the time that student athletes are able to be in the pool and it also limited the amount of students who we were able to keep on our roster.”"}, {"text": "Swim meets also look different this season.  Instead of traveling to another school’s pool to race, this year, teams competing with each other in a meet, will have their laps timed at their own respective pools and compared to determine placements."}, {"text": "“Something that we’re allowed to do this year is we can swim once and then send our times from one swim to multiple schools and that would count as multiple meets,” said Niwas."}, {"text": "These small changes to the season have allowed the team to compete with less pressure compared to a normal season and have allowed them to continue competing even during the pandemic."}, {"text": "Even though the season may look different this year, the team remains true to its values. As Coach Reilly said, “We are always very competitive. But, particular to this year, we are very much stressing personal improvement and personal growth which is one of the benefits of swimming. At the end of the day, it’s you against yourself.”"}, {"text": ""}, {"text": "PHOTO COURTESY OF MANIT NIWAS."}], "file_structural_elements": {"title": "Swimming during the pandemic", "date": "April 15, 2021", "writer": {"BY2v1lYi6QIU4XeyEcp2": {"name": "Abram Chen", "year": "2020"}, "QRo3uk5mtYwXdbxUvUF1": {"name": "Edward Kim", "year": "2021"}}, "description": "     “Are you ready kids?” yell the South swimming team captains. The rest of the team responds, “Aye Aye, Captain!” “I can’t hear you!” the captains say. “Aye Aye, Captain,” shouts the rest of the team. The team huddles together, puts their hands in and shouts, “PIRATES!” South’s swimming team is r", "image": "https://thepirateseye.org/wp-content/uploads/2021/04/IMG_4104-900x675.jpg"}}