{"tree_elements": [{"text": "You may know Joseph Porter as a new history teacher at South, but there is more to him than meets the eye."}, {"text": "“Underneath the suit and tie that you see him wear as a teacher, there’s a passionate football player,” said Senior James Rush, a varsity player for WW-P United, the district’s football team. And now, Mr. Porter is bringing his National Football League (NFL) experience to South."}, {"text": "Mr. Porter started playing football at seven. “It was in my blood,” he said. “I’d always been interested because everyone in my family had played.”"}, {"text": "This passion followed Mr. Porter throughout his school career and earned him the attention of Rutgers University recruiters."}, {"text": "This early success did not come easy. Being a talented player is not enough for college recruiters."}, {"text": "A student must maintain good grades while still performing at the highest level. “There is a certain GPA and an SAT score that’s required, so if you don’t have that it doesn’t matter how good you are,” Mr. Porter explained. There is a range of scores that qualify an athlete to be recruited in Division I at Rutgers."}, {"text": "Through his hard work and talent, both on and off the field, Mr. Porter garnered attention from NFL recruiters while playing for The Scarlet Knights, Rutgers’ football team."}, {"text": "Mr. Porter started out playing for the New Orleans Saints in Louisiana. “I’ll never forget this,” he said, recalling his first day of practice. He explained that during the warmup drills, one of the players had trouble keeping up with the rest of the team and had to be continuously pulled to the sidelines. That day, the player was cut from the team."}, {"text": "“His NFL career lasted 20 minutes!” said Mr. Porter."}, {"text": "After witnessing the competitive nature of professional football, he realized that “this NFL thing is for real. They don’t play around, and they’ll replace you in an instant.”"}, {"text": "Over the course of his four-season (2007–11) NFL career, Mr. Porter was a member of the defensive backfield for the New Orleans Saints, the Green Bay Packers and the Oakland Raiders."}, {"text": "His job as a cornerback was to protect the wide receiver, who receives the ball from the quarterback, and defend against offensive plays by tackling or intercepting passes."}, {"text": "During his time in the NFL, Mr. Porter had the opportunity to play alongside many other talented athletes, including New England Patriots quarterback Tom Brady. “The first time I saw Tom Brady, we were playing [the Patriots], and I just remember thinking, ‘He’s so tall!’ And he was so good!”"}, {"text": "After four successful years in the NFL, Mr. Porter decided to venture out to different career opportunities. “A football career is very unpredictable,” he said. “Once I went for a while without getting called back, I decided it was time to look for something new.”"}, {"text": "He worked as a substitute teacher in North Brunswick and the experience sparked a new passion. “I liked it a lot,” he said. “History has always been my favorite subject, so I decided to pursue a teaching career.”"}, {"text": "Now, Mr. Porter is able to pursue both of his passions. Along with being an American Studies teacher, he is an assistant varsity coach for the combined North-South football team, WW-P United. He focuses on keeping players motivated and ready for any opponent they face. “With the right training, I think [this season] could be really good,” he said."}, {"text": "Not only does Mr. Porter bring experience to the team, but he also brings energy and enthusiasm.\n“[Coach Porter’s] work ethic can be contagious because we all want to do better,” said Junior Moses Harris, a varsity player for WW-P United. “We know we can do better and he’s a reminder of that.”"}, {"text": "Mr. Porter is enthusiastic about the future of WW-P United and values the experiences and lessons he gained from his time in the NFL."}, {"text": "“There’s nothing like doing what you love,” he said. “Having been able to experience [playing in the NFL] was a once-in-a-lifetime thing that not many other people get to have, and I’m really grateful for that.”"}, {"text": "PHOTO BY ANKITA NAIR"}, {"text": ""}], "file_structural_elements": {"title": "Teacher Touchdown: Mr. Porter tackles American Studies and football", "date": "November 1, 2019", "writer": {"ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}}, "description": "You may know Joseph Porter as a new history teacher at South, but there is more to him than meets the eye.\n“Underneath the suit and tie that you see him wear as a teacher, there’s a passionate football player,” said Senior James Rush, a varsity player for WW-P United, the district’s football team. A", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/Mr.-Porter-Online-1-e1572629537862.jpg"}}