{"tree_elements": [{"text": "The South Boys Cross-Country (XC) team ran one of the toughest courses this season — the Holmdel course, a 5k course with hills and daunting rocky roads. They placed ninth in the state."}, {"text": "Before their impressive achievement in states, the boys won the sectional championships for the second year in a row.  In addition to their win at sectionals, the boys placed second in Mercer County Championships and fifth at Group Championships."}, {"text": "According to nj.milesplit.com, a website that records times of competitive distance runners, senior co-captain Austin True finished third with a time of 16:13, senior co-captain Benjamin Fanta finished with a time of 16:15 and senior George Gochuico finished two seconds later, with a time of 16:18."}, {"text": "Jillian Dowling, senior co-captain of the girls’ cross-country team, said in an email interview, “The boys’ team did an amazing job this year and definitely deserve the recognition!” Dowling said of the boys’ team spirit, “[T]hey care for and support one another and is what makes them a fantastic team.”"}, {"text": "Fanta said, “In cross-country, the most important thing is always going to be heart because you don’t get to be a really good runner without that kind of heart.”"}, {"text": "Reflecting  on their ranking this season, Fanta said, “I don’t think it matters too much because, at the end of the day, we’re still a great team. We’re still really hard-working, we’re still just amazing people, we’re always fun to be around and I really enjoy it.”"}, {"text": "Junior Patrick Rancan said, “On the outside, it’s just a sport, but on the inside, you make life-long connections and friends.”"}, {"text": ""}], "file_structural_elements": {"title": "The Boys Cross Country team’s run to victory", "date": "December 20, 2019", "writer": {"qwSEbaCBnPbIwsO0WXu3": {"name": "Prisha Priyadarshini", "year": "2022"}}, "description": "         The South Boys Cross-Country (XC) team ran one of the toughest courses this season — the Holmdel course, a 5k course with hills and daunting rocky roads. They placed ninth in the state. \n     Before their impressive achievement in states, the boys won the sectional championships for the sec", "image": null}}