{"tree_elements": [{"text": "“Engard!” “Pret!” “Allez!” And so it begins three minutes of calculated strategic fencing moves."}, {"text": "South’s fencing coach Kyle Lewis said, “Fencing is like chess where you’re trying to think a few moves ahead and staying one step ahead of your opponent.”"}, {"text": "He believes that anticipating a counter move and thinking a few steps ahead is what really cultivates a good fencer."}, {"text": "Coach Amanda Bader, assistant coach and ESL World History teacher, believes that confidence is essential to become a strong fencer. “To hear how great [the fencers] are doing” boosts their confidence and encourages them to do better in competitions, which in fencing lingo are called bouts."}, {"text": "Fencing has three squads- foil, epee and saber. All three blades have their own rules and regulations, such as where to hit the opponent or the length of the bout."}, {"text": "For example, foil and epee get two minutes each bout. Saber has no time limit, as “it goes very fast” according to sophomore Tinney Mak."}, {"text": "Senior Layow Yu, the women’s fencing captain, said the biggest challenge the fencing team faced this season was the change in coaches.  However, even with the setback, the team has grown closer."}, {"text": "Coach Bader said she is immensely proud that the fencers are second in the state for men’s, third for women’s and eighth as a team. With squad states over and the team ranked 6-1 overall, Coach Kyle prepped the team before states by letting them “rest and be mentally prepared.” He also said,“[T]hey didn’t have a lot of time to be working on specific strategies,” which is why in order to prep for states “there’s nothing I’m changing right now.”"}, {"text": "This year the fencing teams’ major focus has been confidence."}, {"text": "Confidence can make or break a person and lacking it is not good for a sport like fencing."}, {"text": "Fencing is also a tactical-minded sport, involving quick thinking. Coach Kyle said fencers “want to prove themselves.”"}, {"text": "Yu said, “Fencing is such an emotional and mental sport so it’s important to have someone who’s cheering for you.”"}, {"text": "Coach Kyle is that person for the team. His coaching lets their skills shine through."}, {"text": "PHOTO COURTESY OF ANICA  ALONZO"}], "file_structural_elements": {"title": "Three blades, one team: South’s fencing team", "date": "March 28, 2019", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "    “Engard!” “Pret!” “Allez!” And so it begins three minutes of calculated strategic fencing moves.\n   South’s fencing coach Kyle Lewis said, “Fencing is like chess where you’re trying to think a few moves ahead and staying one step ahead of your opponent.” \n     He believes that anticipating a cou", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/Screenshot-2019-03-28-at-4.44.56-PM.png"}}