{"tree_elements": [{"text": "I met the Zhong brothers, Andrew and Brian, at Aljon’s for lunch. The pizzeria, as usual, was busy and buzzing with high school seniors. Andrew and Brain each ordered two cheese slices.  Amazingly, the tall twins, fellow football player Sebastian Smith, and I fit in a regular booth. They were all with me for an interview about the Zhong’s captainship of the new North-South football team."}, {"text": "The Zhong brothers both began playing football career their freshman year, but before padding and tackling, they already were practicing their throws. “In elementary school, we’d play backyard football and we’d play it during recess with our friends,” Andrew said."}, {"text": "Now as seniors, the Zhongs captain the combined football team of North and South. Brian described the position as challenging. “It’s a lot of responsibility,” he said. As captains, they have to keep morale up among team members."}, {"text": "“You have to be an emotional leader on the field,” Andrew said. “When your team is down you have to keep their heads up.”"}, {"text": "One of the ways of doing that is to cut out negativity because it is “toxic to the environment.” The positive attitude has to stay strong on the field even if the team has a rough game."}, {"text": "“We’re always competing and trying to win no matter what the situation,” Andrew said. Brian added, “I remember during the game last week we were losing and we just told each other to have fun on the field and not worry too much.”"}, {"text": "As captains, they have a responsibility of carrying on the coaches messages. One of those is to “focus on the next play and put in the maximum amount of effort.” Overall, it is important that the team “try to improve every time [they] step on the field.”"}, {"text": "This is important for the team considering their record. “Right now we’re 0-4 and there are people that are really upset about the situation but we have to stay positive through it,” Brian said."}, {"text": "This means building a united team after being former rivals with North. At first, this effort seemed challenging. “We were on the turf at South, and the North kids were sitting on one side and the South kids were sitting on the other side,” Andrew said. But as pre-season continued, the team began to mingle and branch out more."}, {"text": "Even though they used to compete against each other, “there’s no bad blood between [them.] It’s really just one big family,” Brian added. With the North-South rivalry gone, the Zhongs have a rivalry of their own."}, {"text": "“We’re always competing with each other,” Andrew said. The board near the weight room at North is evidence of that. “We’re top three in every category,”  Andrew continued."}, {"text": "And it seems they will push each other to work harder in college. “If we do play we’re definitely trying to play together at the same school,” Brian said."}, {"text": "Co-captaining, the Zhongs also held team workouts during the offseason. Andrew said, “It started out as just us two and then eventually more and more people started coming.” Towards the end of the year, they’d see ten players coming to workouts on a Sunday morning."}, {"text": "“It showed that there were kids who looked up to us and wanted to get better,” Andrew said."}, {"text": "The Zhongs will be a part of the United team’s first graduating senior class and what they will miss the most is the time spent with the team. “In the South locker room we had a speaker, so we would just blast music before the game,” Andrew said. He explained how those pre-game rituals allowed him to bond with the team."}, {"text": "Brian agreed, “It’s making those friendships with people you’re with all the time.”"}, {"text": "Fellow teammate and senior Sebastian Smith spoke about the duo’s captainship: “They do what leaders are supposed to do. They are role models. If I was a freshman I’d probably look up to them and I’d wanna be good like them and I’d try to push myself to be better than Andrew at lineback.”"}, {"text": "We all laughed and realized we were one of the few customers still there."}, {"text": "“They are like brothers too,” Smith ended."}], "file_structural_elements": {"title": "Twins tackle final football season as captains", "date": "November 15, 2018", "writer": {"eQ4hzMgQyfADzpgfJuJG": {"name": "Jennifer Clancey", "year": "2018"}}, "description": "    I met the Zhong brothers, Andrew and Brian, at Aljon’s for lunch. The pizzeria, as usual, was busy and buzzing with high school seniors. Andrew and Brain each ordered two cheese slices.  Amazingly, the tall twins, fellow football player Sebastian Smith, and I fit in a regular booth. They were al", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/IMG_4342-900x600.jpg"}}