{"tree_elements": [{"text": "Athletes of the Winter Guard team tossed white and black taped rifles or green and yellow colored flags simultaneously in the air, others spun and danced to the music. They were practicing for their upcoming competitions."}, {"text": "Winter Guard is a sport commonly found in high schools and universities of North America and South is no exception. Many of the athletes from South, along with the athletes of North, practice throwing wooden rifles, flags and dancing on Monday, Wednesday and Saturday in order to participate in competitions."}, {"text": "Practices for this sport take place a few weeks after the end of Color Guard, a sport similar to Winter Guard. Color Guard is mostly performed outdoors during South football games. The Winter Guard team, on the other hand, only competes at regional and interstate competitions. Winter Guard practices at South last for about six months, starting in November and ending in April."}, {"text": "These months are full of rigorous practice. Many people, especially those who are new, tend to get discouraged. “You really get frustrated with yourself when you can’t give tosses [of rifles and flags] out,” said junior Shreya Puranam, who has been on the Winter Guard team for two years."}, {"text": "But as time passes by, the team becomes stronger and so do the individuals themselves. “When you finally catch a solid toss, that sound you get when you catch it is the most satisfying thing in this world,” Puranam added, recalling her experience with Winter Guard."}, {"text": "The Winter Guard team is divided into varsity and junior varsity teams. The varsity team goes to regionals. The junior varsity or novice team participate in local competitions. Juniors and sophomores are on the varsity team, while the JV team consists of all freshmen and middle schoolers. However, there are no seniors who are currently a part of Winter Guard."}, {"text": "Music and choreography go along with it and are needed in order for the Winter Guard team to show their talent. The dance in Winter Guard is choreographed and taught by the directors of Color Guard, Melanie and Bex Braverman. They also arrange competitions for the team and are the representatives of Winter and Color Guard."}, {"text": "Along with the teachers, the athletes on the team share a close bond, as they spend fifteen or more hours together each week. Some students on the team claimed that they spend more time with the Winter Guard team than their family, but they do not regret it."}, {"text": "Isha Patwardhan, a freshman who joined Winter Guard in eighth grade, said, “I didn’t know anybody there [Winter Guard] because most of the people were from high school, but it was really easy to make friends because everybody there was really nice”"}, {"text": "The friendship between team members in the Winter Guard is so close that many consider their team a family. “Looking back, [joining Winter Guard] was one of the best decisions I made in my whole high school career,” Puranam said, smiling."}], "file_structural_elements": {"title": "Winter Guard: More than just a sport", "date": "January 23, 2019", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "     Athletes of the Winter Guard team tossed white and black taped rifles or green and yellow colored flags simultaneously in the air, others spun and danced to the music. They were practicing for their upcoming competitions. \n     Winter Guard is a sport commonly found in high schools and universi", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/IMG-6293-900x600.jpg"}}