{"tree_elements": [{"text": "In perfect synchrony, Winter Guard members throw green and blue flags in the air and catch them flawlessly. Others do the same with wooden rifles or sabres. This is a typical day of practice for these members who are working to improve their technique to prepare for their next competition."}, {"text": "Winter Guard stems from Color Guard, a similar activity that takes place in the fall and performs with the marching band. Historically, Color Guard began with military marching bands and later became a competitive sport at the high school and college levels."}, {"text": "Those who wanted to continue Color Guard during the winter founded WGI in 1977, an umbrella organization that includes Winter Guard. Unlike Color Guard, Winter Guard takes place indoors and is not part of a marching band."}, {"text": "At South, Winter Guard takes place from November to April, with practices on Mondays, Wednesdays and sometimes Saturdays. Winter Guard is a club activity, not an official sport. Teams are divided by skill level, Novice and Regional A, which are like Junior Varsity and Varsity in other sports."}, {"text": "Unlike other activities and sports that begin in elementary school, like soccer and baseball, guard is something that is offered only in high school, though interested middle schoolers can join."}, {"text": "“It’s really hard to get into something like soccer at this age because everyone’s been doing it for so long,” freshman Anusha Jadon said. This is Jadon’s first year in Winter Guard."}, {"text": "Winter Guard is an opportunity for those that are new to athletics or wish to try something new."}, {"text": "Despite the skill differences between new and experienced members, everyone learns from each other."}, {"text": "“The environment is really friendly. Everyone is there to encourage each other and it’s really fun,” Jadon said. This is more than what she expected to find before she joined. “I was scared because I didn’t know anyone.”"}, {"text": "Freshman Xiying Fan said, “[I]t’s a fun and relaxing time with friends.” Teammates learn more than they originally thought they would from each other."}, {"text": "“[Overall] your mindset improves,” Fan said, who participated in Color Guard and is participating in Winter Guard for a second season. “Boosts of confidence” inside and outside of school are part of the perks of being a guard."}, {"text": "Jadon said, “[M]ost people don’t believe there’s much athleticism needed in order to do Winter Guard.” But she found this to be far from the truth."}, {"text": "“It can be very competitive,” Fan said. “It’s also hard because it’s like a team sport.”"}, {"text": ""}, {"text": "PHOTO BY ISHITA JADON"}], "file_structural_elements": {"title": "Winter Guard in synchrony", "date": "December 20, 2019", "writer": {"we7vkttcBDgDzl3L9ds6": {"name": "Apsara Saraswat", "year": "2019"}}, "description": "     In perfect synchrony, Winter Guard members throw green and blue flags in the air and catch them flawlessly. Others do the same with wooden rifles or sabres. This is a typical day of practice for these members who are working to improve their technique to prepare for their next competition.\n    ", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/Winter-900x601.jpg"}}