{"tree_elements": [{"text": ""}, {"text": "“U-N-I-T-E-D. United. Let’s Go!” shouted the South and North Cheer Teams as they cheered on the WW-P football team."}, {"text": "The South Cheer Team is coached by Julia Ferrante, Morgan Palmer, Mary Beth Kitson and Ashley Matrale. At football games, the cheer team is represented by both South and North and is collectively known as “WW-P United.”"}, {"text": "“It’s not like South vs. North or North vs. South,” said Jahnai Minott, a junior on the team. “We come together and play as a team, practice as a team, and put all of our effort to support each other.”"}, {"text": "For many cheerleaders, the values and purpose of the team is what drew them to the sport. “Not only do I get to learn about different aspects of cheer, but I also get to create long-lasting bonds with people,” said Melvina Deb, a Junior Varsity sophomore on the South Cheer Team."}, {"text": "Due to the coronavirus pandemic last year, the cheer team was not able to perform at football games. Instead, they cheered on the school’s basketball team during the winter season. Their practices and drills were held over Zoom."}, {"text": "“Now we can attend football games and see each other during practices instead of being virtual,” said Minott."}, {"text": "One of the major football games that the South Cheer team participated in this year was Homecoming, which took place on Oct. 1. At homecoming, the WW-P United football team plays against a team from another school district, and the cheerleaders performed a halftime show. This year our school played against Burlington Township Scool District."}, {"text": "The halftime performance wowed the audience. “It was so cool seeing people in the air performing all sorts of stunts and dances,” said Aarushi Maskara, a sophomore at South."}, {"text": "“I just really like seeing how hyped everyone got when we did the stunts and performances,” said Minott."}, {"text": "Being on the Cheer Team requires a lot of hard work, commitment, and spirit. Deb said, “I would recommend it to people who are in a good mood, and like to put other people in a good mood.”"}, {"text": ""}, {"text": ""}, {"text": "PHOTOS BY WWP CHEER TEAM INSTAGRAM"}], "file_structural_elements": {"title": "WW-P Cheer Team", "date": "December 6, 2021", "writer": {"aqqY9AKHEOy9aI6zwCiS": {"name": "Kavya Katkuri", "year": "2021"}}, "description": "\n“U-N-I-T-E-D. United. Let’s Go!” shouted the South and North Cheer Teams as they cheered on the WW-P football team.\n      The South Cheer Team is coached by Julia Ferrante, Morgan Palmer, Mary Beth Kitson and Ashley Matrale. At football games, the cheer team is represented by both South and North a", "image": null}}