{"tree_elements": [{"text": "With the momentum of two wins before the Homecoming game, WW-P United, the combined North and South football team, looked forward to their third win in a row. The team had the support of over 1,000 fans as they faced off against the Tigers from Princeton High School."}, {"text": "Star player sophomore A.J. Elhossiani had a foot injury and was out of the game but, supported the team on the sidelines. Senior Joe Potenza started off the game by kicking the ball to the Tigers.\nSenior Tim Glynn broke through the line of players who protect the quarterback and drove his shoulder into the quarterback’s chest. The Tigers had to punt the ball back because they could not move ten yards in four tries or less."}, {"text": "Speedy sophomore Makhi Thompson lined up to receive the punt. Unfortunately, Thompson dropped the ball before it touched the ground, resulting in a fumble. That gave the ball back to the Princeton Tigers."}, {"text": "However, WW-P United’s determination to score led to the defense stopping the Tiger’s potential touchdown a yard short, resulting in another punt."}, {"text": "Quarterback Shane Johnson and the offense came onto the field from the sideline and WW-P United huddled up to discuss which plays would move the ball down the field into the end zone."}, {"text": "The wide receivers were so fast and left the defender in the dust.\nJohnson launched the ball to junior Brandon Drayton, who caught it in the end zone for the first WW-P United touchdown of the game."}, {"text": "The crowd roared in the stands."}, {"text": "The defense returned to stop the Tigers and forced another punt. Thompson used his speed to run the ball down the middle of the field. Once more, Johnson threw the ball on target to Drayton for another WW-P United touchdown."}, {"text": "Even though WW-P United was up by two touchdowns, the defense did not hold back. As the Tigers marched down the field, senior Matt Moore recovered from a fumble. Offense attacked and senior Matt Tiganila assisted Marco Despeignes in scoring a third touchdown.\nThe Tigers defense also didn’t hold back. As the Tigers worked their way down the field they were stopped right in their tracks by a big hit by senior Aarsh Dadan. WW-P United showed no mercy."}, {"text": "Right as Johnson got on the field, he threw a pass to Thompson who ran it into the end zone. Tigers were 20 yards away from the end zone when Drayton intercepted the ball, returning it to WW-P United’s possession. Following the interception, Johnson threw a long pass to junior George Battle, who won a third touchdown."}, {"text": "With a lead of 40-0, the halftime show began with the WW-P United cheerleading team performing an energizing performance, which included breath-taking tosses in the air and fantastic dancing.\nFollowing the cheerleaders, the marching band presented their show, “Balance of Life.” Afterwards, the much anticipated Homecoming court entered the field and seniors Emanuel Storino and Ella Ramirez were crowned Homecoming king and queen."}, {"text": "In the second half of the game, junior Antonio Berrios filled the quarterback position. The Tigers, desperate for a touchdown, were reading the plays South’s Coach, Jeff Reilly, chose like a book.\nEven though there was a comfortable lead, the defense wanted to win the game without letting the Tigers score. As the Tigers approached the five-yard mark from the end zone, José Cruz intercepted the ball intended for a Tiger receiver."}, {"text": "The Tigers were close but couldn’t score."}, {"text": "In the end, the collective effort of WW-P United led to their victory. Sung Lee, Andrew Osborne and Tyler Pandolpho were some of the players who made big tackles and stops."}, {"text": "Crucial plays by the offense include touchdowns by Battle and Drayton. Coach Reilly hopes to repeat this success in the future."}], "file_structural_elements": {"title": "WW-P United defeats Tigers 47-0 at Homecoming", "date": "November 1, 2019", "writer": {"": {"name": "Aakshay Gupta ", "year": ""}}, "description": "With the momentum of two wins before the Homecoming game, WW-P United, the combined North and South football team, looked forward to their third win in a row. The team had the support of over 1,000 fans as they faced off against the Tigers from Princeton High School.\nStar player sophomore A.J. Elhos", "image": null}}