{"tree_elements": [{"text": "For the past 30 years, North and South have had their individual softball programs. This past season however, a new outlook for softball in WW-P brought together players from both of the high schools, which formed what is now known as the WW-P United softball team."}, {"text": "“I’ve known a lot of the girls for a long time, so I loved being able to combine and play all together again,” said junior Ruby Madia."}, {"text": "Similar to the United football and cheer teams, the United softball team was created due to a low number of players from each school. In softball, there are nine positions on the field and so at least nine people are required to form a team . In order to keep the program going for the future, WW-P Athletic Administration combined South and North teams . Although combining the two schools posed challenges at first, coaches and players have gotten along well and have all worked together through the process."}, {"text": "“Actually it has been quite easy meshing the two schools together into one team,” said head coach Mark Lee. “I think the familiarity I have with many of the players, and the players have with each other, helped us greatly.”"}, {"text": "The United softball team made some new changes which included calling the Ruby Shiau Chiang Memorial softball field at West Windsor Community Park their home this past season. As opposed to playing games at either of the high schools, Community Park has become a meeting ground for everyone. In addition, practices were held at South, where the players from North would take a school bus after school, in order for all of the players to work together efficiently."}, {"text": "“Our practices were really fun because we joked around a little, but we also had serious practices at the same time in order to help our team get better,” said North sophomore Sami Pelosi."}, {"text": "The United softball team finished with a 9-11 win-loss record, and made it to the quarterfinals in the Mercer County Tournament. Gaining impressive wins against tough opponents such as Allentown high school and New Egypt high school were huge moments for the team. Although the first season as United wasn’t perfect, it emphasized the importance of teamwork and collaboration which was the main objective of building this United team."}, {"text": "“Everyone really seemed to get along well,” said Lee. “While not knowing what would happen, I believe that the season was a success.”"}, {"text": "PHOTO BY LI-KANG CHEN"}], "file_structural_elements": {"title": "WW-P United Softball debuts", "date": "June 22, 2022", "writer": {"MNQBpPiewE2i25uloP4l": {"name": "Marissa Whitney", "year": "2021"}}, "description": "For the past 30 years, North and South have had their individual softball programs. This past season however, a new outlook for softball in WW-P brought together players from both of the high schools, which formed what is now known as the WW-P United softball team.\n“I’ve known a lot of the girls for", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/image2-900x600.jpg"}}