{"tree_elements": [{"text": "Ultimate frisbee is a unique, action-packed sport that’s played throughout the country at the high school, college, and club levels. From athletic layout catches to full-field throws, it features some of the most remarkable plays in sports. Although it’s still growing, there has been an ultimate frisbee program at WWP for over 10 years."}, {"text": "This year, the WWP boys’ and girls’ ultimate frisbee teams played in the 2022 New Jersey High School Ultimate Spring Season. They competed in a series of tournaments and their records from their games determined their seeding for the state tournament."}, {"text": "“Our season has gone surprisingly well–better than expected,” said senior Dillon Carney, a co-captain of the boys’ team. “We managed to compete with some of the top teams in the state, and it definitely is a big improvement from last year.”"}, {"text": "Last spring, the girls’ team placed third and the boys’ team placed eighth at States. This year both teams made a resurgence."}, {"text": "After having a regular-season record of five wins and five losses, the WWP boys’ ultimate frisbee team came into this year’s state tournament with high hopes as the sixth seed."}, {"text": "“Our team has a positive attitude and we support each other a lot,” said junior Jinhu Chung. “We sometimes get down from tough losses, but we recover quickly and work on things to improve our performance.”"}, {"text": "The WWP girls’ ultimate frisbee team had an incredible season as they finished with an impressive regular-season record of eight wins and three losses. Despite having fewer players than most teams, they placed fifth at YULA Invite and second at Spring Fling, both of which were tournaments that featured top teams from all over the east coast."}, {"text": "These results helped them maintain a spot on Ultiworld’s High School Girls Power Rankings, a list that ranks the top 25 high school frisbee teams in the nation. Thanks to their efforts, they finished second in the State Tournament and received a bid to the High School National Invite for the first time in program history."}, {"text": "“It’s just really amazing because it’s my last year, so being able to finish so strong with such an amazing team made me very happy,” said senior Ireanne Cao, who has played on the girls’ team for four years."}, {"text": "Ultimate frisbee is a sport that requires teamwork as all seven players on the field must work together to score a point. Both teams credit their cooperation to their successful spring seasons."}, {"text": "“I think it’s mainly our chemistry. The fact that we are able to operate without much supervision helps us build a bond,” said junior Tej Murthy, who is also a co-captain of the boys’ team."}, {"text": "Similarly, Cao emphasized how it was through a family-like atmosphere that the girls’ team was able to have so much success this season."}, {"text": "“We just really like each other as people, so we’re able to work together as a team and we just support each other both in-game and out of game,” said Cao."}, {"text": "Looking back at their season freshman David Yoo said, “My favorite memory was probably May Madness because it gave us a lot of experience.” May"}, {"text": "Madness was another tournament that the boys’ team competed in this spring. Despite facing numerous injuries, the team over-performed its seventh seed and placed fourth. They repeated their results from May Madness at States, where they were seeded sixth but made it to the semi-finals and placed third overall."}, {"text": "Senior Elayne Jia, a co-captain of the girls’ team, recalled a tournament that gave her a new experience."}, {"text": "“My favorite memory from this year would have to be State Finals, where we played a very close, competitive, yet spirited game against Columbia High School, placing second and getting the spirit award,” Jia said. “The tournament was also extremely significant and will forever be one of my most cherished memories for that was the first time we had a large and amazing sideline of friends, parents, alumni, and players from the guys’ team cheering us on.”"}, {"text": "Following States, the girls’ team prepared for Nationals, a tournament that featured some of the best teams from the nation. Although they faced m- any challenges, such as having a smaller roster than every other team, they reached bracket play and surpassed their seed to place ninth overall."}, {"text": "“Being able to make State Finals and Nationals for the first time in WW- P history is the best end to my high school frisbee season I could ever ask for,” said Jia. “I am extremely proud of how far our team has come. Everyone worked extremely hard this year to bring our team to where it is today and I look forward to all the amazing things this team will achieve in the future.”"}, {"text": "After a year full of hard work and dedication, WWP Ultimate has left its mark as a top contender for years to come."}], "file_structural_elements": {"title": "WWP Ultimate comes back stronger than ever", "date": "June 22, 2022", "writer": {"QRo3uk5mtYwXdbxUvUF1": {"name": "Edward Kim", "year": "2021"}}, "description": "Ultimate frisbee is a unique, action-packed sport that’s played throughout the country at the high school, college, and club levels. From athletic layout catches to full-field throws, it features some of the most remarkable plays in sports. Although it’s still growing, there has been an ultimate fri", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/image1-1.jpg"}}