{"tree_elements": [{"text": "“When a kid can stand up and say that there needs to be some change,” said senior Nitya Narayanan, President of the Environmental Club, “that holds weight. People believe that kids don’t know any better, but if a thousand kids all believed the same things, does that statement still hold true?”"}, {"text": "In 2019, Narayanan was part of the uprising of youth activism that swept the world. Taking charge to create their own destinies, thousands of teenagers took to the streets to voice their views for change in both local and global issues. Sophomore Arushi Aggarwal was among those teenagers. “As a U[nited Nations] fellow, I have been exposed to the increase in the magnitude of youth empowerment across the world,” said Aggarwal, a member of Environmental Club and founder of Unknown 16, a nonprofit for meeting UN goals such as climate reform and closing the gender wage gap in STEM."}, {"text": "“[S]ocial issues are evident all around us and the more we learn about them, the more we can learn how to take action against them,” said Aggarwal. “Youth activism is becoming more and more prominent.”\nJessica Taft, an associate professor of Latin American and Latino Studies at UC Santa Cruz, said in the article in the UC Santa Cruz NewsCenter, “Around the world, we are seeing children and youth engage as social, political and economic actors, demonstrating their capacity to help make social change.” One of the stars of the youth activism in 2019 is 17-year old Greta Thunberg, TIME’s 2019 Person of the Year. She led the Global Climate Strike, which united young protesters–including South students– around the globe."}, {"text": "Narayanan explained that organizers used the Internet as a way to connect with activists with the common goal of protecting the environment. “[R]egardless of race, class, creed or culture, we all live on the same earth,” said Narayanan. “It’s our job to protect it.” Aggarwal developed this protective spirit after seeing the effect of greenhouse gas emissions on her grandparents’ house in India. She started programming and was later invited to become a UN fellow and attend the world’s first UN Youth Climate Summit for her initiative with Unknown 16."}, {"text": "“We are all an array of different people but with a common passion to use our youth power and work towards a better future for ourselves,” said Aggarwal of the Youth Summit attendees."}, {"text": "While Aggarwal combatted climate change internationally, Narayanan focused on environmental issues at home. Environmental club promoted a petition in support of implementing New Jersey’s ban on plastic bags in West Windsor. “I sincerely think plastic bags are such a pertinent issue, not only because the degrading of plastic is so wasteful, but because we live in a very wooded area,” said Narayanan. “All kinds of animals live here and it’s not fair to destroy their habitat so needlessly when there are better, more sustainable methods of shopping.”"}, {"text": "Shoppers can use biodegradable or reusable bags to avoid plastics which takes up to 1000 years to decompose. Club members also attended a meeting about the plastic ban at the West Windsor Municipal town center to show their support. Narayanan encouraged other South students to meet with the West Windsor Environmental Commission, a group of volunteers selected by the Mayor to consult on environmental policies. “It’s our job as activists to reach out to the leaders of our community and voice our concerns. Otherwise, it’s impossible for any change to occur,” said Narayanan."}, {"text": "In 2019, Pirates also tackled change in other issues such as women’s rights."}, {"text": "After noticing the lack of girls in her STEM workshops, Aggarwal founded Unknown 16 to encourage girls to follow their passion and lead the charge against gender inequality in the field. South students raised awareness for this gender issue among others as part of the Women’s Empowerment Initiative. Members have participated in protests like the Women’s March in New York City. Going into a new decade, Narayanan and Aggarwal both plan on continuing to fight for change in society alongside other youth activists."}, {"text": "Aggarwal described hopelessness as one of the biggest challenges. “Most people feel that their opinion is bound to get lost somewhere or that it doesn’t matter in the long run.”"}, {"text": "“However, in order to take the initiative and spread awareness, it is important to believe that you can make a difference,” Aggarwal added. This belief is a given for the millions of ordinary students and youth that participated in social and environmental change in 2019. “What we say holds weight because we are growing in a vastly different world,” said Narayanan."}, {"text": "“International social issues and environmental issues are only going to get worse if we don’t do something about it,” added Aggarwal. “[W]e are fighting for our future [.]”"}], "file_structural_elements": {"title": "2019 Youth Activism Recap", "date": "February 13, 2020", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "“When a kid can stand up and say that there needs to be some change,” said senior Nitya Narayanan, President of the Environmental Club, “that holds weight. People believe that kids don’t know any better, but if a thousand kids all believed the same things, does that statement still hold true?”\nIn 20", "image": null}}