{"tree_elements": [{"text": "The construction surrounding South has been part of a multi-year updating initiative spanning all WWPRSD schools and was approved by the communities of West Windsor and Plainsboro for approximately $150 million dollars, according to Principal Dennis Lepold."}, {"text": "The main goals for this project are to increase safety for staff and students, as well as accommodate annual surges in student population. Here are some highlights."}, {"text": "The main office will be getting a new section that will include a separate entrance with extra identity checks and intercoms."}, {"text": "“The main office and the building is in the middle of the school,” said Mr. Lepold. “For working with kids, it’s great, but not for security. Almost everybody who visits the school– carriers to delivery people to parents– are going to the main office.”"}, {"text": "Among the most noticeable of all changes at South right now is the extended and renovated science wing. Because South is known for its rigorous science curriculum, increasing numbers of students come to South seeking these science courses. Creating a larger and up-to-date science wing will address the need for more science classrooms with upgraded equipment."}, {"text": "“As a group, each grade is getting larger. Each grade is over 400 and we’re almost at 1700 students with the anticipation that maybe in the next five years we could be over 2000. We need more lab space,” said Mr. Lepold."}, {"text": "The library is also getting a makeover. Lowered bookshelves, full-length windows and new seating throughout the place are just a few examples of the future design of the library."}, {"text": "The playhouse will be redesigned. The seating and carpet will both be replaced with new furnishings, while a new sound system will be installed. Just outside the playhouse, the current spaces for lockers will transform to become extra seating meant to be used after school, as well as supplementary seats during lunchtime."}, {"text": "Additionally, the lights in the school will be replaced with eco-friendly and brighter lighting that will cut overall energy costs."}, {"text": "By the end of the renovation, South will have a robotics area, a dance studio, as well as reconditioned culinary arts equipment. “With the culinary arts room, our idea was to switch from home ec, or cooking for a family, to cooking for a career. It’s going to be more like in the restaurant business and give more of what you would see in a restaurant-style kitchen,” said Mr. Lepold."}, {"text": "As the renovations continue with every passing week, South adapts to the ongoing construction. Students and staff will be entering a new South in the coming school year."}, {"text": ""}], "file_structural_elements": {"title": "A New South", "date": "May 27, 2021", "writer": {"q6Q38H1MOB4iX1yvzBi4": {"name": "Dahria Charadnichenka", "year": "2020"}}, "description": "\n\n\n\n\n\n\n\nGallery|4 Photos\n\n\n\n\n\n\n\n\n\n\n     The construction surrounding South has been part of a multi-year updating initiative spanning all WWPRSD schools and was approved by the communities of West Windsor and Plainsboro for approximately $150 million dollars, according to Principal Dennis Lepold. \n ", "image": "https://thepirateseye.org/wp-content/uploads/2021/05/1750C594-4E66-4E65-82A6-9EE77A6C7D77-1.jpeg"}}