{"tree_elements": [{"text": "Exploring different perspectives is at the heart of Brian Levinson’s new Social Justice class. He teaches World History and this is his first year teaching Social Justice. The class is open to juniors and seniors and introduces students to social justice issues and helps them analyze social movements related to race, gender, sexual orientation and class."}, {"text": "“I think part of what I really like about the Social Justice course is that it’s about teaching others but it’s also about learning from students because they’ve got incredibly dynamic perspectives and unique backgrounds,“ said Mr. Levinson."}, {"text": "On Oct. 7, students presented their projects for an assignment called “Freeways Without Futures.” Students worked in groups and used models and slideshow presentations to explore the history behind a highway that ran through a town that had a history of racial injustice, how the highway perpetuated racial divisions, and their new vision for the road."}, {"text": "“The highway project allows us to consider what went wrong in places like New Jersey 50 years ago, and how we can reverse those injustices,” Mr. Levinson said. As students create this project they also collaborate by regularly discussing and debating topics relevant to current events."}, {"text": "E.J Ferarra said, “There are a lot of us that have been in heated debates trying to figure out all the sides of different social aspects, because it’s not just one unit.” Ferrara added that the class discusses current event topics that are relevant to social justice."}, {"text": "While people typically use Instagram and other social media apps for learning and engaging in local and national debates, this class gives you an opportunity to dig deeper and develop some expertise."}, {"text": "Later, the class will move on to topics related to race and gender."}, {"text": "“I think it would be good to be exposed to different people’s opinions,” said freshman Isla Levy. In addition to giving students an opportunity to share their opinions and recognize how social injustices play out in the world, the Social Justice course broadens perspectives and nurtures student interests."}, {"text": "“I want students to think about becoming civil engineers and urban planners and land use lawyers,” Mr. Levinson said. “I think these are incredibly enriching careers that will also give you a chance to change the world for the better.”"}, {"text": "IMAGE BY HARSHITA RAMESH AND ISLA LEVY"}], "file_structural_elements": {"title": "A new era of social justice", "date": "November 10, 2021", "writer": {"ZSFFpdQWjszDdCIoro8x": {"name": "Sana Manchanda", "year": "2021"}}, "description": "     Exploring different perspectives is at the heart of Brian Levinson’s new Social Justice class. He teaches World History and this is his first year teaching Social Justice. The class is open to juniors and seniors and introduces students to social justice issues and helps them analyze social mov", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Screenshot-2021-11-10-13.05.19.png"}}