{"tree_elements": [{"text": "At first glance, people assume nonfungible tokens (NFTs) are just random paintings sold online. But what you may think is a simple art piece created virtually is actually powered by some of the most cutting-edge computer science technology selling for prices from thousands to millions of dollars."}, {"text": "An NFT is a noninterchangeable unit of data stored in a blockchain. This unit of data includes things like paintings or audio files, which are the most common. The noninterchangeable element of NFTs means each NFT is unique and holds different values. “Nonfungible” means its inability to be replaced, making each NFT unique to the core."}, {"text": "Each NFT is stored in a blockchain like a virtual safe. This blockchain gets passed around via nodes, which are like storage points around a network. A blockchain with all the NFT information gets passed around to multiple nodes. The nodes duplicate the original NFT and its information, keeping a copy for themselves and giving the other one to the next node. This process is repeated with other nodes in the network."}, {"text": "This blockchain node system is a perfect example of a decentralized system, a system where there is no central storage area where all data is stored. There are nodes scattered across a network with a copy of your data. This makes tampering with your NFT data practically impossible since the proof of your NFT is dispersed in the network, a game-changing feature which makes NFTs so popular."}, {"text": "“It’s definitely a key feature which makes NFT’s so popular,” sophomore finance enthusiast Sriniketh Nadella said. “Blockchain technology is a big step up in cyber security.”"}, {"text": "A common misconception people have about NFTs is that by taking a screenshot of an NFT one can claim ownership. This does not prove anything authentically. When an NFT is searched up on a NFT marketplace like OpenSea, a verified badge appears. This shows that the NFT is yours and you have purchased it and this info is secured to the blockchain, making it easy to verify the NFT and its ownership."}, {"text": "In addition to the ultra protective features of NFTs, these digital works of art cannot be bought with cash. Instead you have to use a cryptocurrency."}, {"text": "“I think it’s a good thing since it’s a way to collect info that is very safe,” Nadella said. This blockchain technology eliminates the high risk of fraud and theft in the virtual world."}, {"text": "*link to='https://www.fool.com/the-ascent/research/nft-market/'*Motley Fool article*/link*"}, {"text": "Anyone, regardless of age, can start making NFTs and start selling them. It may seem complex with the whole concept of blockchains and such, but it’s fairly simple to use. All it takes is your art piece, a virtual NFT marketplace, and your cryptocurrency wallet, a wallet where all your Ethereum coins are stored. You can use apps like CoinBase to access this wallet and make transactions on the NFT marketplace."}, {"text": "“Companies like Bored Ape are big NFT producers in the NFT industry. They market and sell their NFT’s to many influencers or celebrities like Lil Baby and Gunna who later influence other people on their social media platform to buy NFTs from the Bored Ape company,” said sophomore and NFT expert Anant Gaan."}, {"text": "NFTs are treated just like any cryptocurrency: a purchaser can buy a NFT from an artist and then resell it for a higher price if they choose. Accounting for all this, not making or purchasing an NFT seems like an opportunity missed. But at the same time this is a fairly new market space, and developing alongside this legitimate investment is technology with the purpose of tampering with NFT data o. This makes fraud and theft technology, which can bypass blockchains, a potential hazard in the future."}, {"text": "NFTs are not like regular stocks. In theory, stocks, like Apple or Tesla, depend on the performance of their company whereas NFTs are simply based on the demand of a consumer which makes them risky investments. “As a very new type of investment, the value of NFTs is very volatile, meaning that any potential profits are mostly due to luck,” said Christopher Grau, an AP Microeconomics teacher, in an email interview. Clearly this new trend has both negative and positive sides to it."}, {"text": "Senior NFT creator Mihir Adurti said, “NFTs have pros and cons.”"}, {"text": ""}, {"text": ""}, {"text": "IMAGE BY JOSH PARMAR"}], "file_structural_elements": {"title": "A Nonfungible trend", "date": "March 29, 2022", "writer": {"CgW1fih1lGQwIcWjrhB6": {"name": "Josh Parmar", "year": "2021"}}, "description": "     At first glance, people assume nonfungible tokens (NFTs) are just random paintings sold online. But what you may think is a simple art piece created virtually is actually powered by some of the most cutting-edge computer science technology selling for prices from thousands to millions of dollar", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/unnamed.jpeg"}}