{"tree_elements": [{"text": "Disney+, a new on-demand streaming service by The Walt Disney Company, is set to release next month on Nov. 12. The multimedia company announced the news in 2017, saying that the service would focus solely on Disney shows and movies, an important part of many South students’ childhoods."}, {"text": "The Walt Disney Company owns a variety of companies in the film industry such as Marvel and Pixar. It also owns the media outlets ESPN and ABC News, as well as technology companies like GoPro. Disney+ is the latest addition to the group of companies."}, {"text": "Although Disney+ has films and shows that are rated PG and G, meaning almost anyone can watch them, they also cater to an older audience with movies rated PG-13, such as “Captain Marvel” or “Pirates of the Carribean.” Disney+ plans on featuring a large catalogue of Disney productions that are difficult to find elsewhere."}, {"text": "The estimated amount of content is “7,000 episodes of television series and 400 to 500 movies,” according to CinemaBlend, a pop culture website that reports on movies and entertainment. Not all of Disney’s productions will be available at first, but the company plans on gradually building up its library."}, {"text": "Some people are worried that Disney’s expansion may prove strong competition other popular streaming services, and cause them to lose business. When Disney+ launches, Netflix will have to remove Disney content, such as “Infinity War,” from its service. Senior Mourya Vulupula is optimistic, but has his doubts. “If [Disney+] turns out to be really successful, it might end up being a detriment to [Netflix],” Vulupula said."}, {"text": "“I use Netflix a lot, and it’ll be really inconvenient if they start taking away Disney shows,” said Junior Deepti Athreya. When Disney+ launches, Netflix users who want to be able to watch both Netflix and Disney creations will no longer be able to on a single platform."}, {"text": "Junior Gabby Bailey thought about Disney’s actions differently. “The competitive nature might drive prices down,” meaning that Netflix may try to make their service more affordable, and as a result, more desirable. But it can go either way, Bailey said. “Maybe they’ll raise prices and compete for attention with advertisements instead.”"}, {"text": "Estimated costs for Disney+ are $7.99 per month, but another package deal offer includes Hulu and ESPN for $12.99. In comparison to Netflix, the current cheapest streaming service at $8.99 monthly, projected Disney+ costs are cheaper, and the service encompasses an almost equal range of content."}, {"text": "Disney + plans on continuing the popular Marvel and Star Wars franchises and has plans to feature new Star Wars and Marvel spin-off stories."}, {"text": "Senior Ari Tripathi said, “They’re narrowing down their audience by putting [those shows] on such an exclusive stream.”"}, {"text": "Bailey said, “As a fully grown teenager I’m not that interested in Disney shows anymore.” Other students are more optimistic. “I don’t think it will be too bad. I’m excited for the new Disney movies,” said Senior Charanya Ramasemy. “Good for them,” said Senior Seungha Jung, “it’s a plus for Disney.”"}], "file_structural_elements": {"title": "A plus for Disney?", "date": "November 1, 2019", "writer": {"SbITCtXVmWYkqTpn6l43": {"name": "Eugenia Ma", "year": "2019"}}, "description": "Disney+, a new on-demand streaming service by The Walt Disney Company, is set to release next month on Nov. 12. The multimedia company announced the news in 2017, saying that the service would focus solely on Disney shows and movies, an important part of many South students’ childhoods.\nThe Walt Dis", "image": null}}