{"tree_elements": [{"text": "This summer, the African American Parent Support Group (AAPSG) is offering a virtual summer math program for African American students.  The program begins July 7."}, {"text": "AAPSG arranges programs, events and meetings to support African American students through their high school career."}, {"text": "Latoya Edwards, President of AAPSG, said, “The main purpose of the AAPSG is to advocate on behalf of and support the African American students and students of the African diaspora in the WWPRSD.”  They collaborate with the school district to host mentoring programs, workshops, study skill sessions and test taking technique sessions to promote students’ academic achievements. Additionally they host an annual event called “Student Achievement Excellence Awards.”."}, {"text": "They organized events for this year’s Black History Month, such as the History of the Divine 9, Our Family Stores and the Spoken Word. They also hosted a presentation on May 17 by Mathematics Supervisor Andrea Bean about the math program ."}, {"text": "AAPSG helps other organizations who wish to assist African American students. “The AAPSG has been very supportive of BSU, providing many college-related resources for the students and hosting panel discussions,” said Valerie Kearns, advisor of the BSU club and social studies teacher. They have opportunities for students to volunteer in the WWP community. Some of the places where students can volunteer are the Ronald McDonald House, Homefront Homeless Shelter of Central NJ, Anchor House Youth Shelter and the Trenton Area Soup Kitchen. Edwards said that students benefit from volunteering: “By serving, they show that they can be great leaders who are also kind and caring.”"}, {"text": "Not only does AAPSG provide students with academic resources, but they also contribute to their social and emotional needs. “I really appreciate the work they do,” said Imani Laird, a freshman at South and a member of BSU. “It makes a lot of the Black students in WWP feel empowered.”"}, {"text": "AAPSG allows parents to become more involved in the school community. “It helps them learn about the tools they should give their children so they can succeed,” said Imani Laird. AAPSG helps parents understand their children’s learning style and so they can support their progress in school."}, {"text": "Edwards said, “We may be a small population in the district but we are mighty! We welcome the opportunity to work on behalf of our students in WW-P.”"}, {"text": "*link to='/cdn-cgi/l/email-protection'*[email protected]*/link*"}], "file_structural_elements": {"title": "African American Parent Support Group Mounts New Heights", "date": "June 19, 2021", "writer": {"quV4nroGEIE56FoRMO5F": {"name": "SreeCharani Avula", "year": "2020"}}, "description": "     This summer, the African American Parent Support Group (AAPSG) is offering a virtual summer math program for African American students.  The program begins July 7.\n     AAPSG arranges programs, events and meetings to support African American students through their high school career.\n     Latoy", "image": null}}