{"tree_elements": [{"text": "“I realized that there was a lot I had to learn about the Black experience in America,” said Kate Heavers, Biology and Human Anatomy and Physiology teacher. Dr. Heavers was a participant in this year’s African American Read-In, which celebrates African American literature, one of the many events in the district celebrating Black History Month."}, {"text": "Black History month began in 1926 when Carter G. Woodson, a Ph.D. from Harvard University who was an influential writer and educator, established Negro History Week in the second week of February.  According to N’dae Yancey Bragg of USA Today online, the date coincided with the birthdays of President Abraham Lincoln, who signed the Emancipation Proclamation in 1863, ending slavery, and abolitionist and former slave Frederick Douglass."}, {"text": "History.com explains that later in the 1960s, many colleges expanded the week to a month. In 1976, President Gerald Ford officially recognized Black History Month. This was a vital acknowledgement because school curricula often ignored or tokenized African American achievements and experiences.  Black History Month was a way to remedy the neglect."}, {"text": "This year, Kathryn Carroll, who is the new media specialist for North and South, organized a program called African American Read-In. Read-Ins are happening across the country this February to celebrate Black History Month."}, {"text": "“It brings to light all these amazing contributions that African American literature has made to American society,” Ms. Carroll said."}, {"text": "North celebrated the district’s first Black History month Read-In last year with the freshman class. This year, the event will be taking place at both high schools and includes all grades."}, {"text": "As part of the program, Ms. Carroll has been collecting recordings from students, teachers and community members reading a poem or an excerpt from a book by an African American author."}, {"text": "When asked why diversity in literature is important, Ms. Carroll said, “I think it’s super important especially for developing minds in young children and young adults to be able to identify with the protagonist of the story. I believe in mirrors and windows.”"}, {"text": "Literature acts as a mirror when the reader sees her experience reflected in what she’s reading; literature acts as a window when the reader experiences a world different from her own."}, {"text": "Diverse literature, then, can help give new perspectives to a young person who always sees themselves represented in books. Diverse literature can also uplift those who can never see themselves in literature."}, {"text": "Dr. Heavers said, “What we read as children, if we are lucky enough to have access to books, helps shape our world. We learn from our environment, from each other and from the stories we read and are told.”"}, {"text": "Dr. Heavers  knows the power literature can have on young minds and said she’s introducing her four-year-old son to stories about and by people of color, like “Antiracist Baby” by Ibram X. Kendi."}, {"text": "Jennifer Kelley, who teaches Spanish 3 and 4, said, “Having diverse perspectives is essential to learning more about humanity which leads to understanding ourselves as well as how we are all alike yet uniquely different.”"}, {"text": "Ms. Carroll hopes to do similar events in the future. “I’d really love to expand this and do something like this for Asian and Pacific Islander Month,” she said. “I would love to do something like this for Hispanic Heritage Month, and  celebrate America’s diversity  throughout the year with different events.”"}, {"text": "Being a librarian, Ms. Carroll of course has book recommendations to celebrate this month. At the top of her list is “Dread Nation” by Justina Ireland, an alternative historical fiction novel featuring zombies; others include “The Hate U Give” by Angie Thomas; “The Sun is Also a Star” by Nicola Yoon; “Brown Girl Dreaming” by Jacqueline Woodson; and  “All the Way Down” by Jason Reynolds."}, {"text": "Often we can be unaware of the privileges we carry, but, Dr. Heavers said, “It’s never too late to expand your mind.”"}, {"text": ""}, {"text": "Image courtesy of Kathryn Carroll."}], "file_structural_elements": {"title": "African American Read-In: Celebrating our nation’s literature", "date": "February 5, 2021", "writer": {"71hhF0oQr1LLxWE03E35": {"name": "Sidd Shetty", "year": "2021"}}, "description": "    “I realized that there was a lot I had to learn about the Black experience in America,” said Kate Heavers, Biology and Human Anatomy and Physiology teacher. Dr. Heavers was a participant in this year’s African American Read-In, which celebrates African American literature, one of the many events", "image": "https://thepirateseye.org/wp-content/uploads/2021/02/African-American-Read-In-900x506.jpg"}}