{"tree_elements": [{"text": "Teachers have worked hard throughout the school year to make South the best it can be. Many have taught at South for several years. Recently, their efforts were recognized through the Teacher Appreciation Week shows that aired on South’s radio station WWPH 107.9 FM."}, {"text": "Teacher Appreciation Week is held nationally during the first week of May, but the South’s radio special program ran from May 11 to 31, starting with Principal Jessica Cincotta and ending with gym teacher Beth Fitzpatrick. Each teacher was allowed to plan their show in any way they wanted."}, {"text": "“Mr. Young came on [May 23] and he did an entire Marvel theme. He went through each movie in each phase and ranked it on a tier list with Connor Rossi,” said senior Christian Gobo, who co-hosted each show with senior Anna Rubenstein."}, {"text": "Teachers could also choose what sort of music they played. Language Arts teachers Brian Paulson and Kerry Kemo went on the show together and brought their taste in music with them."}, {"text": "“I was just playing a lot of punk rock. Like, old punk rock bands from New Jersey,” said Mr. Paulson. “That was what I was saying the whole time, that my DJ name was just Brian ‘Punk Rock.’”"}, {"text": "Ms. Kemo also brought on music from her past. “I was a teenager in the 80’s and I talked about the first concert I went to. It was a U2 concert in 1985. I talked about that and some other 80’s music that was popular and some a little more obscure.”"}, {"text": "Because of the freedom granted to the teachers, the show could be as formatted or as wild as the teacher wanted. “Some people came with cards and lists of things they wanted to talk about. We just talked. We had fun,” said Art teacher Nathan Leventhal. “I also invited Mr. Joshua Siegul (a Math teacher) to be a surprise cameo guest and he ended up staying the whole time.”"}, {"text": "Many teachers also talked about parts of their lives that students never would have known otherwise. Athletic Director Ms. Kate Dobinson talked about her CD collection and Ms. Cincotta discussed how she taught music in South America for 4 years. Ms. Kemo went into her love for baking and Mr. Paulson discussed his running routine."}, {"text": "As Christian put it, “There’s something about putting someone in a position like that on a radio show that just humanizes them.”"}, {"text": "The recordings for each show can be found at linktr.ee/wwph1079fm under the Apple Podcasts tab, along with everything else South’s radio station has done in the past. Listeners can also tune to 107.9 FM for live broadcasts."}], "file_structural_elements": {"title": "Appreciation on Air", "date": "June 24, 2022", "writer": null, "description": "     Teachers have worked hard throughout the school year to make South the best it can be. Many have taught at South for several years. Recently, their efforts were recognized through the Teacher Appreciation Week shows that aired on South’s radio station WWPH 107.9 FM.\n     Teacher Appreciation We", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/Screen-Shot-2022-06-24-at-6.03.12-PM-900x506.png"}}