{"tree_elements": [{"text": "After a summer of adventure, when Pirates made the voyage home, they found a new Pirate onboard: Assistant Principal Valerie Rodriguez."}, {"text": "The former calculus teacher for 14 years at Princeton High School, from which she graduated, said, “I was feeling kind of stale in the classroom. I didn’t step into the classroom saying I can’t wait to deliver this calculus lesson. Instead, it was ‘I can’t wait to see my students. I can’t wait to build relationships with them.’ I can’t wait to create a community.”"}, {"text": "She applied to be an assistant principal at South, because, she said, “I wanted that next level.”"}, {"text": "At South, “I feel like I’m able to do that on a wider scale as an admin.” Although it is different from being a teacher, she finds her new rhythm riveting. “I feel constantly engaged, constantly busy doing great things, but not necessarily feeling as if I’ve accomplished what I set out to do for the day,” she said. “And that’s okay. It’s not like a feeling of disappointment, but that’s the biggest change: the unpredictableness of the job.”"}, {"text": "Ms. Rodriguez has been involved in an administrative capacity for some time. “I found myself in some admin roles at Princeton, helping out with the peer group coordinator,” she said. “I ran a Saturday program for credit completion.”"}, {"text": "Ms. Rodriguez’s eager participation is seen not only in her professional career but also in her schooling years at Princeton High School, a fifteen-minute drive from South. As a student there, she played various sports including basketball and soccer. “I was always involved in something,” she said."}, {"text": "During this time, Ms. Rodriguez also decided to become a teacher for younger students. “I had the plan of being an elementary school teacher,” said Ms. Rodriguez. However, a suggestion by someone to earn a Secondary Certification for grades 6-12 changed her life’s trajectory."}, {"text": "“Those couple of changes and tweaks along the way completely changed my path from kindergarten teacher to teaching mostly juniors and seniors most of my career at Princeton,” she said."}, {"text": "Her decision to be a teacher was driven by Ms. Rodriguez’s belief on family. “I want a lifestyle where I can enjoy my family, so of course, the timeline [of being a teacher] is very appealing, especially as a young person, being able to coach and being able to be around kids"}, {"text": "all day long.” Teaching checked off all the boxes, allowing her to spend her summers with her family while making a real impact in the lives of her students."}, {"text": "She lives in the same house she grew up in, a farm that has been passed down from generation to generation. “My family’s been on our property for over 100 years, so it’s just been passed down and passed down,” she said. “Now, my kids are the sixth generation on that property.”"}, {"text": "In this multigenerational home, she lives with her grandparents, as well as her brother’s family."}, {"text": "Ms. Rodriguez wishes to create a long-lasting impact on students’ lives at South."}, {"text": "“My hope is to come in and feel like a seamless part of our school, of our community,” Ms. Rodriguez said. “I want staff and students to feel as if I’m somebody that they can come to and trust and depend on, and I want that reciprocated.”"}, {"text": "Student Council President Snehal Paliwal (‘23) met Ms. Rodriguez for the first time during orientation.“She was very welcoming,” said Paliwal. “It was just really nice to meet her.”"}, {"text": ""}, {"text": "PHOTO BY VALERIE RODRIGUEZ"}], "file_structural_elements": {"title": "Assistant Principal Rodriguez joins South", "date": "November 17, 2022", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "     After a summer of adventure, when Pirates made the voyage home, they found a new Pirate onboard: Assistant Principal Valerie Rodriguez.\n     The former calculus teacher for 14 years at Princeton High School, from which she graduated, said, “I was feeling kind of stale in the classroom. I didn’t", "image": "https://thepirateseye.org/wp-content/uploads/2022/11/rodriguez-900x675.jpeg"}}