{"tree_elements": [{"text": "“I was hooked,” gym and health teacher Ms. Beth Fitzpatrick said about her first time attending a Hall of Honor award ceremony."}, {"text": "A 23-year-old South tradition, the Hall of Honor recognizes alumni and staff for their service and achievement. As noted by the WWP South Hall of Honor website, the founding vision was “to connect the past to the present and the future” and to inspire those who “work for the good of this institution to continue to do so with purpose and passion.”"}, {"text": "Honorees have become an “integral part” of South history and are featured on the wall between the glass box entrance and the new theater, joining past awardees to inspire current students."}, {"text": "“You get to see so many people that are the history of the South,” said Ms. Fitzpatrick to us in the Commons, next to the podium on which honorees impart wisdom. “It warms my heart.” The event was canceled in 2021 because of the COVID-19 pandemic. “I have been looking forward to the Hall of Honor coming back. It is such a feel-good time,” said Ms. Fitzpatrick."}, {"text": "The “feel-good time” was definitely present on November 5th, as eight honorees were celebrated in the Commons with their families and friends."}, {"text": "Honorees were nominated and then chosen by the committee, with three categories of awards: Service, Inspiration, and Pirate Achiever. Honoree Ms. Linnie Stuart, a former lunch aide at South, was nominated by her own son, Glenn Stuart, for her lifelong dedication to students."}, {"text": "When honoree Ms. Gail Bruno was notified that she would be recognized for the Inspiration Award, she was exuberant.“I was touched beyond belief,” she said. “I’ve come to all 15 of them. I’ve come every time.”"}, {"text": "Ms. Bruno, a former French teacher at South and a club advisor of the American Foreign Service (AFS) club, was one of the strongest emotional pillars in many students’ lives. “Gail asked me how I felt about my parents getting divorced,” said alumni Sheira Khan (‘82), in her introduction of Ms. Bruno. “She was the only adult who did that for me, and that changed my life because I knew there was someone who had my back.”"}, {"text": "Other honorees, such as Debbie Baer, were also vital to South and the West Windsor community. “She’s been very involved with the teachers’ associations. She’s contributed so much to making the school and district itself a great place to be for everyone, for staff, students and community,” said Mari Pearlman, a friend of Ms. Baer."}, {"text": "The event is inspirational to current students. “I think it’s really amazing how different people can walk different paths and how South provides that opportunity,” said Eeshan Chaudhary (‘23), a member of the South chorus, which performed “The Star Spangled Banner and The Lord Bless You” for the honorees and their families."}, {"text": "Many honorees credited South for giving them an important push toward their success. “It is amazing, the tennis courts, the bucolic environment that I grew up in: the magic [that] happened in here,” said John Patton (‘86), a successful businessman awarded the Pirate Achiever Award. “[When others asked me] ‘how did you get that unbridled confidence?’ It’s because of the administrators, the faculty and the students here. [They] taught me that I could do a lot.”"}, {"text": "Ms. Fitzpatrick said,“ South is such a special place–the common thread is the pride and spirit, just what South stands for.”"}], "file_structural_elements": {"title": "Best of the Best: Hall of Honor returns", "date": "January 5, 2023", "writer": {"mmPM0AAOdiQuDZH4MUVF": {"name": "Karen Yang", "year": "2022"}, "yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "“I was hooked,” gym and health teacher Ms. Beth Fitzpatrick said about her first time attending a Hall of Honor award ceremony. \n     A 23-year-old South tradition, the Hall of Honor recognizes alumni and staff for their service and achievement. As noted by the WWP South Hall of Honor website, the f", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/IMG_1452-782x900.jpg"}}