{"tree_elements": [{"text": "Last January 25 the College Board announced that the Scholastic Aptitude Test (SAT) will go digital in 2024, debuting internationally first in the spring of 2023."}, {"text": "The SAT, a college admissions exam, is central to many high schoolers’ college applications and, many believe, plays a vital role in their acceptance into their dream schools. But, the pandemic has shifted the criteria for admissions for many schools, including Rutgers University, Iowa State University, Rice University, to a more holistic approach."}, {"text": "The pandemic has opened the door to digital exams."}, {"text": "Digital doesn’t mean, however, that students can take it remotely. Kristine Javick, guidance counselor and SAT coordinator, said, “You will still need to go to a testing center. It won’t be something you can do from home. We’ll still have it at South.”"}, {"text": "But, the new test could be taken on a student’s own device, and South will also provide a device if needed during SAT test dates at the school."}, {"text": "Shifting online is only one of the many changes made to the SAT. The new test will be shorter, lasting only two hours, instead of the previous three hours. The test will also allow calculators for the entire math section. The virtual exam will include a built-in calculator, but students can continue to use approved ones if they like. For the reading section, passages will be shorter compared to the current test."}, {"text": "According to a survey performed by College Board, most students who took the pilot version of the new SAT found it to be easier and “less stressful” than the previous examination."}, {"text": "Junior Sukriti Varma, who took the non-digital SAT in December, said, “A lot of students struggle with focusing for like three hours at a time, and just getting minimal breaks in between, so with the test being shorter, I think it’s much easier to focus and do your best on all the sections.”"}, {"text": "Senior Laksha Arora disagrees. “If you are the first class taking the new SAT, I don’t think you know what to expect, so there is way less practice material,” said Arora."}, {"text": "To remedy this, College Board will provide prep material to students to make the SAT more equitable for students."}, {"text": "The decision to modify the exam came as the importance of the SAT and the ACT, an alternate standardized exam, which provides scores that students can send to colleges, is waning. Starting in March 2020, most colleges went test-optional, no longer requiring the SAT and ACT scores to be submitted with students’ college applications."}, {"text": "“Even prior to COVID, we saw many more schools going test-optional,” said Ms. Javick. “There were a lot of questions about test equity and about students having access to the test, and students having access to test prep programs.”"}, {"text": "The upcoming SAT attempts to solve these issues. “I think their [College Board’s] hope is that it will be more equitable for students, especially trying to provide test prep for all students that are taking the test,” said Ms. Javick."}, {"text": "Although some schools, such as the Massachusetts Institute of Technology (MIT), went back to requiring standardized test scores, many colleges such as Cornell and Tufts University have extended the test-optional policy to the 2022-23 application cycle. “It’s really been a mixed bag between colleges and universities and what their policies have been coming out of COVID.”"}, {"text": "These recent developments have changed SAT’s dynamic in college applications."}, {"text": "For students not submitting their scores, it has shifted weight to other parts. “Think of it like a pie–instead of there being four pieces in a pie, there are now three pieces in a pie because they were taking out the testing component, so it just added more weight to the transcript, letters of recommendation, and student essays,” said Ms. Javick."}, {"text": "But the SAT continues to hold significance, and Ms. Javick suggests using it to your benefit. “Even if it is test-optional, if you have a score that you think shows your ability as a student, it is a good idea to send it.”"}, {"text": "Varma said, “I think the SAT still holds a lot of weight, just that other parts of your application hold more weight”."}, {"text": "Changes in the SAT are likely to continue, but for now the SAT will be a part of most student applications."}], "file_structural_elements": {"title": "Big changes to the SAT", "date": "April 1, 2022", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "     Last January 25 the College Board announced that the Scholastic Aptitude Test (SAT) will go digital in 2024, debuting internationally first in the spring of 2023.\n     The SAT, a college admissions exam, is central to many high schoolers’ college applications and, many believe, plays a vital ro", "image": "https://thepirateseye.org/wp-content/uploads/2022/04/Screenshot-2022-04-01-11.27.40-AM.png"}}