{"tree_elements": [{"text": "Brexit, short for Britain’s exit from the European Union (EU), is scheduled for Oct. 31 and could have major effects on countries that are both directly and indirectly involved, including the United States. As the deadline for the Brexit deal approaches, Britain’s prime minister, Boris Johnson, faces an increase in pressure to finalize an agreement with the EU."}, {"text": "Although Johnson has repeatedly assured the public that he will resolve this ongoing conflict by Halloween, his promise is looking increasingly uncertain."}, {"text": "The issue of Brexit began in June 2016, when a referendum, or a general vote, was held to decide whether Britain should leave or remain in the EU."}, {"text": "To many people’s surprise, the referendum resulted in 52 percent of voters supporting the “Leave” decision."}, {"text": "Nearly a year later, Theresa May, the prime minister at the time, invoked Article 50 of the Treaty of the EU, which began the process of withdrawal. The event led to a long period of negotiations between Britain and the rest of the EU, a discussion that is still taking place today."}, {"text": "Although the original date of Brexit was March 29, 2019, it has been pushed back twice due to complications with certain points in the Withdrawal Agreement, also known as the Brexit deal."}, {"text": "The agreement mostly concerns issues such as the rights of British citizens living in the EU and citizens of the EU living in Britain, as well as the nearly £40 billion that Britain has to pay the EU to exit the union."}, {"text": "Most of the controversy, however, has been centered around the problem of maintaining an open border in Ireland between Britain and the EU."}, {"text": "If Britain leaves the EU, the only separation between the two sides will be the Irish border, the land boundary that divides Northern Ireland (a part of Britain) and the Republic of Ireland (an independent country that is a member of the EU)."}, {"text": "According to BBC, because Britain will most likely leave the customs union and single market — two systems that were implemented to make trade within the EU easier — Northern Ireland would have to follow different trade regulations than the Republic of Ireland."}, {"text": "This would result in document checks and inspections at the border, thus leading to the installment of cameras, security posts and the creation of a “hard border.”"}, {"text": "The problem with the enforcement of a hard border is that it would be a clear violation of the Good Friday Agreement, a 1998 peace deal that eased the tension between Britain, Northern Ireland and the Republic of Ireland by making the Irish border essentially invisible."}, {"text": "Watchtowers and security checkpoints were removed to improve the trade between the two parts of Ireland and encourage cooperation."}, {"text": "As a result, the return of this boundary would be disastrous to the fragile state of peace in Ireland.\nWorld History teacher, Brian Levinson, agreed, saying,“I […] worry about limiting the movement of people and goods. For one thing, fair and sensible trade is a way to enrich communities – even struggling communities. Also, countries that trade together are less likely to engage in military conflicts.”"}, {"text": "To resolve the issue, a solution was proposed: the Irish backstop. The Irish backstop guarantees that a physical border between the Republic of Ireland and Northern Ireland will not return, but it will only be put into use if a permanent solution is not reached."}, {"text": "If needed, however, the backstop would keep Britain in a very close trading relationship with the EU until an agreement is found."}, {"text": "Rather than helping Britain and the EU come to a consensus, the backstop has actually created more controversy around Brexit."}, {"text": "According to freshman Arthur You, “Personally, I don’t think Brexit is a good idea because if the Irish backstop is put into place, Britain will be forced to stay in the trade relationship with the EU for a long time and it won’t be able to make any trade deals with other countries.”"}, {"text": "Finding a permanent solution to this problem has not been easy, especially since it has been the primary reason for the multiple rejections of the Withdrawal Agreement."}, {"text": "The opposition to the backstop eventually led to Theresa May stepping down as prime minister and being replaced by Boris Johnson."}, {"text": "With only a few weeks to go, Johnson wants to renegotiate the deal with the EU and remove the backstop, instead advocating for solutions using technology. The EU, however, has remained firm in their declaration that the backstop is an essential part of the agreement."}, {"text": "Despite this, Johnson claims that even if he fails to convince the EU to change the agreement, he will still withdraw Britain from the union on the deadline."}, {"text": "This exit from the EU without the Withdrawal Agreement is referred to as a “no-deal Brexit” and would result in the absence of a transition period once Britain leaves, meaning that Britain would immediately be exempt from EU laws afterwards."}, {"text": "Consequently, many globally aware citizens are worried about the negative effects this will have on Britain’s economy."}, {"text": "Junior Vaani Bhatnagar said, “Overall, Brexit has already resulted in a slight decline of the British economy. If a no-deal Brexit occurs, it’s difficult to say how much more the country will suffer, since the prices of many essential items will increase. This might not end well for Britain.”"}, {"text": "At the European Summit on Oct. 22, Johnson’s timeline for getting the Withdrawal Agreement approved was rejected by Parliament, leading to further uncertainty about his promise to pull Britain out of the EU by the deadline."}, {"text": "Ultimately, the fate of Britain and the EU remains to be seen as negotiations continue. However, one thing is certain: pressure is rising as Brexit’s deadline draws closer."}], "file_structural_elements": {"title": "Brexit follow-up: will they or won’t they?", "date": "November 1, 2019", "writer": {"7QmjWOmuijWLnsmxiDbP": {"name": "Tinney Mak", "year": "2019"}}, "description": "Brexit, short for Britain’s exit from the European Union (EU), is scheduled for Oct. 31 and could have major effects on countries that are both directly and indirectly involved, including the United States. As the deadline for the Brexit deal approaches, Britain’s prime minister, Boris Johnson, face", "image": null}}