{"tree_elements": [{"text": "“Why is the weather so bizarre?” asked Tracy D’Souza, a sophomore at South. “There’re several rainy days, then one sunny day, then rainy days again. What’s going on?” Some at South believe Hurricane Florence is the cause. This change in weather patterns provokes more serious storms, according to meteorologists. We’re getting more days of rain because of these changes."}, {"text": "Rain is created by water on the surface of the Earth evaporating into water vapor. These vapors condense, forming clouds. When too many droplets mix and become heavy, they fall as rain."}, {"text": "The sun heats up and increases temperatures of oceans, causing more water to evaporate. Smoke released by factories also intensifies ocean temperatures."}, {"text": "The rising temperature of the ocean is a concern, according to National Geographic, because this causes storms to be stronger than expected."}, {"text": "“We’re having different rainfall patterns than in the past,” said Kevin Scully, an AP Environmental teacher at South. Scully explained that more evaporation means higher ocean temperatures, which means higher intensity of storms. Scully said that each year the “intensity in storms is increasing.”"}, {"text": "Some of these storms have the power to create floods strong enough to deluge neighborhoods, hurting property. Recovery from these damages is expensive."}, {"text": "USA Today reported that after Hurricane Florence, which hit the Carolinas and Maryland last September, the total cost to fix damaged buildings and clear roads added up to $16 – $20 billion."}, {"text": "In addition to the monetary cost, there is the cost to human lives: many lost family and friends because of the storm."}, {"text": "Severe thunderstorms are expected to increase as the years ahead. This may harm already damaged coastal areas. The heavy rains New Jersey received last fall was harmless, but climate change can bring stronger hurricanes."}, {"text": "“We used to get more Level 3 hurricanes, now we’re getting Level 5’s,” Scully said. “There’s a shift in the climate.”"}, {"text": ""}], "file_structural_elements": {"title": "Climate change impacts New Jersey", "date": "November 14, 2018", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "     “Why is the weather so bizarre?” asked Tracy D’Souza, a sophomore at South. “There’re several rainy days, then one sunny day, then rainy days again. What’s going on?” Some at South believe Hurricane Florence is the cause. This change in weather patterns provokes more serious storms, according t", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/climate-change-legal-pic-900x597.jpg"}}