{"tree_elements": [{"text": "On March 12 federal prosecutors charged over 33 parents and 13 coaches in a college admissions scandal. These parents are charged with cheating in order to ensure their child a spot in prestigious universities across the country."}, {"text": "Those involved in the case include wealthy CEOs, lawyers, doctors and celebrities, such as Felicity Huffman and Lori Loughlin. These parents worked with college counseling consultants, standardized testing proctors, and college coaches in order to gain their child admission."}, {"text": "The universities involved in the scandal include University of Southern California (USC), University of California Los Angeles (UCLA), Yale, Georgetown, Northeastern, and Stanford University."}, {"text": "The man behind the scandal is consultant William Rick Singer. Singer is the CEO of a college counseling company named The Key. The accused paid Singer to bribe college coaches and test proctors, modify student test scores, and re-write false student biographies."}, {"text": "Singer has pleaded guilty to four charges, including racketeering conspiracy: illegal dealings and actions to gain money, money laundering conspiracy, conspiracy to defraud the United States, and obstruction of justice."}, {"text": "At the center of this scandal is actress Lori Loughlin. Loughlin, most famous for her role as Aunt Becky on “Full House,” and her husband, Mossimo Gianulli, paid $500,000 for the admission of their 19 year old and 20 year old daughters to USC."}, {"text": "Loughlin worked with Singer and the head coach of crew at USC, Josh Adam, to falsely recruit Loughlin’s two daughters onto the team. Loughlin took pictures of the girls on rowing machines to provide evidence of their recruitment, but neither daughter has participated in crew. Loughlin’s younger daughter at USC, Olivia Jade, is a famous social media influencer with almost two million subscribers. Jade has openly expressed her dislike for school on her platform and as a result of the scandal, has lost sponsorships with brands such as Sephora and TREsemme."}, {"text": "It is still unclear whether the children involved in the scandal were aware of what their parents were doing. Actions like posing for photos while pretending to play a sport, lead some to believe that the children had to have known what their parents were doing."}, {"text": "Many of the universities involved in the scam have taken actions to prevent similar incidents from occurring. Several of the schools fired coaching staff that had recruited students through bribery onto their respective teams."}, {"text": "Colleges, such as USC, have stated that any students tied to the scandal would be denied admission and that a review would be conducted on students already admitted at the university."}, {"text": "South Senior, Susan George, said, “After hearing about the admissions scandal, I was kind of mad as individuals who were extremely privileged could put in the minimal amount of effort and still get into the top schools.”"}, {"text": "Admitted and prospective students of the respective colleges involved are angered by the scandal. Students and parents have filed federal class-action lawsuits against UCLA, Georgetown University, Stanford University, and Yale on the account that the admissions process was “warped and rigged by fraud,” according to CNN."}, {"text": "As of April 8, Huffman and 12 other parents have pleaded guilty to bribery and fraud in order to gain admission for their children. Loughlin has pleaded not guilty as of April 14, stating “Any parent would have done the same.”"}, {"text": "The charges against many of the parents include conspiracy to commit mail fraud, honest services mail fraud, conspiracy to commit fraud, and money laundering. If convicted the parents could face several years in prison and pay a substantial fine. When asked about the stigma associated with college admissions, guidance counselor Antonella Facchini said, “I think for some it is a about getting into a certain name school, a certain type of selective school and that’s very unfortunate. We keep hearing the same 20 or 30 colleges and it’s put an exorbitant amount of pressure on students and families and I think there is competition, sometimes, between families.”"}, {"text": "Loughlin was reportedly fixated on gaining admission for her children into prestigious and well-known schools. This was what motivated her to take actions to ensure her daughters’ admissions into USC."}, {"text": "Although this scandal is hurtful and frustrating to many, Ms. Facchini said there are still takeaways and lessons to be learned for both parents and students. “I really hope that students realize that you want to be able to find your way on your own merit, not because someone influenced your path. I really just want [students] to learn from this and realize that money, although it can get you a lot of things, it doesn’t mean you aren’t responsible for your actions.”"}], "file_structural_elements": {"title": "College admissions scandal: how far will money get you?", "date": "May 21, 2019", "writer": {"bijQTp8MbBbMBsVjvq8V": {"name": "Varsha Gollarhalli", "year": "2018"}}, "description": "     On March 12 federal prosecutors charged over 33 parents and 13 coaches in a college admissions scandal. These parents are charged with cheating in order to ensure their child a spot in prestigious universities across the country. \n     Those involved in the case include wealthy CEOs, lawyers, d", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/college-logos-900x654.jpg"}}