{"tree_elements": [{"text": "April 23, 2021 was a little different from other Fridays: classmates may have had pink-and-blue Zoom profile pictures, teachers may have fastened pride ribbons to their clothes and the talkative students in language arts classes may have been unusually silent. This is because they were participating in the Day of Silence, a nationally recognized mix between holiday and protest."}, {"text": "On the Day of Silence, students respectfully stayed silent during their classes, speaking only when absolutely necessary. Then, at the end of the school day, there was an optional Breaking the Silence meeting. There, participants gathered to cheer and yell before beginning an in-depth discussion over issues concerning the LGBTQ+ community at South."}, {"text": "On the sign-up form, students were asked why they participated and why the Day of Silence was important to them. Responses varied, but students generally participated because they wanted to stand up for LGBTQ+ students."}, {"text": "One student responded, “I am a very big supporter of the LGBTQ+ community and I refuse to simply stand by and watch others be persecuted.”"}, {"text": "Another answered, “This is important to me because many of my friends are a part of the LGBTQ+ community and I want to show them my support.”"}, {"text": "According to the Gay, Lesbian and Straight Education Network, or GLSEN, which arranged the event, the goal was to “protest the harmful effects of harassment and discrimination of LGBTQ+ people in schools.”"}, {"text": "South has recognized the Day of Silence for over seven years. In past years, a table would be set up near the attendance office. “Students could sign their names that they were participating, and they would get a rainbow ribbon and a little card that explained what the Day of Silence was,” said Chelsea Allen, South’s Student Assistant Counselor."}, {"text": "However, due to the ongoing pandemic, students this year were given special Zoom profile pictures and video backgrounds to put on during class. This allowed virtual students to take part in the Day of Silence. About 80 students participated this year."}, {"text": "As for the Breaking the Silence meeting, it drew around 20 attendants. Led by Ms. Allen, attendants discussed their Day of Silence experience, the challenges of being silent and whether their teachers acknowledged their protest."}, {"text": "“The Breaking the Silence event at the end of the day is where students can reflect on the day, the mission and message that the day holds,” said freshmen and event organizer Tarun Yanamandra. According to him, the idea was taken from GLSEN’s website."}, {"text": "Ultimately, the Day of Silence is just one part of a movement. South is a place where students and faculty accept each other for who they are, and this culture of tolerance is something to take pride in."}, {"text": "*link to='https://docs.google.com/presentation/d/1Imfk13m_V6AZVYrrZ9w0zuMRL2PmiaxsUFxDg8oN1hk/edit#slide=id.gde29a3a5a8_0_0'*slides*/link*"}, {"text": ""}, {"text": "Image courtesy of South Guidance Department"}], "file_structural_elements": {"title": "Day of Silence goes virtual", "date": "June 3, 2021", "writer": {"jDWiWuTI7F9KAJjATiXf": {"name": "Daniel Wu", "year": "2021"}}, "description": "     April 23, 2021 was a little different from other Fridays: classmates may have had pink-and-blue Zoom profile pictures, teachers may have fastened pride ribbons to their clothes and the talkative students in language arts classes may have been unusually silent. This is because they were particip", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/Screen-Shot-2021-06-03-at-11.51.07-AM-900x506.png"}}