{"tree_elements": [{"text": "On Nov. 26 2018, the Camp Fire, a wildfire in Butte County that devastated northern California, was finally contained after 14 days. The San Francisco Chronicle reported that, as of December 13, Camp Fire, killed 86 civilians and firefighters, injured 17 and three people remain unaccounted for."}, {"text": "The cause of the Camp Fire originated on Nov 8 in the Sierra Nevada foothills and is recorded as the deadliest wildfire in California recorded history.  High temperatures, dry climate and strong winds contributed to the spread of the fire into other regions in Northern California. A natural disaster thousands of miles away from New Jersey hardly seems relevant. But it is important for us to understand fire safety and help the victims of the wildfires through local organizations such as the Plainsboro Pirate Environment Club."}, {"text": "This summer, California reached record breaking temperatures directly correlated with the growing dangers of greenhouse gas emissions and global warming."}, {"text": "The National Climate Assessment, an agency mandated by Congress, reports that as long as temperatures rise, the number of wildfires will continue to increase."}, {"text": "The Camp Fire in Butte County has displaced residents and killed many civilians even as the aftermath of the Camp Fire continues to worsen. According to WWHY in 2018, toxic debris and ash is cancerous to many civilians living near the wildfires."}, {"text": "Civilians in California have experienced the consequences of wildfires before as California is known for its “wildfire season” between June and September."}, {"text": "At South, many students who have lived in or have family members and relatives who live in California can provide firsthand experience about the risks of wildfires."}, {"text": "Sophomore, Varshini Vimal, previously lived in California and had relatives who lived near the California wildfires."}, {"text": "In her experience, Vimal said, “… [administrators] closed down the school[s] and didn’t let [us] go outside since there was so much smoke which was pretty dangerous.” She said that her family , “ checked the news more often so that we could be aware of what’s happening around us.”"}, {"text": "California’s droughts and dry climate contributes to the frequent wildfires.  Surprisingly, , New Jersey is also a region susceptible to wildfires."}, {"text": "According to WWHY, in 2018, “336 wildfires have been reported” in New Jersey. In communities at South, there are many neighborhoods with forests that shed leaves frequently, increasing the risk of wildfires spreading."}, {"text": "As a result, to reduce the chance of a wildfire starting and spreading, it is important to keep plants healthy, clean out gutters which may accumulate old, dry leaves and cut dead branches off of trees to limit the amount of combustible material."}, {"text": "With the importance of fire safety in mind, it is also important to aid California wildfire victims through local organizations such as the Plainsboro Pirate Environment Club."}, {"text": "Secretary of the Environment Club, sophomore Irena Chen, said, “Since the California wildfires were so devastating, I think donating to credible non-profit organizations is really helpful. Our club specifically advocates for the Wildlife Relief Fund which raises money to support families of the victims. Also, our club educates our peers and other students on fire safety and prevention through interactive activities.”"}, {"text": "The Wildlife Relief Fund is a California Community Foundation that has, “grant ed more than $6 million to support relief and recovery efforts in the aftermath of devastating California wildfires.”"}, {"text": "In the coming months, the Wildlife Relief Fund will work with other stakeholders to provide assistance and employment to those affected by the Camp Fire."}, {"text": "The deadly results of the California wildfire signal the need for change in fire safety and prevention, not just in California but in other states as well."}, {"text": "Chen said, “We can learn from these catastrophes to prepare for them in the future. But the resilience and support the victims have received shows that help can come from anywhere.”"}], "file_structural_elements": {"title": "Deadliest wildfire in California made history", "date": "January 23, 2019", "writer": {"": {"name": "Cathy Xiang", "year": ""}}, "description": "     On Nov. 26 2018, the Camp Fire, a wildfire in Butte County that devastated northern California, was finally contained after 14 days. The San Francisco Chronicle reported that, as of December 13, Camp Fire, killed 86 civilians and firefighters, injured 17 and three people remain unaccounted for.", "image": null}}