{"tree_elements": [{"text": "For the first time, Mercer County Park held a deer hunt from Oct. 27, 2018 through Feb. 16, 2019 to control the deer population, a practice that is often called “deer management.” The hunting season was semi-controlled. This means that only parts of the park were open to hunters with a 75-foot safety zone."}, {"text": "The safety zone is a zone where hunters are not allowed to fire any weapons. Following the precedent set with other hunting-approved Mercer County Park Commission (MCPC) grounds, there will likely be another hunt at the beginning of the next hunting season."}, {"text": "Statistics from the New Jersey Farm Bureau indicate that parts of New Jersey currently have between 120-140 deer per square mile. New Jersey is 8,723 square miles. That comes to over 1 million deer in this state alone."}, {"text": "Mercer County Park’s official website, mercercountyparks.org, alerts the community of when and where deer management will take place by posting hunting dates and times on a yellow banner at the top of the site’s homepage."}, {"text": "The website also provides information about  a list of frequently asked questions about deer management, a map of where the hunt will be taking place and a calendar of days"}, {"text": "the location of the hunt."}, {"text": "Hunting deer in Mercer County Park has been met with mixed reception from residents who frequently visit the park as well as with animal rights activists."}, {"text": "Many animal rights activists and average Mercer County residents prefer to take a non-lethal approach to population control. Examples include transporting deer into a new area and sterilization to prevent reproduction."}, {"text": "But some support the park commission’s management program."}, {"text": "“I believe that all of the backlash regarding the hunt is unjustified,” said sophomore Spencer Perrine. According to Perrine, hunters manage the population of deer to make it so that plants and grass in the park can be used to sustain all of the wildlife instead of on an oversized deer herd."}], "file_structural_elements": {"title": "Deer hunt sparks controversy", "date": "March 28, 2019", "writer": {"hAatcVs9qdRuA5BzCBPf": {"name": "Damien Moshman", "year": "2018"}}, "description": "     For the first time, Mercer County Park held a deer hunt from Oct. 27, 2018 through Feb. 16, 2019 to control the deer population, a practice that is often called “deer management.” The hunting season was semi-controlled. This means that only parts of the park were open to hunters with a 75-foot ", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/deer-hunting-color.jpg"}}