{"tree_elements": [{"text": "Dr. Michael Fowlin, better known as Mykee, merged his skills as a performer with his expertise in psychology in his programs at South and GMS in January, which was hosted by WWP."}, {"text": "By playing different characters on stage, Mykee told stories of how mental illness can affect anyone. Each character he performed faced a different mental illness and was at a different stage of their life."}, {"text": "Some of the characters he portrayed were a young boy with A.D.D., a student with cerebral palsy, a high school student consumed by school work and a college football player who masked his identity under a jock stereotype."}, {"text": "Through the characters he played and the stories he told on stage, Mykee stressed the importance of nurturing both the academic and emotional sides of life equally."}, {"text": "He described that his motivation to help others first came from a psychology course he took in high school where he watched “One Flew Over the Cuckoo’s Nest.” The movie is about the mistreatment of people who have mental illnesses in prison. He saw his own history of depression and anxiety mirrored in the movie. He explained that after seeing the movie, he thought, “I would like to help those people – not realizing that those people included myself.”"}, {"text": "During his performance of a high school student with cerebral palsy, Fowlin addressed the importance of recognizing someone’s physical or mental disadvantage but not defining them by it. Mykee’s character said, “If you only see my disability and not [my individuality], then you don’t see me.”"}, {"text": "The characters in the performance expressed how people’s pain and emotions are influenced by how others think they should be feeling.       \n     Mykee said he knows about the fear of talking about mental health issues and the fear of people knowing about it. He explained that those with severe mental illness can sometimes be met with rejection. For example, the negative reaction he experienced in the past stopped him from sharing his struggles with his health condition."}, {"text": "He explained that the first time he realized he could share his pain was when his teacher in high school reached out to him as someone he could trust. “She acknowledged my isolation and my look of sadness. She offered herself as somebody I could sit with and talk to. That made me feel a lot better and less alone.”  That was the first time ever Mykee explained, that he was told directly that it was okay to acknowledge his mental illness."}, {"text": "South’s Student Assistant Counselor, Ms. Chelsea Allen, agreed with Mykee. She said, “I think we as a society are really afraid of being vulnerable. It is really important to bring in programs like Mykee and our health curriculum which talks a lot about mental health.”"}, {"text": "She pointed out that “we as humans always want to fix, help, support and give advice.” But, she explained, “Most of the time, that’s not what somebody needs from a counselor’s perspective. They just need to be heard.”"}], "file_structural_elements": {"title": "Dr. Michael Fowlin addresses mental health in high school with one-man performance", "date": "March 28, 2019", "writer": {"uHrO8Llue5fMUYsmMa39": {"name": "Sanjana Salem", "year": "2018"}}, "description": "    Dr. Michael Fowlin, better known as Mykee, merged his skills as a performer with his expertise in psychology in his programs at South and GMS in January, which was hosted by WWP.\n     By playing different characters on stage, Mykee told stories of how mental illness can affect anyone. Each chara", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/MYKEE-COLORRR.png"}}