{"tree_elements": [{"text": "What would you do if you received a chance to help your community? In a season of lockdowns and icy winters, disadvantaged people need support now more than ever. After taking part in a summer camp for kids, sophomores Nirali Sanghvi and Aru Kakar realized this time during the pandemic was a chance to help their community."}, {"text": "“We realized that there were so many homeless shelters just near us,” wrote Sanghvi in an email interview. “We could not give them a home, but we could certainly help make the place they were living feel like one.”"}, {"text": "With this mission in mind, Sanghvi and Kakar founded the nonprofit Dream of Blue Skies in the summer of 2020. Their goal is to help people in the homeless or low-income community through donations, fundraising, and spreading awareness at South about how large-scale this issue is."}, {"text": "“I heard about Dream of Blue Skies and the mission to provide homeless people with things they need, and this was something I care about, so I decided to become a member,” wrote sophomore Shalin Banerjee in an email. She is a vice president at Dream of Blue Skies and felt that it was important to address homelessness locally."}, {"text": "During the coronavirus pandemic, it is critical to support the homeless community."}, {"text": "“The price for many basic necessities has gotten higher. This makes it harder than ever for those who are low income to have access to basic necessities,” Sanghvi wrote. According to the International Labor Organization, unemployment has increased during the pandemic and the price of food and beverages has risen. In August of 2020, food costs an average of 5.5% higher than in August the previous year. As stated by the New Jersey Department of Labor and Workforce Development, the unemployment rate in December of 2020 was 7.6%, an increase from 3.7% in December of the previous year."}, {"text": "The cold winter is especially a hard time for the homeless community because there is an increased chance of hypothermia as temperatures lower, according to a study by the National Center for Biotechnology Information."}, {"text": "To help support the community, Dream of Blue Skies donates 20 care packages each month to the Ozanam Homeless Shelter in Edison, New Jersey. These packages contain clothing, toiletries, and hand sanitizers. Separately, the organization also donates hoodies and blankets which help to support the homeless and disadvantaged through the winter."}, {"text": "To fund these gift bags, Dream of Blue Skies organized a tutoring program via Zoom with a team of 15 tutors led by sophomores Harshil Dinesha and Shekhar Shah. The idea originated after Sanghvi and Kakar attended a summer camp where they engaged kids with fun activities. They used the donations collected at the summer camp to create a non-profit, and they were interested in continuing to tutor children."}, {"text": "“We brainstormed and came up with ideas on how we could incorporate tutoring into our organization to make a wide impact, and ended up tutoring kids to raise money which would go towards the formations of the bags we donate,” Sanghvi wrote."}, {"text": "These tutoring sessions are taught once or multiple times a week by South sophomores and college students."}, {"text": "“We tutor kids, anywhere from the age of three to eighth grade in different subjects — math, science, LA–anything they need, we provide help for,” Dinesha said."}, {"text": "In addition to being able to assist younger students, this experience was fun for Dinesha and he appreciates being able to support Dream of Blue Skies’ cause."}, {"text": "“This really creative way of making money by ourselves, and then using that same money to then help homeless people, that whole system was really intriguing,” Dinesha said."}, {"text": "As high school students, they can also use the internet to their advantage and spread awareness about homelessness and how people can support their program."}, {"text": "“We have good access to social media and the internet which really helps raise awareness to many kids my age,” Banerjee wrote. “We use our real-life experiences and facts to educate people around us on the problem.”"}, {"text": "Throughout this pandemic, this team of sophomores has found a way to make a positive impact in New Jersey by supporting people who are vulnerable during the winter during this pandemic, as well as helping young students who struggle with schoolwork. Their efforts are an inspiration and a message that time is always right to make a difference in their own community."}, {"text": "“The biggest gift is giving back to where we come from,” Banerjee wrote."}, {"text": ""}, {"text": "To support Dream of Blue Skies, go to their website, dreamofblueskies.org, and visit the “Contact Us” page to let them know if you have any essential items, clothes, or shoes you can donate. Through their website, you can also donate money to fund the organization’s initiative to buy supplies."}, {"text": ""}, {"text": "PHOTO COURTESY OF NIRALI SANGHVI"}, {"text": ""}], "file_structural_elements": {"title": "Dream of Blue Skies", "date": "April 6, 2021", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     What would you do if you received a chance to help your community? In a season of lockdowns and icy winters, disadvantaged people need support now more than ever. After taking part in a summer camp for kids, sophomores Nirali Sanghvi and Aru Kakar realized this time during the pandemic was a ch", "image": "https://thepirateseye.org/wp-content/uploads/2021/04/Cover-photo.jpeg"}}