{"tree_elements": [{"text": "Aboard South’s pirate ship, we’ve been sailing the misty seas, steering the world of creative writing and visual  arts since 1976. First published as a booklet made of  construction paper, “Echoes  South’s Literary and Visual Arts Magazine’’ is filled  with artwork and writing by South students. “Echoes”  was first published seasonally. Today, it’s a yearly publication. The magazine is  designed and created by the six members of the Echoes Club. Submissions are also  accepted by non club members."}, {"text": "The club is advised by  teachers Dr. Danielle Bugge and Mr. Nathan Leventhal. Editor-in-chief Aarushi Bansal (‘23) finds Echoes club a haven for creative  expression. “I love the community Echoes provides to  both artists and writers, the safe space it creates for us to flourish. Through critiquing the art and writing pieces of  our peers, we’re able to observe the hidden talents of  South students,” she said.  Amaidhiameya Ilangovan-Arya (‘24), an artist  and writer in the club, said, “I enjoy coming to Echoes because it is a very calming environment and our club activities have helped me develop my creative skills."}, {"text": "Inspired in part by the National Novel Writing Month, during the week of Nov. 28, Echoes hosted their  first creative writing work- shop of the year. “I wanted to give the creative writers at our school a chance to develop their skills and also share their work with the South community,” Bansal said. The workshop acted as a craft-focused session for students to develop various components of their short story, including structure, character development and  dialogue. Specifically, students learned about how it’s  important to have a setting  that is important to the story, by also describing the  importance of the setting in Harry Potter."}, {"text": "Students also learned techniques for how character development drives the greater plot. “When writing a short  story, focus less on characters and more on the  story itself. The physical appearance of the character  isn’t as important compared  to the plot,” Bansal said. “Instead of hearing about the  length of their hair or the color of their eyes, tell me  more about their personality and their thoughts. This  will help readers become emotionally invested in the story faster because in a shorter piece, one doesn’t have as much time to build up the plot.” Advice like this has been helpful to developing writers of the club.”"}, {"text": "Even though I only joined recently, I think  being part of Echoes has already improved my writing  skills and my appreciation of art,” Ilangovan-Arya said.  Echoes has allowed writers and artists to grow, improving both their crafts  and their mindsets. Ilangovan-Arya said, “In the club,  we do a lot of fun writing and drawing exercises that push my limits and help me be less of a perfectionist.”"}, {"text": ""}, {"text": "PHOTO BY SRI SOWMYA TANGUTURI (’26)"}, {"text": ""}], "file_structural_elements": {"title": "Echoes", "date": "January 5, 2023", "writer": {"": {"name": "Sri Sowmya Tanguturi", "year": ""}}, "description": "     Aboard South’s pirate ship, we’ve been sailing the misty seas, steering the world of creative writing and visual  arts since 1976. First published as a booklet made of  construction paper, “Echoes  South’s Literary and Visual Arts Magazine’’ is filled  with artwork and writing by South students", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/Copy-of-Sowmya-Tanguturi-echoes-club-meeting-900x675.jpg"}}