{"tree_elements": [{"text": "It’s a growing sensation around the world. Esports are captivating the attention of young adults everywhere. Now, that trend has come to South."}, {"text": "But what are esports? The term “esports” refers to individual or team competition in a variety of video games. At the highest level, this can come in the form of franchise sports leagues, like the NFL or NBA, as well as worldwide or regional tournament brackets, like tennis tournaments."}, {"text": "In an effort to bring some of this competition to our school community, an esports club was formed at South last spring under the supervision of gym teacher David Colon."}, {"text": "“I want to have a space where students who have a passion for video games can come and be together with like minded individuals,” said Mr. Colon."}, {"text": "Because of the pandemic, starting mid-year in 2020, the competition games were limited."}, {"text": "“Each season there are a different variety of competitive games offered through Garden State Esports,” said Mr. Colon. Garden State Esports is the state organization through which the club plays games against other schools. As a result of last year’s late start, students were unable to formally compete against other high schools in certain games. But this year, with a full school calendar available, those limitations are gone."}, {"text": "But there is more to the club than just the competitive aspect. There is a large, casual portion of the club centered around friendly engagement between students."}, {"text": "“The casual experience is where the students can meet other students who have similar interests to them and play against them for fun and bragging rights,” said Mr. Colon."}, {"text": "This combination of casual and competitive promotes a healthy environment among club members as they play together."}, {"text": "“Everyone is still helpful to each other, and helps each other learn new skills and become a better player competitively, but everyone still tries their best, and wants to win,” said senior and club president Adrien Vincent. “So it’s a balance between everyone wanting to win, yet we support each other, as we are all from the same high school. We can all relate.”"}, {"text": "Members of the club communicate online from their gaming setups at home, via the app Discord. For this reason, certain students are tasked with making sure the club maintains its philosophy in the virtual setting."}, {"text": "“We do have moderators, and we do watch and make sure it’s all appropriate, and that everyone is friendly,” said Vincent."}, {"text": "The online structure has held up well, and as COVID-19 restrictions continue to loosen and the club hits its stride in its first full year, the students are hoping to transition to a partially physical experience."}, {"text": "“I hope that this year in the winter, we can finally start hosting some in-person events to really bring people together,” said Anurag Pathak, a senior and the club’s secretary."}, {"text": "Even in the online only environment, the club has already succeeded in that sense, as many students have found a new outlet for expressing their passion for games. Virtual or not, as senior Matt Dolce said, “Students should be worried about nothing else other than having fun.”"}, {"text": "IMAGE BY DEAN LOURENCO"}], "file_structural_elements": {"title": "Esports makes its full time debut at South", "date": "November 10, 2021", "writer": {"xcHHOYKQ8MJMj6FRgYiE": {"name": "Danny McElroy", "year": "2021"}}, "description": "     It’s a growing sensation around the world. Esports are captivating the attention of young adults everywhere. Now, that trend has come to South.\n     But what are esports? The term “esports” refers to individual or team competition in a variety of video games. At the highest level, this can come", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Screenshot-2021-11-10-13.14.13.png"}}