{"tree_elements": [{"text": "“What time is it?”"}, {"text": "“MidKnight!”"}, {"text": "The MidKnight Inventors, the combined North-South FIRST Robotics Competition team, competed at the World Championships for the fifth year in a row during spring break. This season proved to be one of the best in the team’s history."}, {"text": "While a celebration of this year’s accomplishments is in order, it is also important to look back at where it all began. Lead mentor Libby Kamen was an original member of the team and  experienced firsthand its 14-year evolution."}, {"text": "Kamen’s passion for Robotics started at a young age. Her family founded Inspiration and Recognition of Science and Technology (FIRST), a nonprofit organization that hosts robotics competitions for students. Through this organization, she was exposed to engineering since her childhood."}, {"text": "When Kamen started high school at North, she was surprised to find that the school did not have its own robotics team. “I just assumed that every school had a team – it never occured to me otherwise,” she said. So, Kamen along with three of her friends, started a team in 2005."}, {"text": "They took on the responsibility of designing all of the components of the robots, including the mechanical, engineering and programming aspects. “The four of us did all of it, which naturally meant we weren’t very good at everything,” she explained. They attended competitions in order to learn from more experienced teams, such as the North Brunswick team Raider Robotix."}, {"text": "As interest in robotics increased in the district, more North students joined the team and South students started becoming involved, as well."}, {"text": "Dr. Ruth Kamen, a founding member of The MidKnight Inventors and Kamen’s mother, noticed the unity of students from both schools. “There is never any hostility between kids from these two high schools, even though they are supposed to be rivals,” she said. “Whether you’re wearing a knight shirt or a pirate shirt, when you come to robotics, you’re a MidKnight Inventor.”"}, {"text": "Seeing that students from both schools were coming together with the shared passion for robotics, the district started to recognize the team as a co-curricular activity. Kamen explained, “This essentially means that we are in line with the curriculum and the goals of the school district, in addition to being a student activity.” This allowed the team to gain support as a self-funded group and raise their own money for every piece of equipment and supplies."}, {"text": "“It’s been a journey of going from this scrappy group of four people to being a total part of the school district because they understand that we’re doing something academic and we’re doing something good for technical education,” Kamen said."}, {"text": "The team has also grown dramatically in size and currently has 115 members, with 26 percent of the team’s leadership positions being held by young women. Kamen attributes this increase in female involvement to the mentorship of the team."}, {"text": "“My philosophy with STEM education is ‘if you see it, you can be it,’ so whether it’s women in STEM or anything else, I think it’s really important to have mentorship that you can identify with,” she said."}, {"text": "“It’s all about sparking something in a student that encourages and inspires them to pursue that,” she said. Her student experience on the team was rewarding, and it gave her confidence to pursue her passion for technology. Reflecting on her student experience, she said, “I know I definitely had that [spark] in robotics, so the reason I stay with the team is to make sure that other people get that too.”"}, {"text": "Kamen hopes to encourage young women to pursue their passion for robotics, despite obstacles they may face. “As a woman who works in a STEM field, it’s very easy to question your value to the job,” she said. “But what I love about robotics is that it gave me this idea that I could do it.” As a mentor, she aims to pass this idea to others on the team."}, {"text": "Vonesha Shaik, a sophomore at South who is a current member of the team and has been participating in FIRST programs for eight years, says the female membership on the team promotes women in STEM, and it has motivated her tremendously. “The amount of dedication that the girls have in an environment that is traditionally male-dominated is very inspiring,” she said. “Seeing firsthand that women are succeeding in STEM fields is really cool.”"}, {"text": "The team’s performance has improved tremendously over the last few years. By competing at different events all over the US, they have won all five of the possible Technical Awards at least once over the course of 14 years, and have won four of them this season alone. This is an improvement from the team’s performance in its early years, when they struggled to win awards."}, {"text": "Despite the rocky start, The MidKnight Inventors persevered and continued to compete. Through many successes and some disappointing losses, the team learned to handle every situation with grace."}, {"text": "In the coming years, Kamen hopes to grow the team more. Dr. Kamen said, “Dedication, commitment, humbleness and integrity are the basis of this team’s sustainability.” These qualities contribute greatly to the achievements of The MidKnight Inventors. As the team continues to evolve, they strive to reach success at higher levels."}], "file_structural_elements": {"title": "Evolution and successes of The MidKnight Inventors: 14 years in the making", "date": "May 21, 2019", "writer": {"ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}}, "description": "     “What time is it?”\n     “MidKnight!”\n     The MidKnight Inventors, the combined North-South FIRST Robotics Competition team, competed at the World Championships for the fifth year in a row during spring break. This season proved to be one of the best in the team’s history. \n     While a celebra", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/robotics-color-1-900x681.jpg"}}