{"tree_elements": [{"text": "In the final weeks of November, Prime Minister Theresa May traveled to the European Commission in Brussels for negotiations at an Emergency Summit. The Summit’s purpose was to craft an exit agreement for her country, the United Kingdom (U.K.), from the European Union (E.U.), as well as agreements on border issues, special trade deals and  future relations between the two governments. \n    The British exit from the E.U., or Brexit for short, came into the public eye when the U.K. Independence Party (UKIP) campaigned with a strongly anti-Europe, anti-Brussels rhetoric. The rise of Nigel Farage and UKIP in the mid-90s and early 2000s made Brexit a household topic."}, {"text": "The enactment of Article 50 of the Lisbon Treaty, which removes Britain from the E.U., has faced opposition from the two largest parties in British Parliament–the ruling Conservative party (who is tasked with implementing it) and the opposition Labour. Members from both are calling for a second referendum to decide the fate of their country.  Despite this, Brexit already has an official date and time: March 29, 2019 at 11 p.m. local time."}, {"text": "“Brexit effects a lot more than just those who live in the E. U. or the U.K.,” said junior Timothy Miles. “It will most probably affect those in the United States to some  degree, but for better or worse remains to be seen.”"}, {"text": "Senior Will Koepp remained optimistic and said, “As result of the falling out between with E.U., the United States is set to benefit from the many trade deals we have with the U.K.”"}, {"text": "Some say the close deadline is exceedingly difficult to work with."}, {"text": "Still, others believe that the deadline will force the UK to rethink Article 50 and stay in the Union. Senior Justyn Chang stated that such a close deadline will have the opposite effect. “Sometimes it’s better to be done with something – the closer the deadline the better.” \n        The main points of the first round of talks focussed on Northern Ireland, which is a part of the U.K.. Northern Ireland was partitioned after the 1921 Uprising that resulted in the creation of the Irish Republic.  The open and free movement between the two Irelands has been previously allowed, but Brexit may change this."}, {"text": "“Local economies would be destroyed with the presence of a hard border as well as one that would split families. Ireland has always been an issue,” said Miles. A hard border would mean heavily restricted movements between the two Irelands."}, {"text": "The plans that have been finalized provide for the creation of a  porous border between the two, with less restrictions, facilitating a more free movement of people and trade.\n AP Comparative Politics and Globals Studies teacher Erin Schomburg also feels strongly about the situation on the Irish border. She said,“I think that Northern Ireland should be allowed–if it chooses– to reintegrate with the rest of the Republic of Ireland.”"}, {"text": "“The porous border is better than nothing,”  Schomberg said, “but I think that probably over time, I would rather see the Anglo-colonized area reintegrate back with the rest of Ireland.”  She explained that there are families that have been separated for decades by the hard border. \n      Another important issue is the question of debt that the U.K. owes to the Euro-zone countries. All member countries of the EU  paid 13 billion Euros annually, as shares of the burden of the total debt for the countries equally. Chang said, “It’s like a loan.”"}, {"text": "In other words, the price of staying in the E.U. is paying the interest and developmental funds for less economically developed parts of the Union, like Greece or Poland. When the U.K. leaves, it will need to cash out and settle its fair share of the debt all at once. The figure is close to 40 billion Euros."}, {"text": "Such a lackluster deal in some people’s eyes would cost the U.K. more than what they are already paying. “The actual economic benefits that we got back from the free trade zone and other agreements on trade have in my mind at least outweighed all the downsides of the yearly cost of membership to the Union,” said Miles. “And now we are paying so much for the divorce from the E.U. when we are trying to save money. It’s simply not logical.” A free trade zone means restriction free trade between countries in the zone.\n    From Chang’s perspective,  keeping with the Brexit bill is an “overtly cheaper option.” He explained that it was like paying back all the debt at once rather than simply paying for the interest rate on it. That’s the U.K.’s best option."}, {"text": "The current situation in the U.K. has been the hampered by the government’s failure to secure the necessary votes in Parliament to agree on the exit plans.  The resignation of several key cabinet ministers, most notably the Brexit secretary Dominic Raab who was in charge of the transition, has not helped move things forward. The result of such a divide could lead to either a hard Brexit, which would result in the severing of diplomatic ties to the E.U., or a possible second popular referendum. This second referendum would mean the first could be overturned, preventing Brexit from happening."}, {"text": "Whether or not Brexit will materialize is a matter of political might. Because May survived the vote of no confidence against her on Dec 12, she has strengthened her position in Parliament. This is a clear indicator that the party and government will stand behind their Prime Minister."}], "file_structural_elements": {"title": "Falling apart: will Britain leave the European Union?", "date": "January 23, 2019", "writer": {"K0XYYhODXZQZ46XQPVNR": {"name": "Richard Maffei", "year": "2018"}}, "description": "    In the final weeks of November, Prime Minister Theresa May traveled to the European Commission in Brussels for negotiations at an Emergency Summit. The Summit’s purpose was to craft an exit agreement for her country, the United Kingdom (U.K.), from the European Union (E.U.), as well as agreement", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/brexit-2-color.png"}}