{"tree_elements": [{"text": "*link to='https://www.npr.org/2018/02/01/582358540/muellers-reputation-in-washington-is-stunningly-bipartisan-journalist-says'*NPR*/link*"}, {"text": "The Mueller report was set to determine whether there was Russian interference in the 2016 Presidential election. The legal investigation focuses on whether or not President Donald Trump or anyone associated with him should be charged with collusion."}, {"text": "The much-anticipated Mueller report came out on April 18. The report goes in-depth on possible Russian influence on the 2016 election and its connection to Trump’s appointment as president. However, only a redacted version can be found online instead of the full length report."}, {"text": "*link to='https://drive.google.com/a/wwprsd.org/file/d/1hlQOM3wSSbJz3LqueNV5a45pgosdVvB-/view?usp=drive_web'*the report*/link*"}, {"text": "*link to='https://www.theatlantic.com/ideas/archive/2019/04/ben-wittes-five-conclusions-mueller-report/588259/'*Five Things I Learned From the Mueller Report*/link*"}, {"text": "Even when Mueller was working on the report, Trump had tried to involve then Attorney Jeff Sessions to hinder the investigation. Wittes writes, “Trump wanted Sessions both to limit the scope of the investigation and to declare its outcome on the merits with respect to Trump himself. This action would have quite literally and directly obstructed justice.”"}, {"text": "After the Mueller report’s release, doubts have arisen in the public eye of what is considered an impeachable offence. As different issues mentioned in the report may spark impeachment and lawsuits against President Trump for his actions, America will have to await the true backlash of the Mueller report."}, {"text": "Advanced Placement American Government teacher, Mike Garzio said, “[A]s far as I’m concerned, the big charge that everybody was saying, that there was this smoking gun that Donald Trump had done something treasonous, that’s not there.”"}, {"text": "Mr. Garzio continued, “In my opinion, if [a treasonous action done by the president] was there and Attorney General Barr didn’t disclose that in the original [the Barr] summary, then I think we would have heard from Robert Mueller at this point, as he would say, ‘wait a minute, that’s not what I said.’"}, {"text": "Mr. Garzio added that the backlash of the Mueller report from the public is dependent on how much media people consume."}, {"text": "“For someone who does not consume a lot of media, it is not going to matter at all because let’s think about it — whether or not you even knew what the Mueller report was in the United States, depended on how much you can [media] consume and where you consumed it from,” Mr. Garzio added."}], "file_structural_elements": {"title": "FAQs about the Mueller Report", "date": "May 21, 2019", "writer": {"": {"name": "Tanvi Singh ", "year": ""}}, "description": "\nWho is Robert Mueller?\n\n     Robert Mueller is a lawyer, U.S government official and former director of the Federal Bureau of Investigations (FBI) from 2001 to 2013. He and his team, that included experts from FBI and the Department of Justice, investigated and wrote the report that bears his name.", "image": null}}