{"tree_elements": [{"text": "A teacher, a Vietnam war veteran, a father, a grandfather, a husband, a coach, and a devoted Pirate — social studies teacher Walt Conner has sailed aboard our pirate ship since 1975. On Oct. 29, after 46 years, he stepped off our ship, leaving behind an unforgettable legacy. Before he left to embark on his next adventure as a retired teacher, we were lucky enough to have a conversation with him about his time at South."}, {"text": "Q: What interested you about teaching?"}, {"text": "The kids mostly. I have eight kids of my own so I learn a lot from them, and I just enjoy teaching the curriculum. This is a very good school district, so a combination of both students and the curriculum."}, {"text": "Q: What inspired you to teach history?"}, {"text": "I was in the science curriculum before I went to Vietnam, and when I came back I decided to be in business. When I went back to school I noticed that I liked history courses more than anything else. I was also athletic in high school and I enjoyed coaching a lot of sports at South. In 1975, I decided to become a teacher."}, {"text": "Q: How did your experience in Vietnam affect your teaching?"}, {"text": "Because of the curriculum, you can get into some of the areas that actually involve combat. Knowing what combat is really like helps a lot when you are discussing different war situations and not only combat itself, but also understanding people on the homefront."}, {"text": "Q. What was your favorite memory at South?"}, {"text": "I have two favorite memories. One is when I was activated in 1991, how unbelievably supportive the people were when they found out that I was involved in the Persian Gulf War. One of my students wrote a song about me. It was just really impressive, and they had a big going away party for me and another teacher, who was also deployed. They 100 percent supported us. That was one thing that I was very impressed with. The other thing is my son was in a very bad car accident with brain damage actually in 2005, and I was out for three months. He was in a coma for about a month. He was fortunate actually and he is good now. He has a graduate degree, drives, and is getting married. It was a very stressful time, and the school district was very supportive of that."}, {"text": "Q: What are you looking forward to in retirement?"}, {"text": "Well, my wife wants me to see the grandkids, that’s one thing–we have 18 of them. One of them, we haven’t even seen because of the pandemic. They live in North Carolina. I’m involved with the church, and I’m also in a Marine Corp organization because I retired from the Marine Corp. I’ll probably get more active in that."}, {"text": "Q: Do you plan on coming back to visit our school?"}, {"text": "Oh yeah. [If they ever have] reunions or if they ever need a guest speaker, I’d be happy to do it. This has been my life. I got married the year before I started teaching here and I have eight kids now and eighteen grandkids. The school district has been really good and the students are great, parents are great. I always say, it’s the best school district in the country. It is."}, {"text": "PHOTOS BY KALYANI SAMUDRLA"}], "file_structural_elements": {"title": "Farewell to our original Pirate: Mr. Conner retires", "date": "November 9, 2021", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}, "oZGSQKPCWdIpU60HDHNu": {"name": "Vivian Xie", "year": "2022"}, "Gxd1r1z0AAbCXQdmEWSS": {"name": "Kalyani Samudrla", "year": "2021"}}, "description": "A teacher, a Vietnam war veteran, a father, a grandfather, a husband, a coach, and a devoted Pirate — social studies teacher Walt Conner has sailed aboard our pirate ship since 1975. On Oct. 29, after 46 years, he stepped off our ship, leaving behind an unforgettable legacy. Before he left to embark", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Screen-Shot-2021-11-09-at-12.40.51-PM.png"}}