{"tree_elements": [{"text": "On Dec. 21, 2021, New Jersey became the 15th state to pass the New Voices Law."}, {"text": "According to the New Jersey Education Association, the New Voices Law is a student-driven movement of activists seeking rights for school press. The supporters of this law include students and advocates in various fields like law, journalism, and civics."}, {"text": "From the academic year 2022-23, this law will help public school students use their first amendment rights, giving more freedom to students to write about controversial topics."}, {"text": "Though the New Voices Act is currently paving the way for greater journalistic freedom, there has been a long history of student activism for increased free speech."}, {"text": "The most famous example is from 1969 when the Supreme Court heard the case Tinker v. Des Moines. Mary Beth Tinker, then 13, and her 16-year old brother John filed a lawsuit against their school for violating their first amendment right to peacefully protest the war in Vietnam by wearing a black band on their upper arm. On Feb. 24, 1969, the Supreme Court ruled that first amendment rights apply to all public school students and the administration cannot violate that right unless it interferes with the educational process."}, {"text": "This case set a precedent for free speech rights: students’ first amendment rights do not stop at the school door. They have the liberty of speaking their minds about what they think is ethical on school grounds."}, {"text": "But about two decades later, these rights became limited in the Supreme Court case Hazelwood v. Kuhlmeier. In this 1988 case, the school administration of Hazelwood East High School removed an article written in their school newspaper about teen pregnancy and divorce."}, {"text": "The Supreme Court decided in favor of the school district because they said the newspaper was funded by the school, and so school administration had the right to censure publication of articles they deemed inappropriately represented the school."}, {"text": "While the Tinker case gave first amendment rights to students, the Hazelwood case took back most of those rights."}, {"text": "The New Voice Law will expand the rights of high school journalists once more."}, {"text": "IMAGE BY ELIANA DU"}], "file_structural_elements": {"title": "Fifteenth state to pass New Voices Law", "date": "June 25, 2022", "writer": {"XETo63LBGDzjNVJ1rC0Q": {"name": "Shefali Saxena", "year": "2021"}}, "description": "\nOn Dec. 21, 2021, New Jersey became the 15th state to pass the New Voices Law.\nAccording to the New Jersey Education Association, the New Voices Law is a student-driven movement of activists seeking rights for school press. The supporters of this law include students and advocates in various fields", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/Screenshot-2022-06-25-at-12.10.46-PM-446x900.png"}}