{"tree_elements": [{"text": "What do you think of when you hear the word unconference? Freshman Aaravsinh Solanki said, “(it’s) an informal teaching” that brings students into conversations. Students learn and are given the opportunity to inform others about topics they enjoy."}, {"text": "For the first time in South’s history, students in all grades chose a topic on Google Forms that they enjoyed or wanted to know more about. Then on Nov. 16, they went to their assigned classes."}, {"text": "“This is a great opportunity for students to make their mark on high school,” said Matthew Coburn, World History teacher at South and co-creator of the Unconference."}, {"text": "“Instead of being a group of people listening to (one) another, this was (more) communicating and interacting with others,” said Anirudh Bharadwaj, a junior at South."}, {"text": "The unconference classes “aren’t meant to be debates, these are meant to be conversations,” said Chelsea Allen, Student Assistant Counselor at South and co-creator."}, {"text": "“The goal is to recognize that people don’t think the same,” said Mr. Coburn. “We need to understand that there are different viewpoints and that we need to accept these viewpoints.”"}, {"text": "Megha Senthil, junior at South, said, “The Unconference was satisfying because it allowed you to get other people’s opinions on topics that you care about. It’s nice learning about things that I enjoy.” Megha believed student teachers gained leadership skills because they ran their own group."}, {"text": "Junior and Unconference leader Samantha Forrest ran a session about the importance of eco-friendliness. She was interested in leading this group because she believed that “everyone should integrate sustainable and eco-friendly habits into their own lives, such as recycling more, reducing waste, and learning more about what (they) can do to help the environment.”"}, {"text": "The students who chose to teach an unconference session learned just as much as students who didn’t. Forrest said, “I learned about different perspectives towards implementing more environmentally conscious ideas and practices.”"}, {"text": "Planning for the Unconference was challenging. “It was hard figuring out what the group needed, and where to put them,” said Ms. Allen. “We were working within a lot of perimeters.” Because of these restrictions, “there wasn’t really cohesion in groups.”"}, {"text": "What changes might we see in the next Unconference? According to Ms. Allen, grades will be intermixed in classes."}, {"text": "“We’re going to make a Google form on classroom and Gmail looking for topics and student volunteers,” Ms. Allen said. “We might find some effective outside groups as well. We’re open to ideas if any student knows any group outside (of school) that would like to come in and talk.”"}, {"text": "Edward Yin, junior at South, had some ideas of his own. “Next year, I want to see some more interesting topics. Preferably some that are less mainstream, something that you wouldn’t normally come across.”"}, {"text": "The next one will be on Mar. 21."}, {"text": "“A lot of students want to take action, and this unconference is a great way to do that,” said Mr. Coburn. “Sometimes, taking action is as simple as speaking up and voicing opinions.”"}], "file_structural_elements": {"title": "First Student Unconference: success", "date": "January 23, 2019", "writer": {"L2tabycjXwSAHtJCW6yQ": {"name": "Grace Choe", "year": "2019"}, "AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "   What do you think of when you hear the word unconference? Freshman Aaravsinh Solanki said, “(it’s) an informal teaching” that brings students into conversations. Students learn and are given the opportunity to inform others about topics they enjoy.\n     For the first time in South’s history, stud", "image": null}}