{"tree_elements": [{"text": "Aliens, terror, mass panic: Martians landed on Earth, in a farmer’s field in Grover’s Mill, on October 30, 1938. The small community of Grover’s Mill had a frightening experience and is a historical event that is still known today."}, {"text": "It was a typical Sunday evening before World War II. People at home were listening to their radios while the scheduled broadcasts were running, but when the broadcast was interrupted, it took a turn for the worse when there was a report for an unusual object falling in Grover’s Mill. This was followed by a report that Martians emerged from the cylinder that fell from the spacecraft and and started to attack people using a heat ray."}, {"text": "An announcer at the crash of the site reported live, “(S)omething’s wriggling out of the shadow like a gray snake. Now here’s another and another one and another one. They look like tentacles to me.” People at the site were interviewed. A survivor was even followed to see how he was dealing with the aftermath of the invasion."}, {"text": "Over a million people were tuned into the broadcast and believed that an alien invasion was underway on Earth. Terrified civilians all over New Jersey reached the roads trying to leave the state."}, {"text": "Welles had planned his broadcast well in advance. While most people found out soon afterwards that the news story was false, there were others who were panicked and were hysterical; many didn’t find out until long afterwards that the story was fake."}, {"text": "Welles reportedly thought of the idea from a BBC show in which a Catholic priest told people that Communists had seized London and people on the streets believed it. He however wanted to conduct this on a much larger scale and incorporate some features of outer space as well."}, {"text": "This moment of history is seen as a quaint sliver of our past, but was a terrifying moment at the time."}, {"text": "2018 marked the 80th anniversary of this famous broadcast. Many businesses in the area held events to celebrate. There were many contests such as an “Out of this World” sidewalk chalk contest at the West Windsor Farmers Market. Another contest was to create a ‘Gourd’geous alien to decorate on Halloween."}, {"text": "The West Windsor Arts Council also held a Martian weekend which kicked off with the unveiling of a mARTian sculpture by Eric Schultz."}, {"text": "There is now a Martian Landing Site statue at the location where it was believed the aliens had landed. A brief inscription on the statue says, “On the evening of October 30, 1938, Orson Welles and the Mercury Theatre presented a dramatization of H.G. Wells’ “The War of the Worlds” as adapted by Howard Koch.”"}, {"text": "While martians never actually invaded the small town of West Windsor, Grover’s Mill will forever be a name synonymous with alien landing."}], "file_structural_elements": {"title": "Grover’s Mill celebrates the 80th anniversary of false report about Martian landing", "date": "January 23, 2019", "writer": {"BEBL4ArsEm9smMlIITfG": {"name": "Namitha Sethuraman", "year": "2018"}}, "description": "     Aliens, terror, mass panic: Martians landed on Earth, in a farmer’s field in Grover’s Mill, on October 30, 1938. The small community of Grover’s Mill had a frightening experience and is a historical event that is still known today. \n     It was a typical Sunday evening before World War II. Peop", "image": null}}