{"tree_elements": [{"text": "“The Hall of Honor is a tradition unique to High School South,” said Dr. Katherine Heavers, chair of this year’s Hall of Honor. “[It’s] just like South: original.”"}, {"text": "When the Hall of Honor started in 1999, there were only five inductees. Last Nov. 2 the 11th biannual Hall of Honor welcomed ten new honorees: Jean Mauro, Lawrence Swesey, Robert Banks, Lynn Grodnick, Nurith Aizenman (‘89), Scott Alcott (‘84), Bryan Fisher (‘96), Jenny Grodnick (‘83), Kevin Lenox (‘86) and Angela Tsai (‘94)."}, {"text": "140 guests welcomed and congratulated the inductees at this formal ceremony, which was held in the main commons. The tables were decorated with a green or yellow tablecloth with a flickering pine-green candle at the center, an elegant buffet awaited on one side of the room, a student played on a grand piano on the other, lively conversation filled the air."}, {"text": "Michael Carr, a former principal of South, founded the Hall of Honor. According to Carr, the Hall of Honor was inspired by commemorations of excellence such as the Hockey Hall of Fame and the Pro Football Hall of Fame. The Hall of Honor was created to recognize those whose achievements have inspired others."}, {"text": "“[The Hall of Honor] will help us tell a story about Pirate pride and spirit for those in the present and those in the future,” said Mr. Carr over a phone interview."}, {"text": "Bryan Fisher, a Pirate Achiever awardee, spoke about being humbled by his award. “I’m really honored to be up on that wall with all those great people,” he said. Mr. Fisher, in addition to being a world history teacher at South, coaches the varsity boys’ basketball team in the fall and girls’ basketball in the winter."}, {"text": "Tsai, another recipient for the award of Pirate Achiever, said “I’m very flattered. It’s just an honor to be in the Hall of Honor.” Tsai wrote for CBS News and worked as a sports reporter and a television host for Comcast, MSG Networks and NBA."}, {"text": "The Hall of Honor was created to inspire people with Pirate Pride. As Mr. Carr put it, “Everyone has the potential to be part of this story. We are all part of the story, whether we realize it or not.”"}, {"text": "PHOTO BY DAHRIA CHARADNICHENKA"}], "file_structural_elements": {"title": "Hall of Honor continues to inspire Pirate pride", "date": "December 20, 2019", "writer": {"q6Q38H1MOB4iX1yvzBi4": {"name": "Dahria Charadnichenka", "year": "2020"}}, "description": "“The Hall of Honor is a tradition unique to High School South,” said Dr. Katherine Heavers, chair of this year’s Hall of Honor. “[It’s] just like South: original.”\nWhen the Hall of Honor started in 1999, there were only five inductees. Last Nov. 2 the 11th biannual Hall of Honor welcomed ten new hon", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/Dahria-690x900.jpg"}}