{"tree_elements": [{"text": "In “Letter from Birmingham Jail,” published in 1963, Martin Luther King Jr. said, “Injustice anywhere is a threat to justice everywhere.”"}, {"text": "“Letter from Birmingham Jail” is an essay that defends the strategy of nonviolent resistance to end the social practice of segregation. American history has often marginalized  Black American voices and experiences. February was Black History Month, a time to recognize and honor important figures and events in African American history."}, {"text": "Black Student Union club advisor and history teacher, Joseph Porter said, “This is a shared struggle not just for the Black community but for all marginalized and victimized communities.”"}, {"text": "In 1926, Carter G. Woodson, distinguished author, editor, and historian, created “Negro History Week,” which was the seed of what would become Black History Month. In 1970, this week evolved into a two month long celebration that was first initiated by African American history professor Albert Broussard, taking place from Jan. 2 to Feb. 28. Black History Month was later officially recognized by President Gerald Ford in 1976. Now, it takes place from Feb. 1 to Feb. 28 each year."}, {"text": "In order to teach students about the importance of Black history, Mr. Porter and Rose Leonard, co-advisors of Black Student Union, planned a series of events and activities to celebrate Black History Month."}, {"text": "“[We had] guest speakers, panel discussions, assemblies during non-COVID years, cuisines, music and it all culminates into a yearly celebration during a Friday in February,” said Mr. Porter."}, {"text": "This year, the Black History Month Night Time Celebration took place on Feb. 25 at 7 p.m. It was a celebration of Black culture with different events, games, and a chance to interact and bond with peers. Some events that were available included a presentation from the Black Student Union, a performance of African beats from the drumline along with explanations and histories of the music, and a performance from the step team. The WW-P middle schools and high schools gathered together to commemorate this event."}, {"text": "“It [Friday night] was a celebration of Black history, Black culture, Black experience, and Black accomplishments,” said Ms. Leonard."}, {"text": "During the school day, teachers made lessons to enhance the learning process. Mary Desmond, media center specialist, organized many events to celebrate Black History Month. She paired up with Kathryn Carroll, media center specialist at North, to host a read-in on Feb. 21, which is an event that was developed by the National Council of Teachers of English in 1990."}, {"text": "“We invited tenth grade English classes in, and then with whatever openings we had leftover, we invited other English classes in as well,” said Ms. Desmond."}, {"text": "During the full day read-in, the library was closed to visitors. Many teachers and students had the opportunity to participate by reading African American literature. The journalism staff read Martin Luther King’s essay, “Letter from Birmingham Jail,” chemistry teacher Cynthia Jaworsky read an excerpt from John C. Robinson’s book, “Birding for Everyone: Encouraging People of Color to Become Birdwatchers,” and Ms. Desmond read an excerpt from Jason Reynolds’ book, “Long Way Down.”"}, {"text": "“[The] purpose is to really try to highlight and promote community and reading, like linking community with reading,” said Ms. Desmond. “I felt like it was a nice community for the students who were able to attend and I just hope it really promoted some authors of color that are not as well known and should be known.”"}, {"text": "There was also a tour featuring popular Black authors, book displays of current YA books that were written by Black authors, a storytelling section led by Ms. Desmond, and a quilting activity that all took place in the media center."}, {"text": "Many students felt that the implementation of the activities and read-in were inspirational as the month is an honored time to shine a light on marginalized voices."}, {"text": "Sophomore Nishtha Wahi said, “I thought it was very informative and I learned a lot about the culture of Black people which I did not know about. The quilt making was fun and the storytelling in the library was very interesting.”"}, {"text": "These read-ins will continue to occur and will become a new tradition that South and North will hold in the upcoming years."}, {"text": "“As a librarian, I feel like it’s the responsibility of the library to make sure that all voices are being heard, so I think it’s very important to me to make sure that all people, particularly students here at South, feel like they’re included and part of our library and our program,” said Ms. Desmond."}, {"text": ""}, {"text": "Authors that were mentioned during the read-in: Maya Angelou, Jacqueline Woodson, Barack Obama, Martin Luther King, Jr., Langston Hughes, Amanda Gorman."}], "file_structural_elements": {"title": "Honoring Black Voices", "date": "April 1, 2022", "writer": {"nzWe67TLOyFH0NU0m5Q8": {"name": "Tiffany Lu", "year": "2022"}, "aqqY9AKHEOy9aI6zwCiS": {"name": "Kavya Katkuri", "year": "2021"}}, "description": "     In “Letter from Birmingham Jail,” published in 1963, Martin Luther King Jr. said, “Injustice anywhere is a threat to justice everywhere.” \n     “Letter from Birmingham Jail” is an essay that defends the strategy of nonviolent resistance to end the social practice of segregation. American histor", "image": "https://thepirateseye.org/wp-content/uploads/2022/04/Screenshot-2022-04-01-11.47.52-AM.png"}}