{"tree_elements": [{"text": "*link to='https://www.nj.com/weather/2021/09/nj-weather-ida-dumps-staggering-11-inches-of-rain-in-parts-of-state-latest-town-by-town-rainfall-totals.html'*nj.com*/link*"}, {"text": "The remnants of Hurricane Ida, a category four hurricane that traveled over eight states damaged vehicles and roofs, downed power lines leading to lengthy power outages and flooded houses. Spurred by climate change, these storms have caused damages across New Jersey."}, {"text": "“The storage room was completely flooded at the bottom,” said freshman Amrita Choulur. The damages of this storm took days to clean up and repair. “We had to stay up late and we were trying to get big buckets,” Choulur said ."}, {"text": "Many students faced other challenges such as losing basic amenities."}, {"text": "“We lost power,” said Anushya Shankar, co-president of South’s Environmental Club. “My entire grid lost power.”"}, {"text": "The severity of the storm caught most students by surprise."}, {"text": "“I didn’t think it would be a big storm. I thought it would just be a normal rainfall,” said Choulur."}, {"text": "*link to='https://www.nj.gov/dep/climatechange/docs/nj-scientific-report-2020.pdf#page=56'*nj.gov*/link*"}, {"text": "But some were not surprised by the severity of the storm. Among those was AP Environmental Science teacher, Kevin Scully. “I think for years, I have known that the intensity of storms has been increasing, and will continue to increase.”"}, {"text": "“The modeling has been predicting this since the 1990s, and the trend has followed the most extreme version of the model,” said Mr. Scully."}, {"text": "Mr. Scully explained the cause of the intense rain is rising temperatures."}, {"text": "“The increased intensity is really about increased evaporation,” said Mr. Scully. As the ocean warms, air rises causing the air pressure to decrease. Lower air pressure causes wind to move in. Not only does the warming of the Earth cause increased evaporation, but, as Mr. Scully explained, it also causes an increase in wind speed, which raises the chances for violent storms."}, {"text": "Shankar said, “The number of storms isn’t necessarily increasing, but the severity is increasing.”"}, {"text": "Without strict measures to curb global warming, this will be a common occurrence."}, {"text": "Mr. Scully said, “We’re not likely to see in the next few decades anything other than increasing storm intensity.”"}, {"text": "PHOTO BY KALYANI SAMUDRLA"}], "file_structural_elements": {"title": "Intense storms: A consequence of climate change", "date": "November 9, 2021", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}, "TtzLeEsqVllY4uMU8Zl6": {"name": "Manika Niwas", "year": "2022"}, "h6LJRFoJDlU8899sJKNW": {"name": "Ishani Konar", "year": "2022"}}, "description": "From Sept. 1 to 2, the WW-P area was drenched with over 4.5 inches of rain the days Hurricane Ida hit, according to nj.com.\nThe remnants of Hurricane Ida, a category four hurricane that traveled over eight states damaged vehicles and roofs, downed power lines leading to lengthy power outages and flo", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/IMG-1175-e1636501438678-675x900.jpg"}}