{"tree_elements": [{"text": "WWPRSD recognizes Hanukkah as a school holiday, but how many of us know about Jewish-American immigration, history, and our own local Jewish community?"}, {"text": "In 2006, former President George W. Bush proclaimed May as Jewish American Heritage Month. During this month, achievements of Jewish Americans and their contributions in shaping American society is recognized and honored."}, {"text": "This year, as President Biden stated in his White House briefing titled “Proclamation on Jewish American Heritage Month,” celebrating this month is important because anti-Semitism has been on the rise in the recent years. According to the Anti-Defamation League, in 2021 there was a 34% increase in anti-Semitic crimes."}, {"text": "Jewish American history goes as far back as 1585 when the first Jewish person arrived in the United States: Joachim Gaunse. According to the Jewish Virtual Library, Gaunse improved techniques for smelting copper in the copper mines of Roanoke Colony in Virginia."}, {"text": "The first significant phase of Jewish immigration started in the 1820’s, according to the Library of Congress."}, {"text": "“Jewish people traditionally have left places because of persecution,” said Dara Sheller, language arts teacher. Ms. Sheller said that in the 1930’s many Jewish people emigrated to the United States."}, {"text": "There were about 300,000 Jewish refugees on the waiting list to immigrate, according to the United States Holocaust Memorial Museum. Before this, there were quotas that limited the number of Jewish people who could enter the U.S."}, {"text": "“There’s a lot of Jewish culture embedded in New York City,” said junior Ethan Shenker, President of the New Jersey Region of an out-of-school organization called United Synagogue Youth. “There are many museums, including some of the oldest synagogues in the country in New York.” The Angel Orensanz synagogue in New York was built in 1849 by German Jewish immigrants who came to the Lower East Side of New York City, according to the Angel Orensanz Foundation website."}, {"text": "At South, to celebrate Jewish American Heritage Month, Ms. Desmond organized resources that she shared with teachers and made available through her Google Classroom page. She also created a book display in the media center of Jewish American literature."}, {"text": "“There is a graphic novel of Anne Frank’s diary,” Ms. Desmond said. “I enjoyed ‘The Library of Auschwitz,’ which of course, I’m partial to, because I’m a librarian.”"}, {"text": "Since the arrival of the earliest Jewish immigrants to the United States, US culture has been enriched through the celebration of Jewish holidays and traditions."}, {"text": "Speaking about her family traditions, Ms. Sheller said, “We celebrate Jewish holidays around my house and my children went to Hebrew school, so they could learn to read prayers in Hebrew. A sense of belonging, I would say, is what it provides for kids.”"}, {"text": "Sharing her culture with others is an important part of being Jewish American. Ms. Sheller said, “[On] Passover, I always invite some of my Christian friends to my Seders, to dinners to get involved in and sit with us and learn about our culture.” Seders are a religious meal held during the Jewish holiday Passover."}, {"text": "In an increasingly partisan world, and an increasingly diverse America, heritage months like Jewish Heritage Month and Asian Asian American and Pacific Islander Heritage Month are opportunities to cross community experiences and enrich ourselves in relation to one another."}], "file_structural_elements": {"title": "Jewish American Heritage Month Celebrating history, immigration, culture, and contributions to shaping America", "date": "June 24, 2022", "writer": null, "description": "WWPRSD recognizes Hanukkah as a school holiday, but how many of us know about Jewish-American immigration, history, and our own local Jewish community?\nIn 2006, former President George W. Bush proclaimed May as Jewish American Heritage Month. During this month, achievements of Jewish Americans and t", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/IMG_0099-675x900.jpeg"}}