{"tree_elements": [{"text": "“This Fourth [of] July is yours, not mine,” said Frederick Douglass, a famous escaped slave and abolitionist, to the Ladies Anti-Slavery Society of Rochester in 1852. “You may rejoice, I must mourn.” He declared that since there were still enslaved African Americans, celebrating freedom on the Fourth of July mocked the struggles African Americans were still facing. However, in recent years, a holiday dedicated to black freedom has been gaining prominence."}, {"text": "On Sept. 10, Governor Phil Murphy signed a bill declaring Juneteenth a New Jersey state holiday. Juneteenth commemorates the day the last slaves were freed and will officially fall on the third Friday of every coming June."}, {"text": "Although the Emancipation Proclamation officially freed the slaves on Jan. 1, 1863, it took over two years for its effects to reach plantations in the South. The last slaves to hear of their emancipation were in Texas. They got news of their freedom on June 19, 1865."}, {"text": "The Emancipation Proclamation, according to American Studies teacher Joseph Porter, was not as impactful as Juneteenth. “It had no power at the time outside of its foreign policy and recruitment implications. The finality of abolition is tied to Juneteenth.”"}, {"text": "According to the Texas State Library, Juneteenth, originally dubbed “Jubilee Day,” was an unofficial holiday celebrated in Texas every year from 1866 onward. Texas eventually made Juneteenth an official state holiday in 1980."}, {"text": "As black Texans moved into other states, they brought the tradition of Juneteenth with them. Today, 47 states have recognized Juneteenth as a state holiday, and some have given government workers paid leave from work. The Senate has also been in discussions about a bill that would designate Juneteenth as a federal holiday."}, {"text": "While state, federal and national holidays are often considered the same, they mean different things."}, {"text": "Recognized holidays are ceremonial, while official state holidays give government workers paid leave. Federal holidays do the same for federal workers and national holidays apply to all workers. New Jersey’s new bill transforms Juneteenth from a recognized holiday to a state holiday."}, {"text": "“I think it’s amazing this bill was passed,” said junior Kelechi Anyanwu, a member of South’s People of Color Advocacy. “It’s a right step in the right direction especially for New Jersey, as many continue to strive for equality and justice and get their voices heard.”"}, {"text": "This bill came at a pivotal moment in our country’s racial history. After the resurgence of Black Lives Matter protests in response to the death of George Floyd, recent cases of police brutality against people of color are gaining national attention and people are once again wondering whether America is holding up to the ideals of equality it is supposed to represent. Juneteenth could be the reassurance minorities need that their voices are making waves."}, {"text": "Some are optimistic about the future. Kelechi believes “it’s one good step in the right direction and it’s about time honestly.”"}, {"text": "Others are not so confident. Junior Kyra Pruzinski said, “simply acknowledging a holiday -although a good step to take- is nowhere near providing sufficient justice, closure and policy/system reform. It’s important to formally recognize a holiday like Juneteenth, but if other more substantial measures aren’t taken, the effort is performative and shallow.”"}, {"text": "Mr. Porter agreed, “A day off from school and work is not going to undo generations of discrimination and trauma.” Mr. Porter said proper justice would be “Acknowledging explicit bias and systemic racism in policing and other societal structures and then doing something about it.”"}, {"text": "Although it is a largely symbolic step, recognizing Juneteenth could be the start of an effort towards finally acknowledging the struggle that the Black community has faced over generations and correcting the injustices that linger. Hopefully, this bill will lead to greater measures taken towards upholding America’s ideals of equality and justice for all, just as Frederick Douglass wished it would nearly two centuries ago."}, {"text": ""}], "file_structural_elements": {"title": "Juneteenth declared state holiday", "date": "November 19, 2020", "writer": {"jDWiWuTI7F9KAJjATiXf": {"name": "Daniel Wu", "year": "2021"}}, "description": "     “This Fourth [of] July is yours, not mine,” said Frederick Douglass, a famous escaped slave and abolitionist, to the Ladies Anti-Slavery Society of Rochester in 1852. “You may rejoice, I must mourn.” He declared that since there were still enslaved African Americans, celebrating freedom on the ", "image": null}}