{"tree_elements": [{"text": "Korean Pop, better known as K-Pop, is a popular genre of music that originates from South Korea. Recently, through big name bands such as Bangtan Sonyeondan (BTS), BLACKPINK, EXO and TWICE, the K-Pop industry has made its mark on American media. For example, the girl group BLACKPINK has broken records by being the first Korean group to attend Coachella, an American music festival, and by becoming the first K-Pop group to reach one billion views on YouTube."}, {"text": "Similarly, the boy group BTS shook the American Pop industry when  they became the first K-Pop group to perform on a major U.S. award show– The 2017 Billboard Music Awards. They are also the first group since the Beatles to have three Billboard No. 1’s in a year and the first Korean act to present at the Grammy Awards."}, {"text": "Since 2017, the influence of K-Pop has not stopped growing."}, {"text": "“As a K-Pop fan, I’m happy about it,” said freshman Shreya Arora, who has been listening to K-Pop since 2012. “At first nobody really knew about it, ” she explained."}, {"text": "However, along with fame comes criticism."}, {"text": "K-Pop’s expansion in America “is definitely good for the [K-Pop] industry,” said sophomore Trisha Kopparthi. “But I feel like now more people look down on it since it’s a very popular thing.”"}, {"text": "Arora agreed. “Some people are just not open-minded. They won’t even listen to it assuming, ‘oh it’s bad.’”"}, {"text": "Freshman Tanvee Kulkarni said this attitude was because at first, K-Pop was new and unfamiliar to America. “It’s just that we’re so used to listening to Taylor Swift and then when K-Pop comes in, everyone is like ‘uhh, someone else is taking over.’”"}, {"text": "But both Arora and Kopparthi think that the growth of K-Pop in America will lessen the lack of knowledge about it. Kopparthi said, “It’s something that’s been happening for decades and decades: the moment something new enters, the first reaction towards it is criticism. And I feel like it’s very common in life.”"}, {"text": "Kopparthi continued, “Obviously through [K-Pop’s impact], a lot more people know that Korean pop music actually exists.” This, according to Kopparthi, has made us more accepting of pop music from other parts of the world."}, {"text": "Kopparthi, like many other K-Pop fans, hopes that K-Pop continues to attract fans."}, {"text": "PHOTO COURTESY OF WIKIPEDIA COMMONS"}], "file_structural_elements": {"title": "K-Pop pops off charts in 2019", "date": "December 20, 2019", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "    Korean Pop, better known as K-Pop, is a popular genre of music that originates from South Korea. Recently, through big name bands such as Bangtan Sonyeondan (BTS), BLACKPINK, EXO and TWICE, the K-Pop industry has made its mark on American media. For example, the girl group BLACKPINK has broken r", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/KPOP-color.png"}}