{"tree_elements": [{"text": "When Senator Kamala Harris’s vice presidential nomination was announced, junior Rahul Datta thought, anyone from any background can run for the highest leadership positions in the country."}, {"text": "The 2020 election was a topic of heated debate and division. Some high school students considered this to be the most important election of their lifetimes. In comparison to past U.S. elections, the 2020 election was remarkable for many reasons, including the polarization in this country, the diversity in the background of the candidates and the focus that is being placed on vice presidential nominees in particular.  Kamala Harris ran in the presidential campaign, along with Bernie Sanders, Cory Booker, Andrew Yang, Elizabeth Warren. On August 11, Joe Biden named her as his running mate."}, {"text": "“I think this election is unique because of the fact that both of the presidential candidates are so old,” said American Studies teacher Sammy Pantaleo. Many were taking the ages of the presidential candidates into account and considering the possibility that one of the vice presidential candidates may succeed the president."}, {"text": "Aside from the usual discussions and debates over policy and political values, the candidates related to different demographics in the United States. In particular, Harris has reached out to and connected with communities from various socioeconomic and cultural backgrounds throughout her campaign."}, {"text": "“She represents diversity and the appreciation of heritage,” said junior Matthew Xu."}, {"text": "Early on in her campaign, Harris, the daughter of a Jamaican father and an Indian mother, primarily identified publicly as a Black woman. In her first remarks as Biden’s running mate in August, she spoke of her mother’s roots, but identified herself as the first Black woman to be nominated for the vice presidency on a major party ticket. Asian-American voters throughout the country and in WW-P are drawn to Harris’ ties to Chennai, India."}, {"text": "Shyamala Gopalan, Harris’ mother, left her home in Chennai to pursue a Ph.D. in Cancer Research at the University of California, Berkeley. At a political rally in 1962,  she met Donald Harris, who left his home in Browns Town, Jamaica to pursue a Ph.D. in economics. As a vice presidential nominee, Senator Harris often spoke of her experiences growing up as a first-generation immigrant in the United States–experiences that many in WW-P can relate to."}, {"text": "WW-P is often described as a melting pot of many different cultures. Harris’ background as a child of immigrants is part of what made her relatable for so many people."}, {"text": "“She represents a part of the population that isn’t always properly represented, which is fantastic,” said Mr. Pantaleo."}, {"text": "The idea that Kamala Harris is a voice for Asian-Americans, is one that was anticipated to have major impacts on voting and election results. Asian-Americans are the fastest-growing racial or ethnic group of eligible voters, and more than 11 million Asian-Americans are projected to vote in November, according to a report by the Pew Research Center."}, {"text": "“The possibility of having a Vice President that knows what my life is like as a first-generation immigrant is refreshing,” said Datta. “As of right now, it’s uncertain whether we will be able to see this happen in reality; the best thing we can do on our end to see it happen is vote.”"}, {"text": "Harris serves as a voice for many in the WW-P community."}, {"text": "South alumna and the Senior Vice President of News, Opinion and Programming for CNN Digital, Mitra Kalita said, “West Windsor is such a diverse district. I believe many residents might look to their first-generation children, look to Harris on the television and see possibility.”"}, {"text": "Postscript:"}, {"text": "On the morning of Saturday, Nov. 7, Biden won the presidency. Harris, his running mate, won a position in American history: she is the first African American and South Asian woman to be elected vice president. “Kamala’s win reaffirms the core beliefs of America,” said Datta. “Progress is achievable, and anyone, I mean anyone, can reach past the stars and achieve their dreams.”"}, {"text": "Image by Ishita Jadon."}, {"text": ""}], "file_structural_elements": {"title": "Kamala Harris: Symbol of possibility", "date": "November 14, 2020", "writer": {"LpDIeLwdu280NdPILdWj": {"name": "Ashna Garikapati", "year": "2020"}, "1gxmLoWPOUXUra1rHMcD": {"name": "Melvina Deb", "year": "2020"}}, "description": "     When Senator Kamala Harris’s vice presidential nomination was announced, junior Rahul Datta thought, anyone from any background can run for the highest leadership positions in the country.  \n     The 2020 election was a topic of heated debate and division. Some high school students considered t", "image": "https://thepirateseye.org/wp-content/uploads/2020/11/Untitled26_20201116170523.jpg"}}