{"tree_elements": [{"text": "School ends at 2:50 p.m., but South’s halls still buzz with liveliness and some classrooms become packed again with students. After 2:50, school officially opens for after-school club activities."}, {"text": "Every year, new club proposals are approved. For this edition, the Pirates Eye focuses on two new clubs: The Mastery of Language Club and the South Knitting and Crochet Club."}, {"text": "Mastery of Language Club"}, {"text": "The Mastery of Language started when junior Dahria Charadnichenka wanted to help ESL students reach their full potential. “Here, we have so much diversity from immigration, and the main issue that I saw was a language barrier,” Charadnichenka said."}, {"text": "Charadnichenka, along with co-founder Renee Pujara, a junior, created a community where ESL students could come together in a casual, welcoming environment to simply talk."}, {"text": "“We pair multilingual high school students from South according to their language proficiency in other languages with immigrant students whose first language isn’t English,” Charadnichenka said. “These tutors help ESL students with homework, as well as practice English with them.”"}, {"text": "Mastery of Language club is also a place where aspiring writers can gather. The club offers opportunities for writers to practice and hone their craft and to showcase their talents."}, {"text": "“While many clubs are centered around science, math and public speaking, there weren’t any clubs dedicated to helping writers find their voice,” Charadnichenka said. “As a writer myself, I decided to create a community of writers that would become an outlet for creativity at our school.”"}, {"text": "Charadnichenka believed that even when she and Pujara leave South, the club will continue to serve ESL students and writers. “I hope that The Mastery of Language will become a club central to the district.”"}, {"text": "She advises students who wish to create their own club to find an issue that they are passionate about. “Your enthusiasm will drive the club forward into making real change,” said Charadnichenka."}, {"text": "Knitting and Crochet Club"}, {"text": "Knitting and Crochet Club presidents seniors Elizabeth Miller and Madison Li said that knitting in quarantine sparked their interest in starting the club."}, {"text": "“It started off in quarantine when [Li] learned how to knit, and then she taught me and we both got into it,” Miller said. Miller and Li hoped that this club would give students opportunities to explore artistic endeavors."}, {"text": "Miller and Li said that currently they use donated yarns to support the club, but they believe soon, the club would be able to sustain itself and finance their costs. They also shared their plans to hold a bake sale in January 2022."}, {"text": "The Knitting and Crochet Club creates knitted and crocheted things for others. Currently, they are making clothing for the homeless. “We’re basically making crafts for knitwear gloves, scarves, and stuff for winter donations right now,” she said. “It’s just making stuff through knitting and crocheting that goes to charitable groups and organizations.”"}, {"text": "While knitting and crocheting are thought of as similar activities, they actually differ in many ways according to Junior Aaheli Rathi, a member of the club. While crocheting is done with a crocheting hook, Rathi says that there are multiple ways to knit. One of these ways is to use a loom, an object that has pegs on it that users can tie their yarn around to knit various articles of clothing. “There are also knitting needles, which if you’re more advanced and you know how to use needles, good for you,” Rathi said."}, {"text": "Aside from creating things, Miller also hopes that the club could help members relax. “This is a chance for kids to come back and work and de-stress after their day.”"}, {"text": "Rathi said the club environment was a “very accepting” place where you could “just work with your friends, talk, and just have fun.”"}, {"text": "Both Miller and Li expressed hope that the club will continue post-pandemic at South after they graduate."}, {"text": "Li said, “We’re hoping to make a memorabilia quilt, where every member in the club knits [or crochets] their own square. As the club grows, it [the quilt] just expands bigger and bigger. We want to come back in 20 years and have our quilt be bigger than our school.”"}, {"text": ""}], "file_structural_elements": {"title": "Knitting and writing — two new clubs", "date": "February 1, 2022", "writer": {"71hhF0oQr1LLxWE03E35": {"name": "Sidd Shetty", "year": "2021"}, "arVyKy5gQKK0nVfft2Bk": {"name": "Deepa Srinidhi", "year": "2021"}, "zvlB1uq0RYxyMvCNpViY": {"name": "Nikhil Kishore", "year": "2021"}}, "description": "     School ends at 2:50 p.m., but South’s halls still buzz with liveliness and some classrooms become packed again with students. After 2:50, school officially opens for after-school club activities.\n     Every year, new club proposals are approved. For this edition, the Pirates Eye focuses on two ", "image": null}}