{"tree_elements": [{"text": "Handmade banners cover the walls of lockers, booths run different activities along the halls and tables are arranged with platters of ready-to-serve foods like spring rolls, lo mein, fried rice and potstickers — China Night’s festivities have begun."}, {"text": "Held on Feb. 7, South’s China Night is put together by student volunteers and managed by world language teachers Vivian Yu and Jume Shen. At this annual event, the WW-P community comes together to celebrate the Lunar New Year."}, {"text": "The Lunar New Year is the observance of the new year following the lunar calendar. The Chinese zodiac is made up of 12 animals, which were chosen based on the old tale of the jade emperor’s race. The twelve animals that finished the race were then used to symbolize the zodiac animals. These twelve are rotated year after year. Following customs, 2020 is represented by the rat."}, {"text": "Each zodiac animal displays different attributes. The rat is yang and is represented as a metal element from the wood, fire, earth, metal and water elements. According to chinesenewyear.net, a website that focuses on new year festivities and traditions, yang signifies the beginning of a new day, while metal is a symbol for a stable year and the ability to turn misfortunes into fortunes."}, {"text": "Senior Annabel Guo, the President of Chinese Club, said, “China Night does not only serve as a celebration for Chinese New Year, but it also represents the value of sharing the Chinese culture and traditions with those in our community. By incorporating various aspects of the Chinese heritage in this event, Chinese traditions can be passed on from one generation to the next.” For the event, students at both South and North work together to perform traditional and contemporary performances, put together activity booths and hold competitions. Their hard work started in September and the club met weekly to make the one night perfect. Some of the highlighted performances include the Dragon Dance, Lion Dance and Kung Fu."}, {"text": "Other than the performances, the building is decorated with posters and designs. Guo said, “This year’s decorations revolve around the theme of Old Chinatown, and they incorporate large paintings of the night market, paper lanterns and hand-drawn portraits.” On the walls of the commons, “Old Chinatown” and this year’s zodiac animal seemed to come to life. Along the lockers were colorful, attractive booths, like the knotting booth. The knotting booth, headed by senior Elise Nass, introduced interested visitors to the art of tying knots. Using only strands of colorful cords, knotting allows individuals to create intricate designs. “We can make earrings, bracelets, keychains and other decorative knots,” Nass said. We bring several finished knots to display on the table. I always bring several sets of Pipa knot earrings (a pear shaped knot) to give away.”"}, {"text": "With the bracelet preparations ready, Nass began to teach the four knot. This pattern may seem to be intricate on the surface, but Nass said, “This knot is easy to learn, so it’s perfect for children or beginners.” Senior Monali Mohapatra, an attendee of China Night, said, “The booth was very inviting and I got to learn how to knot bracelets for the first time.”"}, {"text": "Toward the close of China Night, Nass said, “I run the booth because I think China night is a fun and creative way to celebrate community and Chinese culture. I enjoy being a part of that.”"}, {"text": ""}, {"text": "PHOTO COURTESY OF ELISE NASS"}], "file_structural_elements": {"title": "Knotting the New Year together", "date": "February 13, 2020", "writer": {"L2tabycjXwSAHtJCW6yQ": {"name": "Grace Choe", "year": "2019"}}, "description": "Handmade banners cover the walls of lockers, booths run different activities along the halls and tables are arranged with platters of ready-to-serve foods like spring rolls, lo mein, fried rice and potstickers — China Night’s festivities have begun.\nHeld on Feb. 7, South’s China Night is put togethe", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/IMG-3816-2-779x900.jpg"}}