{"tree_elements": [{"text": "Passing by South, it’s impossible not to notice the half-finished building that takes up most of the front entrance. But when stepping inside our school, it’s a lot harder to notice the various internal construction areas because they are mostly hidden behind closed doors.\nEach area under development is one in a district-wide, multi-million dollar plan started in 2019 and aimed at improving the appeal and longevity of our schools. South in particular is almost 50 years old and has several areas that require an update."}, {"text": "Out of all the renovations, the library is closest to completion with a new look focusing on giving students space and resources for individual projects. The back of the library has many tables and chairs for students to use, the front is an open area that will be filled with furniture, and the old, tall bookshelves have been replaced with new, shorter ones."}, {"text": "“I’m hoping by the end of October, we are up and running and everything is as it should be,” said Mary Desmond, the library’s media specialist."}, {"text": "The computer lab was removed because students already have Chromebooks and the librarian’s office was moved from the center of the library to the left side of the room."}, {"text": "Two new areas were also added on each side of the entrance. On one side is the quiet room, where students will be able to read and study in an environment without distractions. It currently functions as the main office while the old office continues its construction. On the other is the Makerspace, which will provide students with resources such as a podcasting station, green screen, paper and even Legos for whenever they want to film, build, or do something else creative."}, {"text": "“I do hope that students might find their way to the media center, and they really use the resources that are available to them because I feel like we’re all very fortunate to have access to all of these different resources,” said Ms. Desmond."}, {"text": "The culinary room is also going through a renovation. The drainage and electric systems have been improved, the appliances have been upgraded to accommodate six classes, storage has been enlarged and the room has been remodeled, so it’s easier to navigate. The improvements come from the district’s goal to increase the variety of courses and the fact that the culinary room is over 35 years old. When it finally opens, according to Culinary Arts teacher Ms. Jessica Bidwell, there will be “four Basic Culinary classes, one international foods course and one catering and cooking class.”"}, {"text": "Since the construction has not been finished yet, culinary students have been conducting regular classes on safety and sanitation in the pit/pond. They will move back and be able to use the new appliances once the renovations are complete later this school year."}, {"text": "“The upgraded equipment will make for better efficiency, and the new demo counter will provide students a great learning component in the classroom,” said Ms. Bidwell."}, {"text": "*link to='https://www.youtube.com/watch?v=REHWD8fgKKc'*2019 referendum*/link*"}, {"text": "When the renovations are complete, the building will have more space and more classrooms that will allow for offering students a wider variety of courses than ever."}], "file_structural_elements": {"title": "Looking into the future South", "date": "November 10, 2021", "writer": {"jDWiWuTI7F9KAJjATiXf": {"name": "Daniel Wu", "year": "2021"}}, "description": "Passing by South, it’s impossible not to notice the half-finished building that takes up most of the front entrance. But when stepping inside our school, it’s a lot harder to notice the various internal construction areas because they are mostly hidden behind closed doors.\nEach area under developmen", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Screenshot-2021-11-10-00.01.22.png"}}