{"tree_elements": [{"text": "On March 13, Brian Paulson, Kerry Kemo and Bryan Fisher shaved their heads to raise funds for St. Baldrick’s Foundation, which supports childhood cancer research."}, {"text": "“It’s really a part of South culture,” said Mr. Paulson."}, {"text": "St. Baldrick’s Foundation is a non-profit organization that has raised over 282 million dollars in donations for cancer research since 2005."}, {"text": "A child is diagnosed with cancer every two minutes worldwide, according to the St. Baldrick’s Foundation website. In 2017, researchers at St. Baldrick’s developed a new immunotherapy drug that could potentially revolutionize not only treatment for neuroblastoma, the most common cancer in infants younger than one year old, but also other childhood cancers."}, {"text": "In partnership with St. Baldrick’s Foundation, Mr. Paulson, Ms. Kemo, Mr. Fisher and other coaches and teachers alone have successfully raised nearly a million dollars over the years. “Once you do this once, it’s something that you’re always going to continue to do,” said Mr. Paulson, who is going on five years of participation."}, {"text": "According to Ms. Kemo, who has participated in this fundraiser for twelve years and this year shaved her head for the first time, “The idea of shaving the head for St. Baldrick’s is to be in solidarity with kids fighting cancer who lose their hair and to just give them a feeling of ‘everyone is in it together.’”"}, {"text": "Mr. Paulson said, “Everyone is going to be asking us everyday and that’s kind of the point: to start the conversation.”"}], "file_structural_elements": {"title": "Losing hair for cancer research", "date": "April 30, 2020", "writer": {"q6Q38H1MOB4iX1yvzBi4": {"name": "Dahria Charadnichenka", "year": "2020"}}, "description": "On March 13, Brian Paulson, Kerry Kemo and Bryan Fisher shaved their heads to raise funds for St. Baldrick’s Foundation, which supports childhood cancer research. \n“It’s really a part of South culture,” said Mr. Paulson. \nSt. Baldrick’s Foundation is a non-profit organization that has raised over 28", "image": null}}