{"tree_elements": [{"text": "During the 2020 election, amid claims of fraud and malpractice of the mail-in ballot voting process, a heated debate emerged: was the voter’s voice counted? The data collected so far says yes, as long as people followed the correct procedures for voting by mail."}, {"text": "Mail-in ballots are a way for eligible voters to participate in elections without physically attending the polls. This process is nothing new. In fact, Americans have voted in this way since our founding. Olivia B. Waxman, from Time magazine, writes that the first instances of mail-in ballot voting occurred in the colonial era: “In 17th-century Massachusetts, men could vote from home if their homes were ‘vulnerable to Indian attack’.”"}, {"text": "In this election, which occurred during the COVID-19 pandemic, a study done by the University of Florida showed that more than 92 million voters chose this method of voting. Ballots were sent right to home addresses that could then be mailed in through the U.S. Postal  Service or dropped off at polling stations."}, {"text": "According to Bloomberg, an international news agency based in New York, so far approximately 158 million votes have been counted. This means approximately 72 percent of eligible voters voted in this election, considerably higher than the average of 50 to 60 percent."}, {"text": "The United States has never seen such a high voter turnout, especially through mail-in-ballots, which usually has around 20 to 30 percent turnout. Due to this unprecedented use of ballots, some wondered if the process might be fraudulent."}, {"text": "Reflecting on the November election, American Studies 2 Honors teacher Michelle Costanza wrote in an email that the mail-in ballot crisis is also rooted in other factors. “One element is an increasing distrust for government among Americans, particularly in the systems in place for voting in this national election.” She added that all states have different ways of tabulating and projecting votes. Because of this, some mistook these differences in processing the votes as acts of fraud."}, {"text": "Ultimately, the New York Times staff contacted all 50 states’ election officials on Nov. 9, and wrote in an article that no state is aware of any significant fraud in the election process this year."}, {"text": "Aside from worries about fraud, there were other concerns about how secure the process is  after mailing the ballot. Mark Sheffield, a senior and eligible voter at South, shared these common concerns: “The main worry I have with mail-in ballots is that my vote may not be counted if my ballot is somehow lost.”"}, {"text": "An article by CBS shows that the mail-in ballot process is safe. Once the ballot was mailed, the USPS delivered these ballots directly to the election office. Then, the election officials sorted and checked the ballots for valid signatures."}, {"text": "The officers made sure that each signature matched the voter’s official signature by using a machine that scans the signature on the ballot and compares it to that voter’s signature on any other government-accessible document (for example, a driver’s license)."}, {"text": "If the signature did not match, the ballot went through human verification. After the signature was verified, it was ready to be processed and tabulated."}, {"text": "According to CBS News, a missing or unverified signature or a ballot’s late arrival were some of the most common reasons why ballots were rejected in the past years. Voters with rejected ballots had a chance to correct and resend them."}, {"text": "As a mail-in ballot voter in this election, Ms. Costanza felt that the process was easy. “Aside from a small delay in receiving my ballot because I moved over the summer, I was pleasantly surprised with how simple the process was,” she wrote in an email."}, {"text": "However, it is likely that fraud in the mail-in ballot process did occur. “All voter fraud is extremely rare, experts say, though slightly less rare in mail-in voting,” according to the New York Times."}, {"text": "Despite the claims of only Republican voters suffering from fraud, research has shown that this crisis happens both ways each election. In fact, according to SunSentinel, a Florida-focused news agency, a disproportionate number of African American and Latino voters had their ballots rejected in South Florida this year. Most identified as Democrats, according to Pew Research Center."}, {"text": "“It should not be hard for Americans to vote,” Ms. Costanza wrote. “Though unfortunately we continue to see obstacles such as long voting lines and unequal access to polling locations.”"}, {"text": "In other words, mail-in ballot fraud is always a concern each election by both Democratic and Republican voters."}], "file_structural_elements": {"title": "Mail-in ballots: Fraudulent or safe?", "date": "December 11, 2020", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "     During the 2020 election, amid claims of fraud and malpractice of the mail-in ballot voting process, a heated debate emerged: was the voter’s voice counted? The data collected so far says yes, as long as people followed the correct procedures for voting by mail.\n     Mail-in ballots are a way f", "image": null}}