{"tree_elements": [{"text": "Recently, Gov. Phil Murphy announced that NJ schools have the option to lift the state mask mandate starting March 7.  “This is not a declaration of victory as much as an acknowledgment that we can responsibly live with this thing,” said Gov. Murphy in an article by The New York Times."}, {"text": "Three days before the end of the mask mandate, the district announced new guidelines for wearing masks."}, {"text": "The decision comes as cases in the district have declined. According to nursing coordinator Michelle Crilly, after winter break, as a result of  traveling during the holidays and the spike in infection rates due to the Omicron variant, the district reported 103 cases over a week . By the week of Feb. 20, that number fell to 23 per week."}, {"text": "“I do feel that the cases are going down significantly,” Ms. Crilly said. “I also feel that there is not a huge spread in schools. With the variants that we’re seeing, there is not an increase in hospitalizations, people aren’t getting as sick, especially younger people. So I’m okay with having masks be optional.”"}, {"text": "Students support the district’s policy of optional masking."}, {"text": "“Because most people are vaccinated, I don’t think it would be that much of a risk and a lot of people have been boosted,” said freshman Caleb Ferguson."}, {"text": "But the district remains cautious. In an email to the community, Superintendent David Aderhold said, “The district will determine masking requirements for the week ahead based on the county COVID-19 Activity Level Index (CALI) which is updated each Thursday by the New Jersey Department of Health.” For grades six to 12, if the CALI score is green or yellow, masks are optional. If the CALI score is orange or red, masks are required."}, {"text": "“If COVID cases are rising, I would probably keep my mask on,” said sophomore Natalia Gonzalez.  “If not, I’d just take it off.”"}, {"text": "“It seems the majority of students are continuing to stay masked each day,” said Principal Jessica Cincotta in an email. “I know from personal experience It feels very different to take my mask off in a social setting. I have kept it on in large group gatherings at school.”"}, {"text": "Students are also required to keep their masks on at large indoor gatherings like concerts, sports events or assemblies, on the bus where it is impossible to social distance and in the nurse’s office."}, {"text": "Masks are important to wear when there is risk of transmission. According to the CDC website, “Masks are primarily intended to reduce the emission of virus-laden droplets by the wearer.” People are required to keep them on if they display COVID-19 symptoms."}, {"text": "Ms. Crilly said,“When people return from being COVID positive or if they’re in close contact, it’s hard to keep track of them.”"}, {"text": "Fortunately, cases don’t usually rise in the summer, as people spend a lot of time outdoors, where COVID transmission is low, according to a study by the National Library of Medicine."}, {"text": "“I’m grateful to the South community for the respect they have shown one another as we all navigate our feelings and reactions to being a mask optional school,” Ms. Cincotta said. “South is a special place and I could not be more proud of the way each individual is stepping into this next phase of the pandemic.”"}], "file_structural_elements": {"title": "Masks off?", "date": "March 23, 2022", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}, "yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}, "jDWiWuTI7F9KAJjATiXf": {"name": "Daniel Wu", "year": "2021"}}, "description": "     Recently, Gov. Phil Murphy announced that NJ schools have the option to lift the state mask mandate starting March 7.  “This is not a declaration of victory as much as an acknowledgment that we can responsibly live with this thing,” said Gov. Murphy in an article by The New York Times. \n     Th", "image": null}}