{"tree_elements": [{"text": "“I really want to take Algebra 2 honors next year, but I think I forgot everything,” a freshman told her friend in the dim glow of Monday morning study hall last June. She’d taken Algebra I in eighth grade. Months later, in the summer of 2018, WW-P’s Regional Board of Education considered the same problem."}, {"text": "This year marked the beginning of a new math curriculum at South. Instead of taking Geometry as their required math course for ninth-grade, freshmen took  Algebra 2."}, {"text": "Many freshmen taking Algebra 2 right now are still unaware of the reason behind the change. The focus of the transition is carrying over concepts from Algebra 1 to Algebra 2, explained Peter Collura, an Algebra 2 teacher at South. We want to avoid the gap between Algebra 1 and Algebra 2 where students tend to forget things, Collura explained."}, {"text": "“The familiar skill set (from Algebra 1) reviewed at the beginning of Algebra 2 will ease the students’ transition between middle and high school,” said Andrea Bean, district Mathematics supervisor for grades six to 12. She added that the change will increase students comfort levels  “making mathematical connections” in their new environment."}, {"text": "Another benefit of the curriculum change is that it helps prepare students for the Preliminary SAT/National Merit Scholarship Qualifying Test. According to the official College Board website, the Math sections on the PSAT include a focus on “mastery of linear equations, systems, and the manipulation of complex equations.”"}, {"text": "Two months into the school year, students are experiencing the effect of the change. “As a freshman, it has been fairly easy going from Algebra 1 into Algebra 2,” said Jonathon Julian. “Math is a subject that builds on each other a lot so I am grateful for the new transition.”"}, {"text": "Julian found that problems in his current math class only require a quick reminder from Algebra 1. His math partner sophomore Trisha Murali said that for her solving problems” is more like starting fresh because Algebra 1 was two school years ago.” She finds Julian’s prior knowledge helpful when she forgets basic concepts."}, {"text": "At first, there were some concerns that the freshman would not feel comfortable around their older peers. This has not turned out to be the case. Along with most of their class, both Murali and her partner Julian agree that they are happy with their multi-grade math class. While the mix of freshman and sophomores in math classes is only a part of the first year transition, the multi-age classroom has its own benefits."}, {"text": "According to the Center for Evaluation and Education Policy, multi-age classrooms create a more caring environment between students, because the close environment encourages students to talk to each other. In addition to this, these classrooms also reach a “higher cognitive developmental level at a faster rate than those in classrooms of same-age peers.”."}, {"text": "Other math classes are experiencing a slower transition. “We are still working up to that relationship,” said Collura. “So far I have not seen any difficulties with the transition, but I have a suspicion that they are there and [the students] are not expressing it now. Hopefully, I’ll find out later on in the year.”"}, {"text": ""}], "file_structural_elements": {"title": "Math curriculum change for freshmen", "date": "November 14, 2018", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "     “I really want to take Algebra 2 honors next year, but I think I forgot everything,” a freshman told her friend in the dim glow of Monday morning study hall last June. She’d taken Algebra I in eighth grade. Months later, in the summer of 2018, WW-P’s Regional Board of Education considered the s", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/math-articl-elegal-2-900x593.jpg"}}