{"tree_elements": [{"text": "This February, beloved history teacher Mike Garzio was named the 2022 New Jersey National History Day (NHD) High School Teacher of the Year, a prestigious award sponsored by the 30-year old NHD program, a nationwide wide competition where students create year-long history projects."}, {"text": "Mr. Garzio began his career at South in 2007, starting as a study hall monitor before eventually settling into teaching history courses in the fall of 2009 with American Studies I."}, {"text": "“I was hired permanently to teach AS 1 with Mr. Wayton,” Garzio said, “who was a phenomenal story teller.”"}, {"text": "Mr. Garzio said he loves the story-telling side of teaching history. He credits colleagues like Mr. Wayton, who left South after the 2019-2020 school year, for shaping him into the teacher he is today and inspiring him to put his best foot forward as an educator. He began teaching AP American Government in 2010."}, {"text": "“I was mentored by Ms. Schomburg who helped me greatly through that first year,” he said. “Finally I settled into teaching AP Gov, which has dominated my course load for the past 12 years.”"}, {"text": "Mr. Garzio also credits the students he teaches and advises for their hard work and dedication."}, {"text": "“I feel that the award reflects the efforts and talents of the National History Day kids at High School South more than it reflects my efforts as an advisor or a teacher,” he said. “[NHD] requires dedication, discipline, and serious talent if you plan to achieve at the highest level, which the students at High School South consistently do.”"}, {"text": "This respect between teacher and student is mutual, an observation made clear by senior Guhan Pradeep."}, {"text": "“The way that [Mr. Garzio] talks to us, it makes it really easy for us to share our opinions and for him to assist us,” he said."}, {"text": "Mr. Garzio’s openness and knowledge in his field of interest provides students with an engaging classroom environment."}, {"text": "“Whenever we ask [Mr. Garzio] questions about anything, whether it’s current events or what’s happened in the past, he is always very well informed,” said senior Lauren Morabito. “He explains things in a way that’s easy to understand and interesting to listen to.”"}, {"text": "Through his hard work and dedication to teaching, Garzio serves as a role model for many in our school community. He will be presented with his award during this year’s NHD finals on June 12-15."}, {"text": "PHOTO PROVIDED BY MIKE GARZIO"}], "file_structural_elements": {"title": "National History Day Teacher of the Year: Mr. Garzio", "date": "April 1, 2022", "writer": {"xcHHOYKQ8MJMj6FRgYiE": {"name": "Danny McElroy", "year": "2021"}}, "description": "     This February, beloved history teacher Mike Garzio was named the 2022 New Jersey National History Day (NHD) High School Teacher of the Year, a prestigious award sponsored by the 30-year old NHD program, a nationwide wide competition where students create year-long history projects. \n    Mr. Gar", "image": "https://thepirateseye.org/wp-content/uploads/2022/04/Screenshot-2022-04-01-11.39.54-AM-e1651861436568.png"}}