{"tree_elements": [{"text": "Starting with the 2019 – 20 school year, students taking Advanced Placement (AP) courses now have access to personalized dashboards called My AP on AP Central, the official College Board website for AP.\nAP courses offer high school students the chance to take a college-level course and possibly earn college credits with a passing score on the AP exam."}, {"text": "My AP was launched in Aug. 2019 by College Board, a non-profit organization that owns AP, SAT and ACT, to “help students make the most of their AP experience,” according to their website. My AP also features AP Classroom, a new digital resource aid for students and teachers."}, {"text": "Registration for 2020 AP exams now requires that students join the AP Classroom for each of the AP courses they are taking in school. If students are planning to register for an exam without taking the course in school, they do not have to join the AP Classroom."}, {"text": "“I feel like it’s a good initiative for providing more opportunities for AP students,” said junior Mayank Chauhan, who is taking AP United States History, AP Chemistry and AP Language and Composition."}, {"text": "“Two of my teachers have already started using it,” said junior Renny Victoria who is taking AP Language and Composition, AP Biology and AP Spanish Language. “I’m not sure yet if they plan to assign anything, or if it’s just extra practice that they want to give us, but I plan on seeing what it’s like.”"}, {"text": "AP Classroom includes a personalized progress dashboard that evaluates student performance and provides reports detailing students’ strengths and weaknesses. “It would be really good to get feedback,” Victoria responded. “This is immediate feedback that you can use to your advantage,” Victoria continued."}, {"text": "To evaluate students’ skills and knowledge of content, AP Classroom uses questions and personal progress checks assigned by AP teachers."}, {"text": "Teachers can choose between timing a progress check, or not; administering it online, or on paper; and whether to include multiple-choice questions, free-response questions, or both."}, {"text": "After the progress check, students and teachers are provided with explanations for each multiple-choice question and AP scoring guidelines for each response question."}, {"text": "Students can then talk to their teachers about concepts they did not understand for additional practice."}, {"text": "After assigning his students their first set of questions, AP Biology teacher Matt Foret said, “I’m looking forward to seeing the feedback from the students in terms of what they feel like and in terms of how useful it is to them.”"}, {"text": "“Unlike the SAT where it is easy to find practice tests and questions online, the AP tests are a lot more work,” said Chauhan. “That problem might have been partially addressed with the new changes, more specifically the AP Classroom.”"}, {"text": "According to College Board, along with the progress checks, students can see the content and skills they need to know for each unit in the course."}, {"text": "“The most difficult thing was just the degree of difficulty to expect on the exam,” reflected Victoria on her experience taking the AP Computer Science exam last year. “While practicing different questions we were not really sure to what extent those questions would be on the exam.”"}, {"text": "The frequency of questions per unit is now included in the unit guides provided for teachers on AP Classroom which, according to College Board, list all the topics and skills that might appear on the AP exam."}, {"text": "Teachers can access and assign additional questions from the new College Board-evaluated AP question bank."}, {"text": "“It’s really an intensive process,” Mr. Foret explained. According to Mr. Foret, the questions are discussed by committees before appearing on the exam."}, {"text": "“For students to have access to questions that have really gone through that process, hopefully, there’s a lot of value to that,” Mr. Foret said."}, {"text": "AP exams for certain courses have also gone through changes."}, {"text": "The AP Language and Composition exam now includes a writing skills-based passage. Students taking AP Environmental course exams are permitted to use calculators. The AP Biology exam has fewer questions and better-defined free-response questions. “I think they made some appropriate changes,” said Mr. Foret."}, {"text": "AP Biology teacher Dr. Meenakshi Bhattacharya explained, “There used to be a little bit of emphasis, maybe 20 percent, on the human body systems. [T]hey removed that because a lot of schools […] were not able to cover the whole curriculum so that students would be really ready for the AP test.”"}, {"text": "The registration deadline for all AP exams has shifted from mid-March to sooner in the year.\n“So in order to encourage more students to take more AP exams in the classes they are enrolled in, they’re [College Board] now requiring that we do our order by Nov. 15,” explained AP coordinator and guidance counselor, Brooke Parrott."}, {"text": "Chauhan said, “The new registration deadline of early November is pretty disappointing and stressful.” He added that it leaves “close to no time” for students to adjust to the course."}, {"text": "Ms. Parrott said, “I don’t know whether it will push students to test who aren’t quite ready even with all the additional support. We’ll know by Nov. 15 what the numbers look like.”"}, {"text": "“Last year we administered nearly 1600 [AP] exams to over 600 students.”"}, {"text": "AP exams will be conducted from Monday, May 4, 2020, to Friday, May 15, 2020. To prepare for this year’s exams, many students will be using the questions and tests on AP Classroom to study."}, {"text": "“I would definitely say that they are score boosters,” commented Chauhan. Victoria added that it was too early for her to judge."}, {"text": "Speaking of South students taking AP tests, Ms. Parrott said, “[Y]ou guys have already been extremely successful without these additional resources so I don’t know if [AP Classroom] is as important as it is for other districts that don’t have the fabulous staff or students that we do.”"}, {"text": "Mr. Foret reflected, “[AP Classroom] might not change whether or not a student will get a 5, but maybe it’s a less stressful path to a 5, which would be great as well.”"}, {"text": "PHOTO BY ISHITA JADON"}], "file_structural_elements": {"title": "New Advanced Placement resources launched nationwide", "date": "November 1, 2019", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "Starting with the 2019 – 20 school year, students taking Advanced Placement (AP) courses now have access to personalized dashboards called My AP on AP Central, the official College Board website for AP.\nAP courses offer high school students the chance to take a college-level course and possibly earn", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/ap-testing-color-900x675.jpg"}}