{"tree_elements": [{"text": "In 2020, New Jersey citizens were plagued by both the coronavirus pandemic and another equally deadly disease: the rise of anti-Asian bias incidents. Because 63 percent of students at South are of Asian, Pacific Islander or Native Hawaiian background this is an issue that concerns our school."}, {"text": "According to the FBI’s Uniform Crime Reporting (UCR) Program, bias incidents, a term often used interchangeably with the term “hate crimes,” are a suspected or confirmed violation of New Jersey’s bias intimidation statute, where a victim is subjected to harassment, assault, threats of terrorism or other specified acts because of race, color, religion, gender, disability, sexual orientation, gender identity or expression, national origin or ethnicity. This definition determines the data in bias incident reports."}, {"text": "From the 2019 and 2020 NJ Bias Incident Reports, 39 anti-Asian bias incidents occurred in 2019 and 68 in 2020 — a 74 percent increase."}, {"text": "The race of victims involved in the bias incidents were similar in pattern. From 2016-18, the number of Asian victims remained relatively consistent in comparison to other races: A total of 18 Asian victims in 2016, 24 in 2017 and even going down to 19 in 2018. However, 2019 saw a surge to 51 Asian victims, which makes for a 425 percent increase from 2018."}, {"text": "One reason for the increase in anti-Asian racism has been the purported origins of the coronavirus pandemic: many Asians and Asian Americans were scrutinized as those responsible for the virus."}, {"text": "Educating students about how to recognize bias and what to do if one experiences bias is an important method to help decrease bias incidents."}, {"text": "“Kids with friends from different backgrounds will see the world in a different light,” said West Windsor Mayor Hemant Marathe. “When kids in kindergarten start to see all kinds of kids in their class, not just kids who look like them, they become more familiar with the concept that people might not look like them. This will prepare them to see the world in a different light.”"}, {"text": "Another equally influential way to prevent bias incidents is to expose students to a diverse curriculum. In this way, students will be able to learn about cultures different from their own, breaking down stereotypes and changing perspectives."}, {"text": "“Perspective is important and we have to recognize that there are multiple perspectives,” said South Principal Dennis Leopold. “We have to realize that a decision or act impacts everyone. ”"}, {"text": "The South community has been introducing new programs such as the Black History Month Webinars and the Pan-Asian American History Month."}, {"text": "Language Arts teacher Paula Tessein said that her class provided windows and mirrors for students to see themselves represented. “You can see yourself in literature and find others. One of my roles as an English teacher is to expose students to different literature as best as we can in a comfortable setting and safe setting,” she said."}, {"text": "South guidance counselor Michelle Walsh recommends that students speak up, act without hate and educate themselves."}, {"text": "Ms. Tessein has similar views: “Here, we have a lot of wonderful opportunities to engage with different cultures. An inclusive climate is a really important first step.”"}, {"text": "Mr. Lepold said, “We have to recognize our community and the members that are part of it, make certain that our practices and structures are more inclusionary. We need to ask ourselves, ‘Do our programs match what we are about?’”"}, {"text": "It is also important to practice patience: change does not occur overnight. Mayor Marathe said, “It’s not a problem that will be solved overnight but if we are constructive and change our behavior, it can happen.”"}, {"text": "Students have also spoken up and taken action, such as senior Emily Woo. She recently finished her senior legacy project, where she made and sold over two hundred ceramic bowls. The profits were donated to Heart of Dinner, an organization buying meals from Asian-owned businesses in New York City’s Chinatown to give to the elderly."}, {"text": "As an Asian American student, Woo believes in making your voice heard. “We’re kind of conditioned to stay quiet about things and try to deal with it on your end,” she said. “Instead, we should be creating change with others, being more vocal, not letting others push your problems aside.”"}, {"text": "Despite the rise in bias incidents, the South community is looking for ways to prevent such incidents. Whether through activism, additions to the curricula and open dialogue, our diverse communities have opportunities to join together to create a more inclusive society."}, {"text": "SPREAD BY TANVI SINGH, KAREN YANG, ALEXANDER XU"}], "file_structural_elements": {"title": "New Jersey Sees a Rise in Anti-Asian Bias Incidents", "date": "June 18, 2021", "writer": {"mmPM0AAOdiQuDZH4MUVF": {"name": "Karen Yang", "year": "2022"}, "": {"name": "Alexander Xu", "year": ""}}, "description": "     In 2020, New Jersey citizens were plagued by both the coronavirus pandemic and another equally deadly disease: the rise of anti-Asian bias incidents. Because 63 percent of students at South are of Asian, Pacific Islander or Native Hawaiian background this is an issue that concerns our school. \n", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/Screenshot_20210621-211007_kindlephoto-533246465-744x900.png"}}