{"tree_elements": [{"text": "Walking through the hallway into the 500s area, you can’t help feeling a sense of liveliness and boundless energy."}, {"text": "Shades of red, green and other striking colors pop out against a white background filled with eye catching, abstract figures painted in bold black lines."}, {"text": "The white walls aren’t South’s standard navajo white, but a more vibrant, stark white. The mural is inspired by a paragon of pop art–Keith Haring."}, {"text": "The mural is the most noticeable change at South and there are others less obvious. Changes this year include a new attendance office, a different school meal program and chromebooks distributed to every grade."}, {"text": "Speaking about the mural in the 500s area, sophomore Jui Khatel, a young student artist, said, “I love the design, it looks like the seniors have worked hard for it. I know how hard it is to put all of this work into one large painting. It has a lot of details, and details take time to perfect.”"}, {"text": "Nathan Leventhal, Computer Art and Design teacher, was one of the teachers involved in the creation of the mural."}, {"text": "“There is definitely a childlike simplicity to it, there are bright colors, and black and white symbols and shapes, and they are rounded and soft,” Mr. Leventhal said. “There is a lot of movement and it’s very chaotic, but we have enough empty space to balance it and the color moves you through it.”"}, {"text": "These vibrant colors and the layout of the painting evoke positive emotions through students walking through that hallway. Sophomore Arpita Padalkar said, “The painting is very creative and the colors are nice. It makes the students feel happy and it puts them into a good mood. Looking at all of the pretty colors helps us destress.”"}, {"text": "This emotional effect on students was just what the painters were going for."}, {"text": "Mr. Leventhal said, “When people go through there, it should be fun. Because there is a lot going on with the characters, they can notice different things each time they go down that hallway. Hopefully it livens up the school a little bit.”"}, {"text": "Mr. Leventhal said,“All murals should carry some sort of feeling that relates to the original art or artists.” He explained who the original artist was for the 500s hallway. “Keith Haring was our inspiration. He was a graffiti artist who specialized in pop art. We took some of his designs and symbols and turned them into pirate themes. He did full installations and we decided to do something more like that. We tried to be true to his style.”"}, {"text": "Commenting on the Haring-inspired mural, junior Mark Sheffield said, “It’s different from any of the other paintings [at South]. The other ones are realistic type paintings but the one in the ESL wing [500s hallway] has a different look. It changes things up.”"}, {"text": "The general look and tone of the Haring-inspired painting is unique and a reflection of the artist’s message."}, {"text": "Mr. Leventhal said, “Haring has a lot of paintings with social messages. He uses a certain set of colors. We added these colors, and we noticed it was a subtle way of giving homage to his LGBT status. He’s a pop culture hero but he’s also a hero for LGBT people.”"}, {"text": "The works of art that have inspired the murals around South, Mr. Leventhal said “help students make connections with things they might not know about and give them a reason to keep learning.” Walking down the 500s hallway, a student naturally wonders, Is this art or is this graffitti?"}, {"text": "“It keeps the legend alive,” Leventhal said of the artists who inspired the murals at South."}, {"text": "The new attendance office, situated where the “jock block” used to be, received a lot of praise."}, {"text": "With the attendance office now outside of the main office, students can check in and out of the school efficiently."}, {"text": "“The location of the attendance office is really helpful. It’s not as crowded [anymore] and students can access it easily,” Khatel said."}, {"text": "Padalkar added, “Now that we get a new room for attendance, we don’t really have to stress out about attendance. Just walk in and you’re good to go!”"}, {"text": "Not far from the new office, students line up during lunch for a taste of Taste 4, a program launched by Sodexo, South’s new food service. “The food has gotten better this year,” said Sheffield."}, {"text": "Additionally, South issued chromebooks for students in every grade, including this years’ seniors.\nSheffield said, “Chromebooks make it easier for us to do work, and it makes it easier for teachers to be able to post tests and study guides online.” He added that chromebooks lighten the weight of student backpacks, too."}, {"text": "What other changes would students like to see at South? Padalkar suggested, “More artwork around the school would be nice, and more colors as well.”"}], "file_structural_elements": {"title": "New school year brings positive changes to South environment", "date": "November 1, 2019", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "Walking through the hallway into the 500s area, you can’t help feeling a sense of liveliness and boundless energy.\nShades of red, green and other striking colors pop out against a white background filled with eye catching, abstract figures painted in bold black lines.\nThe white walls aren’t South’s ", "image": null}}