{"tree_elements": [{"text": "Q: How are November elections relevant to high schoolers?"}, {"text": "A: I think that a lot of time and energy gets spent looking at what’s taking place nationally. What happens in a state legislature, the law-making branch, can often affect our lives even more directly."}, {"text": "Q: Do you have any examples of how these legislatures could affect us more directly?"}, {"text": "A: It’s my understanding that state governments and local governments expend the majority of education funds in the country. The federal (national) government plays a role, but it doesn’t always play the biggest role."}, {"text": "Q: Virginia’s Democratic party gained control of the state legislature. How do you think this could affect future policies in that state?"}, {"text": "A: I think it’ll be really interesting to watch what happens in Virginia with the ratification of the Equal Rights Amendment (ERA). It looks like it could be revived because of the election in Virginia."}, {"text": "Q: For a bit of background for our readers, the ERA was introduced in 1922. According to equalrightsamendment.org, the amendment states that “equality of rights under the law shall not be denied or abridged by the United States or by any state on account of sex.” This would make discrimination based on sex against the law. Right now, the amendment has been ratified by 37 states, including New Jersey. One more state needs to ratify the amendment before it is incorporated into the United States Constitution, becoming national law.\nI wanted to ask you a question on a different topic. Do you think that split legislatures hinders a healthy democracy?"}, {"text": "A: I don’t think that split legislatures are necessarily a bad thing. In my ideal world, divided government is not a logjam. It’s an opportunity. Politics should be a conversation. When two sides with somewhat opposing views converse about a certain topic, that can lead to a better solution. When I worked in state legislature there wasn’t enough conversation. Staffers didn’t talk across the aisle and each side used to demonize the other. The minority party would complain about getting left out of the legislative process and then do the very same stuff once it became the majority. That didn’t make for a great dialogue and I think it undermined policy in the end."}, {"text": "Q: How do you think new members taking seats in the House of Delegates of New Jersey will affect future policies and dynamics between members?"}, {"text": "A: What young people are telling elected officials right now is that they’re really worried about what’s taking place with the environment. My hope is that, regardless of which party gets into office, they listen to the concerns of young people and enact policies that protect the environment and hopefully forestall climate change."}, {"text": "Q: What can high schoolers do to be more politically aware and affect what’s happening in the state government?"}, {"text": "A: There’s this notion that because many high schoolers can’t vote, they don’t have a voice, and that’s a fatalistic attitude. Legislative offices oftentimes rely on hearing from all residents, not just the ones that are over eighteen. Letters matter, calls matter, and advocacy matters. High school is a wonderful place to gather together with like-minded individuals and make your case. My hope is that, as voters, we think about state issues when we go to the polls and that, as consumers of the news, we stay focused on what happens in the state capital once the elections are over."}], "file_structural_elements": {"title": "November Election Q&A with Mr. Levinson", "date": "December 20, 2019", "writer": {"SbITCtXVmWYkqTpn6l43": {"name": "Eugenia Ma", "year": "2019"}}, "description": "Q: How are November elections relevant to high schoolers?\nA: I think that a lot of time and energy gets spent looking at what’s taking place nationally. What happens in a state legislature, the law-making branch, can often affect our lives even more directly.\nQ: Do you have any examples of how these", "image": null}}