{"tree_elements": [{"text": "*link to='https://coronavirus.jhu.edu/map.html'*Johns Hopkins University and Medicine*/link*"}, {"text": "Plague, a disease caused by the bacterium Yersinia pestis, was the deadliest pandemic resulting in more than 30 million deaths during its first outbreak in 541 A.D, according to a National Geographic article by Kher Than. Bubonic plague spread through the Middle East and Europe and was characterized by swollen lymph nodes, called buboes, giving the disease its name. After the outbreak in 1346, quarantine came into practice."}, {"text": "*link to='https://www.bbc.com/travel/story/20200421-dubrovnik-the-medieval-city-designed-around-quarantine'*Kristin Vuković*/link*"}, {"text": "The people of Ragusa understood that asymptomatic people had to be isolated to ensure that sailors and traders are disinfected and do not have the disease. In addition to being a medical landmark, the practice of quarantine calmed the fear and panic induced by a pandemic."}, {"text": "*link to='https://www.washingtonpost.com/world/2020/03/17/coronavirus-latest-news/'*emergence of the coronavirus in all 50 states*/link*"}, {"text": "The influenza pandemic of 1918, also known as the Spanish flu, infected about one-third of the global population. This pandemic was unusual because there was a high mortality rate among young, healthy people."}, {"text": "*link to='https://www.cdc.gov/flu/pandemic-resources/reconstruction-1918-virus.html'*CDC*/link*"}, {"text": "“If populations were more isolated, it certainly would be tougher for the disease to spread,” said biology teacher Matt Foret."}, {"text": "Following stay-at-home guidelines and testing are the best ways of containing the spread of the coronavirus."}, {"text": "*link to='https://www.nationalgeographic.com/science/health-and-human-body/human-diseases/smallpox/'*National Geographic*/link*"}, {"text": "The road to finding a cure for smallpox was one of trial and error."}, {"text": "*link to='https://www.nlm.nih.gov/exhibition/smallpox/sp_variolation.html#:~:text=Variolation%20was%20never%20risk%2Dfree,could%20spread%2C%20causing%20an%20epidemic.'*U.S. National Library of Medicine*/link*"}, {"text": "*link to='https://pubmed.ncbi.nlm.nih.gov/27483574/'*National Center for Biotechnology Information*/link*"}, {"text": "Fortunately, a safer method was invented in 1796 by Edward Jenner."}, {"text": "Edward Jenner injected a boy with cowpox pus. Cowpox is a disease that affects cows. The cowpox virus is related to the variola virus. After exposing the boy to smallpox, he found that the boy was immune to smallpox because of exposure to cowpox. This was the first vaccine."}, {"text": "The smallpox vaccine laid the groundwork for the development of other vaccines. In fact, the word vaccine comes from “vacca,” meaning cow in Latin."}, {"text": "Scientists are currently working toward making the coronavirus vaccine."}, {"text": "*link to='https://www.historyofvaccines.org/content/articles/vaccine-development-testing-and-regulation'*The History of Vaccines*/link*"}, {"text": "We should remember that humanity has survived many pandemics and we will get through this one."}], "file_structural_elements": {"title": "Pandemics in the past", "date": "June 23, 2020", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     There are 9.2 million positive cases of the coronavirus worldwide, according to Johns Hopkins University and Medicine. The way we are handling the coronavirus today is directly influenced by how we dealt with pandemics of the past: plague, Spanish flu and smallpox pandemics.\nPlague — First Use ", "image": null}}