{"tree_elements": [{"text": "Holding the position of Principal at South for nine years and guiding WW-P schools for many more, Mr. Lepold will retire at the end of the school year and pass the torch to Jessica Cincotta, an Assistant Principal at North. Here, Mr. Lepold reflects on his years at South."}, {"text": ""}, {"text": "What role did you occupy before you became Principal of South?"}, {"text": "I was a Language Arts teacher at South from 2000-03.  I moved to Grover and wasAssistant Principal from 2003-07 and then Principal at GMS from 2007-12.  The last nine years I’ve been Principal of South."}, {"text": ""}, {"text": "How do you think the school has changed since your first year here?"}, {"text": "We have added the new theater, new gym and new music and art rooms. The demographics have changed greatly with a much larger Asian American and Pacific Islander population than when I arrived in 2000. Also, we have changed the daily schedule twice, eliminated mid-term and final exams. Finally, our school district has tried to focus on social and emotional learning as well as addressing issues regarding equity and inclusivity. We want our school and our district to be one that makes our students feel good about learning and included."}, {"text": ""}, {"text": "How do you think the students have changed since your first year here?"}, {"text": "Students have changed with the technological advancements. They are not as present with each other and less likely to come to evening events than when I first started at South. I say this knowing that we have an incredible amount of school spirit and just lived through a pandemic but I hope students will put down their phones and be present physically and mentally at school when they return in the fall and take advantage of attending the evening events at the school."}, {"text": ""}, {"text": "What are your most memorable moments during your time at South?"}, {"text": "I have so many memorable moments from enjoying concerts, tours, musical performances and athletic events. I enjoyed watching students grow and mature into young adults and I especially love visiting classes and talking with students in the hallways and at lunch. I would have to say making the decision to take the seniors to Florida by bus to save the senior trip from a snowstorm will be one of my favorite memories at South."}, {"text": ""}, {"text": "What is/would be your last message to the South students?"}, {"text": "Put down your phones, stop worrying about social media and be present in the moment with your friends, family, and teachers. We have spent enough time on a screen and away from each other the last 15 months.  Also, be more patient with each other and treat each other with more kindness."}, {"text": ""}, {"text": "Is there anything you would like to add?"}, {"text": "I had the best job at the best school and I will miss so many of the events and people, but I will miss the students the most."}, {"text": ""}, {"text": "PHOTO COURTESY OF WW-P SCHOOLS YOUTUBE CHANNEL"}], "file_structural_elements": {"title": "Passing on the torch: Mr. Lepold retires", "date": "June 18, 2021", "writer": {"jDWiWuTI7F9KAJjATiXf": {"name": "Daniel Wu", "year": "2021"}, "BY2v1lYi6QIU4XeyEcp2": {"name": "Abram Chen", "year": "2020"}}, "description": "     Holding the position of Principal at South for nine years and guiding WW-P schools for many more, Mr. Lepold will retire at the end of the school year and pass the torch to Jessica Cincotta, an Assistant Principal at North. Here, Mr. Lepold reflects on his years at South.\n \n     What role did y", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/image1-900x512.png"}}