{"tree_elements": [{"text": "To deter students from being absent for sub study and study hall, the administration adopted new attendance guidelines last November. Morning announcements throughout that month informed students about the updated procedures and the importance of attending class."}, {"text": "According to Attendance Office Secretary Jeanette Hanos, emails are sent out every day to parents and students notifying them of any absences. The school administration hopes this will encourage students to be aware of their absences and avoid them in the future."}, {"text": "Showing up late to class is not taken lightly. Three tardies in a class equals an unexcused absence, and students need 90 percent attendance for the class to count towards high school credits and grades."}, {"text": "The sign-in system can have technical issues. For example, if a student has multiple classes requiring them to sign in, then sometimes they may sign themselves out of a previous class instead of into their current class. Other times, a student may attend but forget to sign in."}, {"text": "Ms. Hanos says that students can rectify errors with her if they have a note from their proctor."}, {"text": "To senior Gracen Tate, the administration’s response at first seemed stringent, but she realized the rules were only helping prepare students to be good citizens."}, {"text": "“They help you be responsible for time and also to be mature,” said Tate."}, {"text": "But errors are not the only reason for the new policies. Study hall proctor Christopher Lane has noticed students walking around when they’re supposed to be in class."}, {"text": "“We don’t know where people are going,” Lane said. “That can be a security and a safety issue. We need to know where the students are at any given time.”"}, {"text": "Lane believes students aren’t aware they are not allowed to go between classes without a pass from a teacher and checking in with their proctor first."}, {"text": "On the other hand, Tate and freshman Shreyas Nidumbur think students leave class because they are visiting friends in other places and have no work to do. However, Tate thinks the impact absences have on grades and school records is enough deterrence. Nidumbur believes the extra restrictions are making it harder to leave class, especially with the requirement of a pass."}, {"text": "“There are people who are monitoring students going outside of study hall and seeing whether they have a pass,” said Nidumbur. “And overall, I’ve been seeing a lot more strict rules surrounding study hall and sub study.”"}, {"text": "One reason why students are walking around between classes may be because proctors are limited in their ability to enforce attendance. Mr. Lane says he can only mark students as absent or cutting class."}, {"text": "There will always be those few students who find a way to sneak out. As freshman Prajwal Bhat said, “The more people put measures to stop people from doing something, the more creative people become.”"}, {"text": "But the new rules have had a noticeable effect. “I see less absences in most classes,” Ms. Hanos said."}, {"text": "In the end, the best thing for students to do is to remember to sign in, always ask teachers for a pass, and double-check attendance records on Genesis."}], "file_structural_elements": {"title": "Pirates missing from their ships: students absent during study hall", "date": "January 19, 2022", "writer": {"jDWiWuTI7F9KAJjATiXf": {"name": "Daniel Wu", "year": "2021"}}, "description": "To deter students from being absent for sub study and study hall, the administration adopted new attendance guidelines last November. Morning announcements throughout that month informed students about the updated procedures and the importance of attending class.\nAccording to Attendance Office Secre", "image": "https://thepirateseye.org/wp-content/uploads/2022/01/Study-hall-picture-1-900x838.png"}}