{"tree_elements": [{"text": "On Jan. 20, 2021, the United States saw the inauguration of its 46th president, Joseph R. Biden Jr.. On this historically significant day, Kamala D. Harris was also sworn in as the country’s first female vice president, the first African American and the first South Asian American to assume this position."}, {"text": "“I was especially struck by the diversity of the crowd and I felt very proud and happy that a woman was being sworn in as vice president,” said Advanced Placement Government teacher Erin Schomburg."}, {"text": "While presidential inaugurations have been occurring since 1789, this inauguration was unique in several ways."}, {"text": "Among the most obvious differences were the restrictions and social-distancing guidelines due to the COVID-19 pandemic. Senior Adithya Sundar said, “Everyone was wearing masks and there was even one person constantly wiping the podium.”"}, {"text": "In addition to these adjustments due to the pandemic, senior Varshini Vimal said, “President Trump was not present at the inauguration which was really shocking.” According to the White House Historical Association, President Woodrow Wilson was the last president who did not attend his successor’s inauguration event in 1921, as he was signing legislation documents during the ceremony."}, {"text": "Despite these unusual circumstances, the inauguration had a hopeful tone that embodied President Biden’s promise to promote unity in a seemingly divided nation. “To restore the soul and to secure the future of America requires more than words,” said President Biden. “It requires the most elusive of things in democracy: unity.”"}, {"text": "The country’s first Youth Poet Laureate, 22-year-old Amanda Gorman, furthered this message. In her piece, “The Hill We Climb,” she spoke of America’s challenges, as well as the potential to overcome them."}, {"text": "Later that night, the presidential inauguration celebration, “Celebrating America,” was broadcast across the nation. Hosted by Tom Hanks, it featured musical performances from artists such as Bruce Springsteen, Jon Bon Jovi, Demi Lovato and John Legend, among others. The event also highlighted inspiring stories about American citizens who had shown resilience and selflessness amid the hardships of the pandemic."}, {"text": "Most notable was the message from former presidents Bill Clinton, George W. Bush and Barack Obama. They expressed their support for the nation’s new leaders and their hopes for a more unified America. “"}, {"text": "As Americans, we have more in common than what separates us,” said Obama."}, {"text": "The next day, President Biden signed an executive order to rejoin America in the Paris Agreement on climate change; President Trump had withdrawn in 2017."}, {"text": "He also reversed restrictions on U.S. entry from seven primarily Muslim countries and strengthened the Deferred Action for Childhood Arrivals (DACA) program, which protects undocumented immigrants and immigrants who came to the U.S. as children, from deportation."}, {"text": "Furthermore, President Biden focused heavily on plans to combat the spread of COVID-19. He established a Health Equity Task Force to certify that the response and recovery efforts during the pandemic are appropriately accessible to all Americans. He also created a Pandemic Testing Board to expand national testing."}, {"text": "Vice President Harris has also been busy since inauguration day. After the Senate split the vote of an instrumental budget bill across party lines with all 50 Democrats supporting the bill and 49 Republicans opposing it (one Senate Republican was unable to attend the vote due to weather conditions), Vice President Harris voted to break the tie and advance the budget bill on Feb. 5, which was promptly approved by the House on the same day."}, {"text": "The passage of this budget bill gave Democrats leverage when trying to pass President Biden’s proposed 1.9 trillion dollar stimulus package, which includes funds for COVID-19 vaccinations."}, {"text": "On Feb. 27, it was approved by the House of Representatives, then by the Senate on March 6. The bill is scheduled to return to the House on March 9 for final approval."}, {"text": "To address immigration, President Biden signed executive orders to reunite families separated at the southern border and end the construction of the border wall. He also signed a memo to give LGBTQ+ refugees equal protections in the U.S."}, {"text": "“Biden is really focusing on the idea of equality and making sure everyone is treated the same,” said Vimal."}, {"text": "Furthermore, in efforts to combat inequity, he signed executive orders to reverse the ban on transgender people joining the military and to prevent discrimination based on sexual orientation and gender identity in the workplace."}, {"text": "Addressing racial inequality, President Biden signed an executive order to overturn the 1776 Commission, a initiative created by the Trump administration to refute the need for a more accurate history curriculum to teach slavery in schools."}, {"text": "In the months ahead, there are several issues that the new White House administration is set to address. Ms. Schomburg, Vimal and Sundar agreed that they will be paying attention to President Biden’s response to COVID-19 and vaccine distribution. They hope to see progress that will signify rapid, meaningful change."}, {"text": "Ms. Schomburg said, “Biden’s administration faces a world of challenges.” She is optimistic about the future of the country."}, {"text": ""}, {"text": "Image by Elise Ko-Davis"}], "file_structural_elements": {"title": "President Biden’s inauguration and policies so far", "date": "April 21, 2021", "writer": {"ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}}, "description": "     On Jan. 20, 2021, the United States saw the inauguration of its 46th president, Joseph R. Biden Jr.. On this historically significant day, Kamala D. Harris was also sworn in as the country’s first female vice president, the first African American and the first South Asian American to assume thi", "image": "https://thepirateseye.org/wp-content/uploads/2021/04/Screen-Shot-2021-04-21-at-10.17.23-AM-900x592.png"}}