{"tree_elements": [{"text": "On Jan. 3, in a predawn air attack at Iraq’s air terminal in Baghdad, the U.S. struck and assassinated Qassem Soleimani, the leader of Iran’s revolutionary guard force known as the Quds Force, and Abu Mahdi al-Muhandis, the agent officer of Iran-upheld civilian armies known as the Popular Mobilization Forces (PMF). This news startled everyone at the beginning of the new year, but what has happened since then? On Jan. 27, I had the opportunity to sit down with Walter Conner, American Studies I teacher and former United States Marine Corps colonel, to discuss the conflict."}, {"text": "What is happening right now between Iran and the United States?"}, {"text": "Right now there’s tension between the United States and Iran. I’d like to say it’s coming down but I was just looking at a news report from today [Jan. 27] saying that there were some rockets that hit the U.S. embassy in Baghdad, so I would say that there’s severe tension right now between the United States and Iran, over the assassination of Soleimani."}, {"text": "What is the United States’ political relationship to Iran like?"}, {"text": "Iran has a big influence on Iraq, and the United States has some real problems with Iran. I was looking over the current president’s Secretary of State’s letter on this. It says that the United States under President Trump has laid out some ideas on this, and it looks at Iran as a terrorist country. The reason why is because the president has said that normal countries don’t attack embassies. They don’t fuel terrorist proxies and it goes on and on."}, {"text": "Is there an event in particular that sparked this bad relationship?"}, {"text": "It goes back to 1979-80 when our embassy was taken over by Iran in Baghdad. We actually had a marine who was a guard in the embassy – I happened to know him because I was a reserve – he talked about the actual takeover of the embassy. Ever since then, it’s been pretty much downhill in terms of our relationship with them. We’ve broken off diplomatic relations with them and treat them as a terrorist state. That’s pretty much where we are right now."}, {"text": "What is Ukraine’s involvement in the situation?"}, {"text": "The Iranians accidentally shot down a Ukranian plane right after they shot some missiles at us after the U.S. assassinated Soleimani. Minutes after taking off from Tehran airport in Iran, the plane was shot down. It had Canadian citizens on board. The whole incident of the Ukrainians and how they relate to the United States and how they relate to Iran and other states really comes to play. Ukrainian officials are also skeptical of us. Some of that has to do with the impeachment that’s going on and Ukraine’s involvement in that. We don’t look at Ukraine as a completely trustworthy partner yet and the Ukranians treat the Iranians as if they don’t fully trust them because they’re a strong ally of Russia, which is still at war with Ukraine."}, {"text": "Do you think the situation between the two countries has de-escalated?"}, {"text": "To be honest, it’s hard to say what’s going to happen right now. Only time will tell."}], "file_structural_elements": {"title": "Q&A with Mr. Conner: Conflict in Iran", "date": "February 13, 2020", "writer": {"LpDIeLwdu280NdPILdWj": {"name": "Ashna Garikapati", "year": "2020"}}, "description": "On Jan. 3, in a predawn air attack at Iraq’s air terminal in Baghdad, the U.S. struck and assassinated Qassem Soleimani, the leader of Iran’s revolutionary guard force known as the Quds Force, and Abu Mahdi al-Muhandis, the agent officer of Iran-upheld civilian armies known as the Popular Mobilizati", "image": null}}