{"tree_elements": [{"text": "The Chernobyl reactor meltdown in Ukraine occurred 36 years ago on April 26, 1986, marking one of the most destructive nuclear disasters in history. The stories of people who lived through that history are essential to remembering what occurred there, especially as people are looking at Ukraine again in its most recent war with Russia."}, {"text": "One such person that lived through the 1986 disaster is Mr. Aleksandr Gamarnik, an instructional assistant at South. He lived in Kyiv, Ukraine during the explosion and its after-math. Stories like his are vital to remembering that events in history touch the lives of real people, past and present. In my interview with him, he recounts how his life has been marked by the 1986 tragedy."}, {"text": "Where were you when the meltdown occurred?"}, {"text": "I am originally from Kyiv, Ukraine. On April 26, when the Chernobyl tragedy happened, our apartment building in one of the neighborhoods of Kyiv was located between 80 to 100 miles from the Chernobyl reactor. I was a teacher at the time, working in a big public school."}, {"text": "How were you affected?"}, {"text": "When this happened, my kids were young–my oldest was two years old and my youngest was nine months. Because I was working in the public school, I couldn’t go anywhere, but I had to take care of my family. I asked my father and he he helped get plane tickets for my wife, kids and my wife’s younger sister, and in a couple days they flew from Kiev to Tashkent, the capital of Uzbekistan. They stayed in Uzbekistan for four months."}, {"text": "What were some wider effects of the tragedy in your life?"}, {"text": "When I worked in the school in September, we had approximately 250 students from Chernobyl and Pripyat who were evacuated. The majority of them were in the school where I worked so I can tell you, I know exactly from the time this happened until the time I emigrated, we had at least 10 casualties from leukemia."}, {"text": "What was the official response to the disaster?"}, {"text": "We didn’t know what happened until April 30 when the Minister of Health of Ukraine made a speech on national television explaining to the population what happened. He didn’t get into the details on what happened exactly to the Chernobyl reactor but he recommended precautions. One of the recommendations was that every time you came home, you had to wash your shoes, your clothes, clean your windows and everything had to be closed so no fresh air could come in. But instead of calming down the population, this recommendation the opposite effect."}, {"text": "How did civilians respond?"}, {"text": "At this time, nobody knew what radiation was. You cannot smell, you cannot feel, you cannot see it. So people were afraid and scared. Most people were panicked. People started leaving the city from every possible way. And when the Minister said it was scientifically proven that a couple drops of iodine could reduce the level of radiation, all the iodine disappeared from the pharmacies in the next two days and you could only find it in the black markets."}, {"text": "How is the Chernobyl disaster remembered?"}, {"text": "Two years after the disaster, the Ukrainian government built a city called Slavutych. In the center of the city, they have a memorial. A circle with a black bell in the middle dedicated to the life of the firefighters who died during this explosion. Every hour, this bell would make a sound. And it didn’t matter what time. Every hour it would make a sound, just in the memory of those firefighters."}, {"text": ""}], "file_structural_elements": {"title": "Remembering Chernobyl", "date": "June 24, 2022", "writer": {"jDWiWuTI7F9KAJjATiXf": {"name": "Daniel Wu", "year": "2021"}}, "description": "The Chernobyl reactor meltdown in Ukraine occurred 36 years ago on April 26, 1986, marking one of the most destructive nuclear disasters in history. The stories of people who lived through that history are essential to remembering what occurred there, especially as people are looking at Ukraine agai", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/Screen-Shot-2022-06-24-at-5.54.46-PM.png"}}