{"tree_elements": [{"text": "SAT test takers across the United States were in an uproar after the August test. The College Board, a non-profit organization that distributes standardized testing for college applications, was accused of allegedly re-using an international reading passage on the summer test."}, {"text": "According to USA Today, ABC News and other news sources, one of the reading passages was given in the October 2017 test in Asia. Images of the October multiple choice reading test from last year were released on the internet, and people confirmed that the same passage was used twice."}, {"text": "Parents and test takers argued that those who used that test to practice, or had taken the actual test in August last year, were at a significant advantage compared to those who went in without prior knowledge. One father from Florida filed a lawsuit against the College Board, infuriated by the idea that some students were given “a leg-up” on the test, while test takers like his daughter went in without any previous knowledge.."}, {"text": "This father’s opinion reflects those of some students at South. Senior Sohan Pramanik recently took the August SAT, and although he believed it was not very difficult, he still thinks that those who saw the passage beforehand had an advantage."}, {"text": "Even so, Pramanik said that the number of people “who actually saw the test before was very low,” and so, the impact was not as great as people assumed."}, {"text": "On the other hand, junior Claire Huang said that re-doing a test, or just reading a passage beforehand, does affect someone’s score. “I’ve retaken practice tests before and I’ve always done better the second time I took it,” she said. As for its influence on how students scored on the October SAT, she believes that the College Board should “definitely be more careful about how they monitor which tests they’re giving out”."}, {"text": "The College Board refused to disclose information on the matter of reusing test passages, but they did announce that the SAT scores would not be canceled, meaning that those who were satisfied with the August score need not take it again."}, {"text": "Junior Serena Wang had a different perspective about the test mistakes. “I’m not actually too upset,” she said. “Even if someone were to try cheating, they would be unable to because the answers were not the same.”"}, {"text": "Many people are concerned about how this will affect the curve of the October SAT. The October test has reportedly had a more difficult curve in comparison to other tests because many people take it, especially high school seniors who are looking to fit in one last test before college application deadlines."}, {"text": "The College Board has been under increasing pressure lately because of previous mistakes as well. The June SAT faced serious backlash when parents and students claimed that the test was too easy, subsequently resulting in a greater number of people who achieved perfect scores."}, {"text": "To rectify this situation, the College Board implemented a curve, where students who got a question or two wrong could have thirty to eighty points subtracted from their score."}, {"text": "There was speculation on whether or not the College Board will make the curve more difficult this time in light of previous testing. Wang said that because the College Board “messed up in August and a little bit in June, they might.” And it turns out that her prediction was correct."}, {"text": "When the October test scores were released on Oct. 19, there was another backlash. The curve was different than predicted. One anonymous test taker explained that compared to his August score, he got 11 more questions correct, and yet his score was lower by 20 points."}, {"text": "Despite this, some people still did remarkably well. This is most likely a result of how “easy” some test takers, such as Junior Rashi Agarwal, claimed it was. After the test, she reported that she had “a good feeling about it” and that “it was easier than [she] expected.”"}, {"text": "College Board has been criticized many times in the past few months, mainly about the SAT. There is concern about how this will affect the November test, but once again, no one can make predictions."}, {"text": "College Board has not released an official answer to the complaints sent to them. For those who took the October test, it seems there is little to do but accept the score, and for some people, wait for November."}, {"text": "PHOTO COURTESY: GAURI NEMA"}], "file_structural_elements": {"title": "Seeing double: College Board faces backlash for reused reading passages in August SAT", "date": "November 14, 2018", "writer": {"SbITCtXVmWYkqTpn6l43": {"name": "Eugenia Ma", "year": "2019"}}, "description": "     SAT test takers across the United States were in an uproar after the August test. The College Board, a non-profit organization that distributes standardized testing for college applications, was accused of allegedly re-using an international reading passage on the summer test.\n     According to", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/sat-pic-900x632.jpg"}}