{"tree_elements": [{"text": "The students finish the last few moves of the dance, looking at the leader, senior Annabel Azaro. After the song finishes, the out-of-breath participants smile, applaud each other and give high-fives."}, {"text": "Azaro has taken the initiative to teach zumba lessons in her gym class as a way to spice up the routine of gym class."}, {"text": "Whether or not you consider dancing a sport, you can’t deny the workout you get from zumba. Zumba is an exercise fitness program created by a Colombian dancer Alberto Perez, that combines a series of dance moves and aerobic movements."}, {"text": "*link to='https://time.com/4696746/zumba-workout-dance-aerobics/'*Time Magazine*/link*"}, {"text": "“In one word, Zumba is a party,” Azaro said. “It’s so fun and energetic and you are getting a great workout without even realizing it.”"}, {"text": "Azaro appreciates that zumba is universal. “Zumba is…for everyone. It is a judgement-free zone where people go to have fun and exercise.”"}, {"text": "Azaro continued, “The class goes by super quickly and by the end you are drenched, but leave with a huge smile on your face.”"}, {"text": "Whether you are athletic or not, you can get a workout with zumba while enjoying yourself, which makes it fun for everyone and something to do with friends. “Zumba has given me a lot of confidence and great new dance moves,” Azaro said."}, {"text": "Azaro has been taking zumba classes with her mom.  Last month she became certified as a zumba instructor. “It was a full day of training and now I can officially teach Zumba classes,” Azaro said. “I have access to all the songs and choreography they have with the Zumba Instructor Network member program.” Through the program she gets monthly support and tools to teach Zumba."}, {"text": "*link to='https://time.com/4696746/zumba-workout-dance-aerobics/'*Time Magazine*/link*"}, {"text": "Zumba may not be the way to gain muscle mass or major weight loss, but it is a fun way to stay active. Azaro said, “Zumba is something you can find at almost every gym or even something you can create on your own for fun.”"}, {"text": "She said,“Gym classes should definitely try to be more inclusive and add in Zumba into the curriculum.” “It’s important for gym classes to give people resources of ways they can work out in college and when they are older… [and] zumba is a great workout and something that you can do for the rest of your life.”"}], "file_structural_elements": {"title": "Senior Annabel Azaro leads Zumba lessons in gym class", "date": "May 21, 2019", "writer": {"fvlskYg2CQHL59ccUZY2": {"name": "Ria Patel", "year": "2018"}}, "description": "     The students finish the last few moves of the dance, looking at the leader, senior Annabel Azaro. After the song finishes, the out-of-breath participants smile, applaud each other and give high-fives. \n     Azaro has taken the initiative to teach zumba lessons in her gym class as a way to spice", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/zumba2color-900x302.jpg"}}