{"tree_elements": [{"text": "Imagine you’re driving along the road near Quakerbridge Mall with an empty stomach. All you can think of is a burger, some crinkle-cut cheese fries and a nutritious shake. The place you’re looking for is Shake Shack, a newly opened restaurant in Princeton. The food served at Shake Shack will make you feel like you’re in heaven, surrounded by a fresh, enticing atmosphere and delicious food."}, {"text": "The history of Shake Shack is as interesting as its food. The restaurant was founded by Daniel Meyer in 2004 in New York, N.Y., but Randy Garutti has held the position of CEO since 2012. Here’s the interesting part: the name “Shake Shack” came from an amusement park ride in the final scene of Grease."}, {"text": "Luckily for South students, Shake Shack is only ten minutes from school, making it a convenient option for lunch-goers. The cost of the meals fit a senior’s budget, and according to senior Simran Salem, there are plenty of options for those who may be vegetarian or have specific eating preferences.\nSalem added, “Depending on obviously my budget during that time, it’s very ideal to go to Shake Shack because I could get a good amount of food for a reasonable price.” She also added, “A lot of people go there for their shakes.”"}, {"text": "It’s not hard to understand why when Shake Shack offers such a variety of shakes.\n“We have our new holiday and seasonal shakes, which are amazing,” said Shake Shack employee Xcceria Bland. “There are a lot more options here, and it’s a lot more diverse to our customers.”"}, {"text": "During my visit, I ordered a Chick’n Shack (crispy chicken with lettuce and tomatoes), cheese fries, a Shroom Burger (a mushroom burger with pickles and buttermilk herb mayo), a Strawberry Shake and a small lemonade. The chicken was crispy and filling. The cheese fries melted in my mouth. The Strawberry Shake was creamy, thick and tasted like ice cream — although it was difficult to drink with a straw because of its thickness. To solve that, I used a spoon instead."}, {"text": "The meal made my day."}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Shake Shack: A new hot spot", "date": "February 13, 2020", "writer": {"qwSEbaCBnPbIwsO0WXu3": {"name": "Prisha Priyadarshini", "year": "2022"}}, "description": "Imagine you’re driving along the road near Quakerbridge Mall with an empty stomach. All you can think of is a burger, some crinkle-cut cheese fries and a nutritious shake. The place you’re looking for is Shake Shack, a newly opened restaurant in Princeton. The food served at Shake Shack will make yo", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/Shake-Shack-900x876.jpg"}}