{"tree_elements": [{"text": "A shooting at The Mills at Jersey Gardens mall in New Jersey occurred on Black Friday, Nov. 23. One man was injured, and the gunman remained at large until he was found dead on Nov. 30. This is one of the 340 mass shootings that occurred in 2018 according to the Gun Violence Archive."}, {"text": "During the shooting, a man was shot in the wrist and no one else was injured, immediately afterwards, the mall was quickly evacuated by police force, opening a day after the shooting with increased security."}, {"text": "Violent occurrences are becoming more common on Black Friday. Retail violence on holiday events such as this one have increased by thirty percent from data from the Washington Post. Twenty-seven percent of violent Black Friday incidents in 2017 were shootings according to statistics found by reviews.org. It is becoming more dangerous to shop on costumer heavy days where many people are trying to get the latest deals."}, {"text": "Following the shooting at Jersey Gardens, there has been speculation about what caused the open firing. Some people believe that it may have been the result of a dispute or altercation between two shoppers who wanted to get hold of an item. More specific details are unknown."}, {"text": "“It might have been a misfire.” said junior Patrick Liang when asked about his thoughts on the cause of the shooting."}, {"text": "Put into perspective of 2018, the Jersey Gardens shooting is not a very major event, with 340 mass shootings in total. Some of the most notable ones include the shooting on February 14 at Marjory Stoneman Douglas high school in Florida where 17 students were killed. This mass shooting sparked the student run Never Again movement, an anti-gun movement that influenced many student opinions and actions."}, {"text": "Eleven people were killed at the Tree of Life Synagogue in an anti-semitic hate crime. Ten students were killed on May 18 in Sante Fe high school in Texas."}, {"text": "Phoebe Elias is a Jewish student at South who felt a personal connection to the Tree of Synagogue shooting. “It feels like anyone who is a Jew is your family or…in some way connected to you,” she said. “It saddened me that people are attacking (others) because of a certain religion, and that’s the only motive really behind it.”"}, {"text": "Compared to 2017, the number of mass shootings have decreased by approximately two percent. However, the number of shootings (346), is large enough that it averages to almost one every day of the year."}, {"text": "According to junior David Mothy, this is only a reminder of how serious the situation about gun violence is. Responding to the data on the number of shootings in 2018, he said, “That’s a far larger number than I thought. It’s definitely time that we invoke change as a society.”"}], "file_structural_elements": {"title": "Shooting at Jersey Garden Mall", "date": "January 23, 2019", "writer": {"SbITCtXVmWYkqTpn6l43": {"name": "Eugenia Ma", "year": "2019"}}, "description": "     A shooting at The Mills at Jersey Gardens mall in New Jersey occurred on Black Friday, Nov. 23. One man was injured, and the gunman remained at large until he was found dead on Nov. 30. This is one of the 340 mass shootings that occurred in 2018 according to the Gun Violence Archive. \n      Dur", "image": null}}