{"tree_elements": [{"text": "The holidays are a time to spread cheer and celebrate as a community. At South, we have have the opportunity to help others in our community and make their holidays more joyous."}, {"text": "From December 5 to December 20, South held its annual holiday drive. The club Pirates Against Hunger helped organize the drive with gym teachers Ms. Fitzpatrick and Ms. Hayden leading."}, {"text": "Not only were packaged foods, toys, gift cards, money and more collected, but also all the money donated was matched by an anonymous donor.  The donations will be distributed throughout the West Windsor community."}, {"text": "“We don’t realize how many students and families even in our area [are in need of assistance],” South faculty member Ms. Hanos explained.  She said any family could find themselves in need of an extra hand."}, {"text": "All donations will be distributed among  a number of organizations South Pirate families in need, PEI (Prevention, Education, Intervention) Kids, Howard’s Healthy Choices, and Project Pride. Each organization has its specific focus and goal."}, {"text": "PEI Kids is an organization that helps children, caregivers, and advocacy groups in the Mercer County area to prevent domestic abuse and promote the overall well-being of children."}, {"text": "Howard’s Healthy Choices works in the Trenton area in order to promote making healthy eating choices, positive social interaction, and the well-being of children."}, {"text": "Project Pride is a peer connection between South and Grover students to build self-esteem and mental health."}, {"text": "Bringing in one item may seem insignificant, but any contribution can help brighten another’s holiday season."}, {"text": "Speaking of the holiday season, senior Bridget Holleran, who helpeding with the drive, said,“Although it’s the most wonderful time of the year, a lot of our community has a difficult time.” She added, “That’s where we come in. It’s a great reminder that the smallest gesture can make a huge difference.”"}, {"text": "Senior Jolie Sheerin explained why this charity drive is important: “[I] make sure that the underclassman get to experience the generous family-like atmosphere we have all come to love and admire about South. I want to make sure that this year’s charity drive leaves a lasting impression that will make kids willing to continue the great work” in the annual charity that she has participated in over the past three years at South."}, {"text": "At South, we are presented with opportunities and resources, but we may not realize that a peer or someone in our community is struggling."}, {"text": "Ms. Hanos, who helped organize the holiday drive, said, “We don’t realize how many students and families even in our area… need help all year round.”"}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "South helps families in Mercer County Community through annual Holiday Drive", "date": "January 23, 2019", "writer": {"fvlskYg2CQHL59ccUZY2": {"name": "Ria Patel", "year": "2018"}}, "description": "     The holidays are a time to spread cheer and celebrate as a community. At South, we have have the opportunity to help others in our community and make their holidays more joyous. \n     From December 5 to December 20, South held its annual holiday drive. The club Pirates Against Hunger helped org", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/donation-WEBSITE.jpg"}}