{"tree_elements": [{"text": "Mr. Krause, Mr. Colon, and Mr. Trefz were pied on on Jan. 17 during lunch. The fundraiser was organized by the Interact Club.\nRakiya Hassan, a member of the club, said, “I think it’s a very fun way to reach out to the school community and add a little bit of fun into fundraising.”\nThis year, the Interact Club joined South’s extensive list of extracurricular activities. Their goal: give back to South and the town through community projects.\n“Since we’re new, we don’t have any funds to go off of,” said Hassan. “So this is a fun way to sort of gain funds and gain public interest in the club because community service isn’t just for a few people; it’s for everyone.”\n“The members [of the Interact Club] brainstormed a list of teachers that they thought would be willing to participate,” said Ms. Marshall.\nIn the past, this type of fundraiser has been successful at North, according to Karel Marshall, teacher advisor of the Interact Club.\nThose involved with the Interact Club walked around school during lunch, holding bins with names of the nominated teachers. Students selected their favorite teacher and tossed in money.\nMr. Colon, one of the teachers getting pied, said jokingly about being nominated, “I’m a little mixed about it because I don’t know if students hate me or they really like me.”\nHe added, “ It’s fun and it’s for a good cause and charity, so I’m really excited to raise money for it.”"}, {"text": ""}, {"text": "PHOTO BY MADOKA KONDO"}], "file_structural_elements": {"title": "South teachers “pied” to raise funds for Interact Club", "date": "February 13, 2020", "writer": {"q6Q38H1MOB4iX1yvzBi4": {"name": "Dahria Charadnichenka", "year": "2020"}}, "description": "Mr. Krause, Mr. Colon, and Mr. Trefz were pied on on Jan. 17 during lunch. The fundraiser was organized by the Interact Club.\nRakiya Hassan, a member of the club, said, “I think it’s a very fun way to reach out to the school community and add a little bit of fun into fundraising.”\nThis year, the Int", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/Pied.png"}}