{"tree_elements": [{"text": "“The world is waking up.” The words of 16-year-old environmentalist Greta Thunberg echoed in the United Nations (U. N.) General Assembly hall as she spoke to world leaders at the 2019 Climate Action Summit. “Change is coming, whether you like it or not.”"}, {"text": "Thunberg gave this speech on Sept. 23, three days after the start of the Global Climate Strikes week, which began on Friday, Sept. 20. On the first day, thousands of people in 150 countries participated in the strike to “demand an end to the age of fossil fuels,” according to the Global Climate Strike website."}, {"text": "The Global Climate Strike addresses the need to tackle climate change because, as stated in the U.N. Development Programme’s 2019 Global Outlook Report, “ the impacts of climate change have been growing; often with terrifying results, ranging from wildfires, droughts, flooding, and hurricanes to sea-level rise, ocean acidification to the melting of the permafrost.”"}, {"text": "Specifically, demanding an end to the age of fossil fuels was a priority for strikers because, “carbon dioxide (CO2) from burning fossil fuels is the dominant source of heat-trapping emissions.”"}, {"text": "As a leader and chief organizer of the Global Climate Strike, Thunberg specifically called on young people to take charge and join her initiative. Students at South were one of the many organizers around the world who answered her call."}, {"text": "Junior Raghunandan Raman, the organizer of South’s Global Climate Strike, said “[A]dults and politicians aren’t really doing anything because it is really hard to create change at that level. There are so many different variables: If you want to do something that’s good for the environment, it might be bad for the economy and vice versa.”"}, {"text": "Raman continued, “[Y]oung kids, don’t have a lot to lose and we’re the ones who are going to be most affected by this so that’s why it’s most important for us to do something.¨"}, {"text": "Fridays for Future, a global organization that arranges climate strikes and advocates for climate action, also promotes student participation. 1.1 million students in New York public schools were excused for the strike."}, {"text": "South also supported the movement. Raman said when he approached South’s principal, Dennis Lepold, he was “very open to the idea.” Supported by administration, staff and students, Raman, who is the same age as Thunberg, organized and lead the strike."}, {"text": "At 2:15 p.m., South students walked out of class to join Raman and other Environmental club organizers. Students sat on the football field bleachers and listened to speeches from Raman, South’s Class of 2022 president, Matthew Xu, a sophomore and Environmental Club member, Anushya Shankar, junior Anson Benson, as well as AP Environmental Science and Honors Biology teacher, Kevin Scully. The speakers encouraged students to take measures toward a more sustainable future by making small changes like carpooling, using less plastic and voting for representatives who prioritize climate action."}, {"text": "South’s climate strike speakers also stressed the need for students to continue the momentum of the Global Climate Strike in their daily lives. Raman said the best way to sustain the movement and make a difference is to ¨be aware of how the small actions we take can have a large impact” and to join organizations like South’s Environmental Club. The Environmental Club holds bi-monthly meetings in room 700D for students interested in making sustainable changes. The next meeting is scheduled for Oct. 30."}, {"text": "Thunberg hopes to maintain and increase this united, worldwide effort for climate action. Between Sept. 20 and 27, the strike amassed 7.6 million strikers in 185 different countries. To keep protesters involved, the movement also serves as a resource to find local campaigns, and collaborates with Fridays for Future to continue weekly strikes. The next global strike is set to take place on Feb. 15. Many expect this grassroots movement for climate action will grow."}, {"text": "The U.N. Intergovernmental Panel on Climate Change’s 2018 report stated the Earth only has 12 years till it becomes uninhabitable."}, {"text": "Senior Mourya Vulupala urged that it is “crucial that everyone in our generation understands this and takes part in strikes.” He said, “ I don’t want to see that type of world for future generations. I want to see a better world.”"}, {"text": "PHOTO BY DAHRIA CHARADNICHENKA"}], "file_structural_elements": {"title": "South students join Global Climate Strike", "date": "November 1, 2019", "writer": {"bXXGgMig9e1Wk6o1Nt2M": {"name": "Gauri Nema", "year": "2019"}}, "description": "“The world is waking up.” The words of 16-year-old environmentalist Greta Thunberg echoed in the United Nations (U. N.) General Assembly hall as she spoke to world leaders at the 2019 Climate Action Summit. “Change is coming, whether you like it or not.”\nThunberg gave this speech on Sept. 23, three ", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/Global-Climate-Strike-675x900.jpg"}}