{"tree_elements": [{"text": "Black History Month shines a spotlight on the struggles and achievements of African-Americans to recognize that their stories are interwoven into the narrative of America."}, {"text": "South hosted a Black History Museum from Jan. 31 to Feb. 4 in the school’s library. The event was coordinated by Vice Principal Carla Royster. Students from the Black Student Union (BSU) and Bryan Fisher’s Multicultural Studies class participated in showcasing the exhibits. The museum was sponsored by BSU and the West Windsor-Plainsboro Education Association."}, {"text": "BSU is a club at South that provides support for students and encourages them to discuss issues that affect the African-American community. Multicultural Studies is a history elective taught by Mr. Fisher. He explained, “The last couple of years have brought up a lot of issues to talk about amongst the different races. So multicultural studies is about being able to see a lot of different lenses of society in 2019.”  This is the second year that students from these groups have participated in the Black History Museum."}, {"text": "South had its first Black History Month event in 1988, when Dr. Royster first started working at the school. She said, “At the time, I was coming out of college and I had a lot of ideas about women and people of African American descent.” These ideas translated to a tradition of annual Black History Month events at South. Although, initially, the first few events were “experimental,”  they peaked the interest of the school community and inspired different events for the future. For example, there have been read-ins where different people brought artifacts, authentic books and artwork from their own family."}, {"text": "In recent years, South students curated a museum in the library that contains different exhibits about significant people and events in African-American history. The beautiful displays in the museum are provided by business called Museums in Motion. Some of the stunning pieces at the exhibits were authentic, while others were replicas."}, {"text": "Some of the most notable pieces at the museum included replicated costumes of the rhythm and blues (R&B) singing group The Supremes and singer Lena Horne. Junior Sophia Lennox, a student in Mr. Fisher’s Multicultural Studies class, said, “Being able to see and have tangible things to look at helps make the history real.”"}, {"text": "Additionally, as Dr. Royster said, “We are including individuals who are building up the history of black people in this nation now.” She added, “This year, for the first time, we also had exhibits of people like Jay-Z, Beyoncé and Tupac.”"}, {"text": "Students played a crucial role in making this year’s museum possible. In September, students from BSU and Multicultural Studies were given a list of people and events that would be featured in the museum. Senior Snehi Mukkamalla, Treasurer of BSU, said, “[O]ur job was to do the research about each exhibit and present it to the people who come to the museum.” Dr. Royster put great emphasis on the fact that she wanted the tours to be “fluid and well-researched” so that people who came to the museum would surely leave with new and interesting information."}, {"text": "South staff and students were not the only ones who were able to experience the Black History Museum. Fourth and fifth graders and administrators from all over the district were invited during and after school hours to view the exhibits and go on tours of the museum."}, {"text": "Dr. Royster feels that it is important for South’s diverse student population to be knowledgeable about the histories of all cultures. As a woman of African American descent, she is pleased that the Black History Museum shines a light on the role of African Americans in building the nation."}, {"text": "Students who took part in organizing the museum are also very passionate about its effect on the school community. Mukkamalla said, “This is stuff that you can’t really learn in a textbook. A lot of it is things that we don’t really talk about.” She wanted to take the opportunity to celebrate and showcase the accomplishments of African-Americans that often get “brushed over in most textbooks.”"}, {"text": "Darlene Nawuridam, President of BSU, recalled her experience walking through the museum last year. “The information at the exhibits impacted me a lot,” she said. “And there was a lot of information that I didn’t even know was a part of Black History.” This experience inspired Nawuridam to teach others about African-American history. “I really wanted people to feel the way I did when I tell them about the people and events in Black History.”"}, {"text": "Mr. Fisher believes that the Black History Month events are allowing the school community to evolve as an accepting and open-minded environment. He said, “If we can open a few more eyes, it’ll make our community a stronger and better place.”"}, {"text": "Dr. Royster hopes to continue hosting Black History Month events in the coming years. With so many students from around the world, she believes that it is important to be aware and appreciative of all of the diversity each culture has to offer. “I want there to be an understanding that we have, as people, as human beings, more in common than we have differences.”"}], "file_structural_elements": {"title": "South Black History Month exhibit celebrates Civil Rights Movement and African-American culture", "date": "March 28, 2019", "writer": {"ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}}, "description": "     Black History Month shines a spotlight on the struggles and achievements of African-Americans to recognize that their stories are interwoven into the narrative of America.         \n     South hosted a Black History Museum from Jan. 31 to Feb. 4 in the school’s library. The event was coordinated", "image": null}}