{"tree_elements": [{"text": "*link to='https://www.nj.gov/agriculture/divisions/pi/prog/pests-diseases/spotted-lanternfly/'*New Jersey Department of Agriculture*/link*"}, {"text": "But exactly what is an invasive species? According to science teacher Kevin Scully, “An invasive species is a species that is non-native and has a detrimental impact on the ecology or economy of the area in which it has been introduced or invaded.”"}, {"text": "As herbivorous creatures, lanternflies are a major threat to agricultural crops because they feed on plants containing sugary sap. While ingesting it, they expel honeydew sap which junior Emily Storino explained, “promotes the growth of black sooty mold that can kill a whole plant.” Storino studied spotted lanternflies for her Girl Scout Gold Award Project, a community service program that inspires Girl Scouts to make a difference in their community and solve a local issue."}, {"text": "She said, “This means that native flowers, vegetation, shrubs, and trees are at risk for getting the fungus spotted lanternflies can cause.”"}, {"text": "This particular species of lanternfly typically enter areas free of their native predators and diseases. As a result, they reproduce early in their lifespan, lay many eggs, and outcompete many native species who rely on the same food sources and habitat. Their prevalence in the environment is also a result of another invasive insect species: the Tree of Heaven. According to Mr. Scully, this species serves as both a “favored food and egg mass laying area.”"}, {"text": "In the weeks following their return to school, swarms of lanternflies could be observed hopping from tree to tree and latching onto leaves nearly everywhere in West Windsor and Plainsboro, such as Mercer County Park."}, {"text": "Senior Seher Talukdar described her experience during summer rowing practices at the lake at Mercer County Community Park: “I had daily practice sessions there and regardless of whether I was on water or land, there would always be swarms of them.”"}, {"text": "She added, “I’d find large portions of the lake covered with drowned or almost drowned lanternflies, and when I was on the shores, they would swarm around us constantly.”"}, {"text": "Without any natural factors to inhibit their spread, it is up to us to stop the spotted lanternflies. Until government or private research can yield a permanent solution, a simple method is to stomp them out wherever you see them–they do not bite and they are not poisonous to humans that encounter them. However it is easy for spotted lanternflies to jump out of harm’s way. Alternatively, pest-control products such as insecticidal soap and sticky strips can also poison as well as trap spotted lanternflies."}, {"text": "However, the most important method people can follow is to search for spotted lanternfly egg masses on tree trunks, which appear as pale, crusted dirt spots, and scrape them off to prevent more from being born. Although adult lanternflies will mostly perish during the winter, their egg masses will endure through the cold climate, allowing them to bounce back once the season ends."}, {"text": "“It’s important to help track the population in West Windsor and Plainsboro, as it helps pinpoint hotspots of spotted lanternflies for more concentrated reduction efforts,” Storino said."}, {"text": "To assist in this endeavor, Storino has recently compiled facts and information about the spotted lanternfly on iNaturalist, an observational website powered by the California Academy of Sciences and National Geographic. She has called on the South and WW-P communities to spread the word and take action in order to stymie the growth of the spotted lanternflies."}, {"text": "“The greatest threat spotted lanternflies pose is to our native ecosystem and environment,” Storino said. “Learn more, report sightings, and destroy any eggs or adults you might come across.”"}, {"text": "*link to='https://www.inaturalist.org/projects/spotted-lanternfly-and-its-hosts'*iNaturalist*/link*"}, {"text": "PHOTO BY ALEXANDER CHANG"}], "file_structural_elements": {"title": "Spotted lanternflies: vivid creepers", "date": "November 10, 2021", "writer": {"x0qtq92usjgRms9hU9NA": {"name": "Alexander Chang", "year": "2021"}, "Gxd1r1z0AAbCXQdmEWSS": {"name": "Kalyani Samudrla", "year": "2021"}, "arVyKy5gQKK0nVfft2Bk": {"name": "Deepa Srinidhi", "year": "2021"}}, "description": "     With an amber colored body, a pair of peppered wings, speckled with a mosaic of red, black, and white, the spotted lanternfly might try its best to deceive you into thinking it is an exotic creature, but this vibrant insect is actually a widespread invasive species. The spotted lanternfly is a ", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Screenshot-2021-11-10-13.26.27.png"}}