{"tree_elements": [{"text": "What if one donation, one comforting letter, one motivating push could vanish a girl’s insecurities? How could the world change if more young women felt empowered to take leadership positions in their fields of interest? This is precisely what the To Her, From Us team encourages people to consider."}, {"text": "To Her, From Us is an organization created by South students that serves as an online platform to promote self-love and increase initiative among young women in the South community and beyond. By establishing a blog that fosters open dialogue and showcasing a series of interviews and newsletters that highlight inspiring women and their stories, the organization aims to empower young women to build confidence and strive for their highest potential."}, {"text": "They are also graciously accepting donations in exchange for custom-made laptop stickers, and all proceeds go towards national female-empowerment organizations."}, {"text": "Seniors Carol Sun and Catherine Chu co-founded To Her, From Us last summer after reflecting on their experiences as girls and noticing a pattern of challenges that they often encounter. Sun specifically recalled feeling out of place as a ballet performer, knowing that her body didn’t resemble that of a ‘typical’ dancer."}, {"text": "As a result of their experiences, Sun and Chu decided to take charge in an effort to combat the challenges that young women face. “I didn’t want any other girl to grow up the way that I did and feel like they were never enough, either intellectually or physically,” said Sun. They started by reaching out to a few friends to build a well-rounded team of diverse, driven girls who are excited to spread the message of To Her, From Us."}, {"text": "Along with Sun and Chu, the team is composed of South students: sophomores Karen Yang and Amy Xu and seniors Chloe Wolohan and Caitlyn Ng. There are also two members, sophomore Amy Zheng and senior Sarang Sharma, who help the leaders with outreach opportunities."}, {"text": "In order to extend the impact of the organization, chapters have also been set up in New Mexico, California and Texas. Most recently, the organization has added their first international chapter in South Korea. “We realized that this isn’t just a New Jersey thing,” Chu said. “We saw that female empowerment is also important in other states and we wanted to spread a common message.” So, she and Sun contacted a few friends in other states, who eagerly built their own teams."}, {"text": "This allowed the organization to raise funds for specific female-empowerment organizations in each state. For example, the New Mexico team is currently fundraising for The Barrett Foundation, an organization that provides resources to women and children facing homelessness and domestic violence in Albuquerque."}, {"text": "The other chapters, including the New Jersey headquarters, are donating all proceeds to Girls Inc., WriteGirl and the National Girls Collaborative Project. These organizations provide resources and mentorship for various areas of interest girls around the country are exploring, including STEM and humanities topics."}, {"text": "While fundraising is a major component of To Her, From Us, the team believes that spreading positive messages and creating a safe online platform for young women is just as important."}, {"text": "“To Her From Us originally started as a blog and a place to answer any questions about problems that young women face,” said Xu. By filling out a quick form, girls can send questions or stories that members of the organization will respond to and post on the blog page. Each response opens, “To Her,” and is signed, “From Us.”"}, {"text": "The organization also publishes newsletters to shed light on women from the past who have broken barriers. Some notable articles include one about Tu Youyou, a Chinese chemist who discovered the cure for malaria and one about Anna May Wong, a pioneer of Asian representation in Hollywood."}, {"text": "Additionally, the team conducts interviews with inspiring women in today’s workforce, ranging from Chelsea Kronengold, Communications Director of the National Eating Disorders Association, to Ms. Sydney Miller, a world history teacher at South. Sun said, “The interviews are a way for young girls to see that ‘I can be her too,’ and to highlight the diverse kinds of women we have in our modern world.”"}, {"text": "Chu recalled a moment from Sun’s interview with Zina Spezakis, former congressional candidate for district NJ-9, when she talked about facing criticism for being too aggressive and un-ladylike. “It was surprising how frequently women are still going through this no matter what their job is, but also how they can use that and embrace it instead of seeing it as a hindrance,” Chu said."}, {"text": "Each interviewee is asked a series of prepared questions, one of which is, “Why do you think it’s so imperative for women to understand the importance of initiative and leadership?” When asked the same question, Sun said, “We all have ideas, and we all have potential, and we can all speak and we can all lead, and we all have ways that we want to contribute to this amazing place.”"}, {"text": "Ng added, “We’re slowly getting our voice, but there is still some change that needs to be made.” The To Her, From Us team is determined to be a part of this process."}, {"text": "To get involved, members of the WW-P community can send questions for blog posts, donate to help fundraising efforts and participate in  conversations surrounding female empowerment, which begins with young women. Sun said, “I just hope that this message of women standing up for themselves, women taking risks, women finding their confidence and gaining leadership, spreads as far as possible.”"}, {"text": "*link to='http://www.toherfromus.org/'*www.toherfromus.org*/link*"}, {"text": "Photos courtesy of www.toherfromus.org"}, {"text": "Collage by Elise Ko-Davis"}], "file_structural_elements": {"title": "Student organization To Her, From Us encourages girls to empower themselves", "date": "November 13, 2020", "writer": {"ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}}, "description": "     What if one donation, one comforting letter, one motivating push could vanish a girl’s insecurities? How could the world change if more young women felt empowered to take leadership positions in their fields of interest? This is precisely what the To Her, From Us team encourages people to consi", "image": "https://thepirateseye.org/wp-content/uploads/2020/11/Screen-Shot-2020-10-26-at-6.43.43-PM-900x595.png"}}