{"tree_elements": [{"text": "On May 10, the Food and Drug Administration (FDA) gave emergency approval to make the Pfizer Biontech vaccine available to 12 to 15-year-olds. The WWPRSD initiated vaccine clinics."}, {"text": "A vaccine drive, on May 24 at the GMS gymnasium, brought in middle and high schoolers above the age of 12 to be injected with the Pfizer vaccine. Among these students was South sophomore Nandika Karnik."}, {"text": "“The process was fairly quick,” said Karnik, describing her vaccine experience."}, {"text": "Karnik had previously tried scheduling appointments at various venues, but her busy schedule wasn’t able to fit in a vaccine appointment. After getting an email from the school about the vaccine drive, Karnik gratefully took the opportunity."}, {"text": "Karnik was one of more than 500 students from the WWPRSD area, according to Ms. Maureen Cook, GMS’s assistant principal, who came to GMS during the vaccine drive."}, {"text": "The drive was one of many efforts by the district to offer vaccination to those students that wished to get the vaccine."}, {"text": "Another part of the district’s efforts was assistance with finding vaccination clinics as well as general information to educate the community about the COVID-19 vaccine. Ms. Michelle Crilly, the nurse coordinator of the district, played a key role in all of these initiatives. She and her team sent out emails to parents asking if they needed help getting the vaccine. They have also been in contact with the Health Department to supply parents with relevant information."}, {"text": "“The Health Department has reached out to me and they sent flyers of different places in the community that offer vaccine clinics,” said Ms. Crilly. In late May, vaccination of adolescents accounted for a quarter of the total number of inoculations in the United States, according to The New York Times."}, {"text": "All of these efforts are steps to help students and the community become safer and to help assist the transition to in-person learning next school year."}, {"text": "Photo courtesy of Nandika Karnik."}], "file_structural_elements": {"title": "Student vaccinations happening in full swing", "date": "June 17, 2021", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "     On May 10, the Food and Drug Administration (FDA) gave emergency approval to make the Pfizer Biontech vaccine available to 12 to 15-year-olds. The WWPRSD initiated vaccine clinics.\n     A vaccine drive, on May 24 at the GMS gymnasium, brought in middle and high schoolers above the age of 12 to ", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/Vaccine-GMS.jpg"}}