{"tree_elements": [{"text": "“It’s a really great honor,” said Kerry Kemo, South’s 2022 Educator of the Year awardee."}, {"text": "The annual WW-P Educator of the Year award is a distinction given to one teacher in every WW-P school to highlight their hard work and dedication throughout the school year. The selection process includes both teacher nominations and a committee to make the final decision."}, {"text": "“It really means so much to work with such wonderful, talented teachers and have those people think the same of you,” said Ms. Kemo."}, {"text": "Ms. Kemo’s interest in education began early on in her life. “I always thought about teaching just because I like people. I like communicating with people and I like to feel like I’m helping people to reach a goal,” she said."}, {"text": "Another area of interest for Ms. Kemo was psychology. For two years, she attended Widener University located in Chester, Pennsylvania and pursued a psychology major. However, she soon discovered that the teaching route appealed to her more. So she transferred to TCNJ, a college with a better teaching training program. At TCNJ, she completed the rest of her education."}, {"text": "Ms. Kemo has always had a passion for a specific field of education: special education. With her vibrant personality and patient nature, she matched her passion with her profession."}, {"text": "“I was certified as an English teacher in Secondary Ed, and then I got my master’s in special education. I have always taught students with learning differences, and I’m always focused mostly on the language arts subject within that,” said Ms. Kemo."}, {"text": "For the first nine years of her career, Ms. Kemo taught at The Pennington School, a private school in Pennington, NJ. She loved her experience there, but she always wanted to teach at a public school."}, {"text": "Ms. Kemo came to South in 2001. 2022 marks her 21st year here. In these years, Ms. Kemo has left a great impact on her students."}, {"text": "“Ms. Kemo is a big reason why I am so passionate about my education. She is influencing me and all of her students to pursue our passions,” said senior Harper Wood."}, {"text": "Senior Anoushka Paul said, “She’s the type of teacher that truly does care about you as a student in every aspect. Ms. Kemo is the most understanding person ever. She is always there to help you out and shows how much she cares.”"}, {"text": "Reflecting on her career here, Ms. Kemo said, “Every day has its challenges and has its really funny moments, and sometimes has other emotions involved. But making connections with people, just communicating and reaching people on different levels, and teaching students skills that will hopefully help them in their lives is all what I love about it.”"}, {"text": "Over the summer, Ms. Kemo plans on teaching ESY, extended school year, at Town Center to help students who need continued education."}, {"text": "Ms. Kemo said of teaching, “It is a wonderful career that I have truly loved.”"}], "file_structural_elements": {"title": "Teacher, inspiration, friend: Special Ed. teacher Ms. Kerry Kemo awarded Educator of the Year", "date": "June 21, 2022", "writer": {"nzWe67TLOyFH0NU0m5Q8": {"name": "Tiffany Lu", "year": "2022"}, "h6LJRFoJDlU8899sJKNW": {"name": "Ishani Konar", "year": "2022"}}, "description": "     “It’s a really great honor,” said Kerry Kemo, South’s 2022 Educator of the Year awardee.\n     The annual WW-P Educator of the Year award is a distinction given to one teacher in every WW-P school to highlight their hard work and dedication throughout the school year. The selection process inclu", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/kjhgvgh.jpg"}}