{"tree_elements": [{"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": "After almost two years, construction in the Pirates ship, is finally complete.\nConstruction began during the peak of the pandemic in the beginning of 2020 and was finally completed in the summer of 2022. This school year, optional masking is not the only change students see. The new construction has created additional classrooms for new electives to be added to course selections. The completion of the long awaited dance studio introduces the new Dance 1 class, offered to all grade levels and instructed by Ms. N’Talia Wilson."}, {"text": "Ms. Wilson said, “The Dance 1 course is an exploratory dance performance class studying\ndances of the world from various cultural and social perspectives.”\nStudents learn various forms of dance such as modern, jazz, hip-hop, as well as dances from around the world, such as Bachata, originating from the Dominican Republic, and Bollywood, originating from South Asia.\n“I hope that the students in my course can identify and connect with the cultural and social dance forms to further enhance their experience, and relationship with the art form” said Ms. Wilson.\nThis course allows students to expand their knowledge of the cultures around them, and since South is an ethnically diverse school, students will be able to better understand their peers’ cultures.\nShefali Saxena (‘25), a student in Ms. Wilson’s period 3 class, said, “I wanted to join this course to get more knowledge about different dance forms and get a taste of all of them.”\nA class period for a Dance 1 student starts off with changing into all black clothes. Students then perform a warm up routine to get their muscles ready for the rest of class and spend the majority of the time perfecting their latest routine or learning a new skill.\nIn addition to Dance 1, Emerging Financial Markets is also a new elective. Taught by Mr. Joshua Crome, students taking Emerging Financial markets learn about traditional and more modernized technological finances such as cryptocurrency, knowledge which they can apply over the course of their lives even after they graduate from South.\n“I want all my students to know the doors to building wealth prudently over long periods of time are open to all of us now in ways they weren’t even 15 years ago,” said Mr. Crome.                                   The main areas of study for this course consist of Financial Technologies, Automated Investing, and Sustainable Investing.\n“I anticipate gaining an exposure to various types of investments, from traditional ones like stocks and bonds to upcoming types like cryptocurrency and NFTs, and the laws that govern them,” said Nandika Karnik (‘23)."}, {"text": "Along with learning about various financial topics, one of the ways students will be able to grasp the financial world’s reality is by observing the effects of it on well known figures.\n“We’ve seen Kim Kardashian pop up in financial news headlines quite a bit,” said Mr. Crome. “It’s amazing how there’s this intersection between thinking of finance as a bunch of people in business suits and a paneled boardroom, but finance is everybody. Now it’s not just those people, but it’s us and Kim Kardashian, of all people.”\nElectives like Dance I and Emerging Financial Markets allow students to experience and get involved in courses that broaden their perspective, a skill essential to understanding the real world."}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": "The newly constructed dance studio at South."}], "file_structural_elements": {"title": "The Pirate ship is ready to sail with new classes", "date": "November 21, 2022", "writer": {"h6LJRFoJDlU8899sJKNW": {"name": "Ishani Konar", "year": "2022"}, "TtzLeEsqVllY4uMU8Zl6": {"name": "Manika Niwas", "year": "2022"}}, "description": "\n \n \n \n \n \nAfter almost two years, construction in the Pirates ship, is finally complete.\nConstruction began during the peak of the pandemic in the beginning of 2020 and was finally completed in the summer of 2022. This school year, optional masking is not the only change students see. The new const", "image": null}}