{"tree_elements": [{"text": "The American Revolution, DNA replication, the quadratic equation, Shakespeare are all topics we learn in school.  At South, we also share our interests and hobbies beyond the school curriculum."}, {"text": "At the biannual Unconference on Nov. 13, students and teachers hosted workshops on a topic of their choice. This year, there were 49 sessions, including topics such as pottery, 3-D origami, yoga and therapy dogs."}, {"text": "The Unconference was organized by student assistance counselor Ms. Chelsea Allen and social studies teacher Mr. Matthew Coburn. Unlike a traditional lecture, where the speaker presents information to an audience, an Unconference is driven by participant discussion. In some Unconferences, attendees had the chance to create a project, such as a 3-D modeling simulation or a comic."}, {"text": "Mr. Coburn explained that the Unconference gives students the opportunity to explore activities with friends or strangers over a common interest, outside of rigorous school schedules."}, {"text": "One change that was made since last year’s Unconference is allowing students from different grades to interact with each other. There was a “stark difference [this year],” said Mr. Coburn. “We had particular sections that were only open to specific grades, so there was no co-mingling [last year].” However, this year, students were allowed to sign up for any Unconference, because they were open to all."}, {"text": "Another new change was to include “outside organizations [to] talk about opportunities outside of school that [students] could maybe, realistically, get involved in,” said Ms. Allen."}, {"text": "*link to='https://www.glsen.org/about-us#snt--1'*GLSEN*/link*"}, {"text": "*link to='https://www.nami.org/About-NAMI'*NAMI*/link*"}, {"text": "The Unconference also allowed for students to be taught by their peers, instead of studying in a traditional teacher-to-student environment."}, {"text": "One student-led session that was held was “Retro Technology.”  They showcased electronics and other technology that are no longer used, such as typewriters and cassette tapes."}, {"text": "“How we define technology today – computers, laptops, sensors, stylos, and how [it was] back then, it’s so much different now. It’s really progressed and changed,”  says freshman Jordan Destinoble."}, {"text": "Another session organized by students was “Mental Health: My Own Story,” led by junior Harrison Young. Saanch Shahdadpuri, a freshman who attended, said that “[it’s] a lot of learning that’s done in a different way compared to just sitting in class and doing work.”"}, {"text": "Shahdadpuri learned that individuals are not alone when they struggle and that it is important to give support to others."}, {"text": "Although students enjoyed this event, students, especially those that hosted a session, had some suggestions that they want to be considered for the Spring Unconference. Ms. Allen and Mr. Coburn are continuing to work on “making it a better program. But ultimately, it is what you guys make it,” said Ms. Allen."}, {"text": "Connie Xie, a senior who hosted a session called, “Using Introductory Philosophy to Navigate Adolescence,” said in an email that “extending the Unconference time period to one hour rather than thirty-five minutes would be an improvement.”"}, {"text": "Shahdadpuri added, “I would definitely want for there to be an option for multiple Unconferences in a day […] or just one day with all Unconferences.”"}, {"text": "Ms. Allen explains that the Unconference “gives [students] the opportunity to [..]talk about topics they’re interested in, or that they’d like to learn more about,” and they are looking forward to the next event."}, {"text": "Mr. Coburn said, “All you need to have is an idea, and a forum on how you’re going to talk about that idea, and then you’re in, this is the beauty of it. It’s for everybody.”"}, {"text": "PHOTO COURTESY OF MS. SHEETAL KHOT"}], "file_structural_elements": {"title": "Unconference brings South together", "date": "December 20, 2019", "writer": {"": {"name": "Kiko Yoshihara", "year": ""}}, "description": "     The American Revolution, DNA replication, the quadratic equation, Shakespeare are all topics we learn in school.  At South, we also share our interests and hobbies beyond the school curriculum. \n      At the biannual Unconference on Nov. 13, students and teachers hosted workshops on a topic of ", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/Gamboy-color.png"}}