{"tree_elements": [{"text": "The SAT/ ACT are the first things that come to students’ minds when thinking about college applications. Every year, juniors around the country prepare extensively by taking prep courses such as Kaplan and Princeton Review, for a test that seems to hold significant weight in their application. But a recent lawsuit has the potential to change this aspect of the college admissions process.\nLast year on Dec. 10, various social and academic advocacy groups and the Compton Unified School District, a largely African American and Hispanic district, came forward with lawsuits against the University of California (UC). These lawsuits called for the college to stop requiring SAT and ACT scores for admissions.\nThe lawsuits were filed in Alameda County, Oakland, CA by The National Center for Fair and Open Testing and Public Counsel, the country’s largest non-profit law firm. They are the first to directly question the need for SAT and ACT scores in the college admissions process.\nThe plaintiffs, the people who brought the case to court, argue that these standardized tests enable discrimination based on race and wealth.\nSeveral studies support this argument. A 2017 report by The Brookings Institution, an American research group, analyzed the correlation between race and SAT scores. It states that for the math section of the SAT, the average score for African American and Hispanic students is 457 out of 800, which is below the national average score of 511. On the other hand, Asian students score an average of 598 and Caucasian students score an average of 534.\nIn light of similar findings in the past, many colleges have decided to become test-optional. There are currently more than 900 test-optional schools in the U.S., including top institutions such as the University of Chicago. There are also many test-optional schools in CA, including the California Institute of the Arts and various campuses of the California State University.\nJunior Irena Chen said, “Students should still have the option to include SAT and ACT scores in their college applications because although they aren’t accurate representations of a student’s academic abilities, they still give colleges a general idea as to where a student stands compared to his or her peers.”\nHowever, attorney Mark Rosenbaum of Public Counsel argues that test-optional schools do not eliminate discrimination, as they still have the option to factor test scores into admissions. In a recent interview with the New York Times, he said, “There is no such thing as race-discrimination-optional, there is no such thing as wealth-discrimination-optional.”\nAmid the criticism, UC created a task force to assess the correlation between standardized test scores and students’ preparedness for higher education. Their report is expected to be released this spring. UC may reconsider their use of test scores in admissions once the task force’s findings are released.\nThe debate over using standardized test scores in the college admissions process is nothing new. Guidance counselor Molly Rooney said, “It’s a complicated issue and there are arguments on both sides.”\nSome argue that standardized test scores give colleges an objective way to compare applicants.\n“I think that the SAT and ACT just provide another insight into what kind of student the applicant is,” said Junior Mary Paskhaver. “The scores are just another point on the application that can describe a student and colleges should definitely take advantage of it.”\nOthers, like the plaintiffs, argue that a student’s socio-economic status plays too big a role in determining their score. Chen said, “The tests are not standardized at all since everyone has their different situations. Some people have more time to study or more money to go to prep classes.”\nIt is evident that there are conflicting views on the issue, and the lawsuits against UC may have the potential to spark new ideas about ways to make college admissions more fair for all applicants.\n“It will be very interesting to see the results of this case and the impact it has on admissions in terms of testing,” said Ms. Rooney."}, {"text": ""}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "University of California sued over SAT/ ACT admissions requirement", "date": "February 13, 2020", "writer": {"ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}}, "description": "The SAT/ ACT are the first things that come to students’ minds when thinking about college applications. Every year, juniors around the country prepare extensively by taking prep courses such as Kaplan and Princeton Review, for a test that seems to hold significant weight in their application. But a", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/sat-900x876.jpg"}}