{"tree_elements": [{"text": "“Before COVID-19, I think a lot of countries and a lot of groups were really trying to reduce our reliance on single-use plastics,” said senior Raghunandan Raman, co-president of the Environmental Club."}, {"text": "The coronavirus pandemic has led to a surge in single-use medical equipment, such as masks and gloves, which is having a negative impact on our oceans, polluting them with plastic debris and further harming the ocean’s ecosystem."}, {"text": "A special investigation published on Reuters by Joe Brock said that 12 times more face masks were used in China in the month of March than in February. Masks are often made of propylene, a thermoplastic resin that is contributing to massive plastic piles. England has also seen a spike. For example, an article from The Conversation said that 2.3 billion personal protective equipment (PPE) products have been given to health and social care services from February to July in England, the same amount distributed in all of 2019."}, {"text": "But masks and PPE are not the only contributors to the rise of plastic. Online deliveries and groceries also account for a significant portion of the plastic that is contributing to this surge."}, {"text": "“I think people have also been reluctant to bring reusable bags to the grocery stores and some grocery stores are kind of treating reusable bags a little differently than they used to,” said Mr. Kevin Scully, an environmental science teacher. As people refrain from using reusable bags in grocery stores due to the fear of catching and transmitting the coronavirus, dependence on single-use plastic bags is increasing."}, {"text": "Mr. Scully said, “Plastic from shipping is a pretty big deal.”"}, {"text": "Online retailers, such as Amazon, deliver packages that are usually wrapped in multiple layers of plastic and in cardboard boxes. These boxes are often disposed of improperly, most materials are not recycled and many cannot be recycled. According to the Reuters article by Brock, of the 6.3 billion tons of plastic produced since 1950, 91 percent hasn’t been recycled."}, {"text": "This plastic ends up in oceans and landfills. In the ocean, it collects in garbage patches, such as the Great Pacific Garbage Patch, located between the North American West Coast to Japan. The Great Pacific Garbage Patch is currently three times the size of Texas."}, {"text": "Plastic in the ocean doesn’t biodegrade and instead breaks down into even smaller pieces due to relentless ocean waves and radiation from the sun. These tiny pieces are known as “microplastics.” National Geographic defines microplastics as plastics that are less than 5 mm in diameter."}, {"text": "“Organisms such as turtles, such as fish, end up consuming these,” said senior Arya Sasne, President of Ocean Bowl, a jeopardy style competition on everything related to the ocean. Humans later eat the fish, oblivious to the harm that can be done to our bodies. A study from Ghent University in Belgium states that an average shellfish consumer in Europe eats 11, 000 microplastics annually."}, {"text": "“We don’t yet know the range of impact that it will have on human health,” Sasne said."}, {"text": "Plastic is a multifaceted cycle that ends back at us. A study done by the World Health Organization (WHO) reveals that even the bottled water from supermarkets may contain microplastics."}, {"text": "“There’s so much plastic in the environment at this point,” said stated John Hocevar, a marine biologist in an interview with ABC News, “it’s in the water we drink, much of the food we eat and even the air we breathe.” In response to the plastic surge, people are attempting to mitigate the effects of such rises. New Jersey recently passed legislation banning the use of single-use plastic and paper bags in grocery stores. According to a New York Times article, this legislation is the first in the nation banning not only plastic but also single-use paper bags."}, {"text": "“Banning these plastic bottles and plastic bags is going to do wonders for our ecological cultures especially in terms of ocean life,” said senior Rajat Khurana, co-president of Human Rights Club."}, {"text": "While the legislation is a good first step, it will take 18 months to go into action, writes Mihir Zaheri, journalist from the New York Times."}, {"text": "“That’s a lot of bags used between now and then,” said junior Anushya Shankar, leader of the Green Team Initiative with the West Windsor Environmental Commission, which is currently working on educating people on the dangers of single-use plastic bags."}, {"text": "Although great strides are being taken by our community to reduce the use of plastic, it will take a long time to live in a world when the threat of plastic won’t be lurking by. The ‘plastic pandemic’ is hurting innocent creatures harder than ever. “I do think that the way we are going right now is unacceptable,” said Raman."}, {"text": ""}, {"text": "PHOTO COURTESY OF VIKAS PUJARA"}], "file_structural_elements": {"title": "Use of plastic skyrockets", "date": "December 22, 2020", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "    “Before COVID-19, I think a lot of countries and a lot of groups were really trying to reduce our reliance on single-use plastics,” said senior Raghunandan Raman, co-president of the Environmental Club. \n     The coronavirus pandemic has led to a surge in single-use medical equipment, such as ma", "image": "https://thepirateseye.org/wp-content/uploads/2020/12/Arabian-Sea.png"}}