{"tree_elements": [{"text": "“When will we get back to normal?” sophomore Aarushi Bansal asked. This is a common question among many South students as the social distancing advisories and mask requirements drag on towards the end of 2020."}, {"text": "Since the beginning of the pandemic, people around the world have been asking questions about when the vaccine for COVID- 19 will emerge. In fact, the U.S.’s cases are currently on the rise, leaving even more anxiously waiting for a solution. “The scientists are working at the pace they have to,” said Meenakshi Bhattacharya, a Biology Honors and AP Biology teacher at South. Although scientists are breaking boundaries and have shortened the waiting time significantly, people are still hoping for faster development."}, {"text": "As stated by the Centers for Disease Control and Prevention (CDC), there are multiple stages of vaccine development and approval: exploratory stage, pre-clinical stage, clinical development, regulatory review and approval, manufacturing and quality control. There are currently 61 potential vaccines in various stages of testing and development."}, {"text": "*link to='https://medlineplus.gov/ency/article/002223.htm'*antibodies*/link*"}, {"text": "In the preclinical stage, researchers begin testing the antigen on cultured tissue or cell culture systems (cells and cell systems grown in laboratories) to see whether it will produce immunity. At this point, many candidates fail to provide necessary results to move on to the next stage."}, {"text": "The next step is the clinical stage, which is split into three parts: Phase I, Phase II and Phase III."}, {"text": "In Phase I, the potential vaccine is administered to less than 100 individuals . The central purpose of this phase is to study the individuals’ different reactions to the vaccine and determine whether it is safe. There are 13 candidates in this phase, including LNP-nCoVsaRNA from Imperial College London."}, {"text": "Phase II tests the candidate on several hundred people. Phase II, like Phase I, tests the safety of the vaccine and studies the varying responses. However, Phase II is also meant to determine the doses, immunization schedules (when and how many doses will be delivered to someone), and immunogenicity (the body’s ability to produce an immune response to the antigen). So far, there are 14 candidates in this phase, such as AG0301-COVID19 from AnsGes, Inc."}, {"text": "Phase III, the last clinical phase, may involve a sample size of tens of thousands of people and continues to investigate the safety, side-effects and effectiveness of the vaccine candidate. There are currently thirteen candidates in this phase, such as JNJ-78436735 (formerly Ad26.COV2-S) from Johnson & Johnson."}, {"text": "The regulatory review and approval stage occurs only if the vaccine candidate passes all three clinical phases. At this stage, the company or group submits a Biologics License Application (BLA) to the Food and Drug Administration (FDA), which certifies vaccine quality, safety and effectiveness."}, {"text": "Next, hundreds of millions of copies of the approved vaccine candidate must be manufactured. Major drug manufacturers, such as Johnson & Johnson and Bristol-Myers Squibb, have the required personnel, infrastructure and equipment to carry the vaccine candidate through this step and onto the next. “They are stockpiling the vaccine so that as soon as the FDA gives a green light they will not have to waste time making the vaccines and will be able to release the vaccine to the public at once,” said Dr. Bhattacharya."}, {"text": "The last stage in the vaccine’s journey to becoming available for distribution is quality control. The investors and scientists must now track the effectiveness of their vaccine and find out if it performs as anticipated. At this stage, the company has a few systems to choose from to scale the success of their vaccine. These include the Phase IV system and the Vaccine Adverse Event Reporting System (VAERS), in which numerous studies are conducted on the subject of overall success."}, {"text": "In total, these stages typically take years for a vaccine candidate to complete. The exploratory stage takes anywhere from two to four years, while the preclinical stage takes an additional one to two years. Phase I can take up to a year, Phase II may last up to two years and Phase III spans anywhere from one to four years. “The process of making the vaccine takes a long time,” stated Dr. Bhattacharya. “But it has been sped up with our knowledge of other coronaviruses like SARS and Flu.”"}, {"text": "Subsequently, an urgent demand in a COVID-19 vaccine has accelerated this process and this hastening has been dubbed Operation Warp Speed."}, {"text": "“In Operation Warp Speed, what has been done is multiple steps are being done simultaneously without sacrificing the safety or the determination of efficacy in order to be able to produce a vaccine for use more quickly.” stated Peter Marks, director of the Center for Biologics Evaluation and Research (CBER), in his interview with the FDA. “So, it’s just a matter of here, the benefit of having a vaccine is so great that it’s worthwhile putting the additional resources in to do things at the same time rather than one step after another so that we can end up with a vaccine more quickly.”"}, {"text": "However, there is a significant amount of concern over whether or not the vaccine will be effective due to the acceleration. “With a vaccine, there’s so many things that could go wrong,” said Bansal. “I really think that they should take their time making the vaccine.”"}, {"text": "As to when everything will be back to pre-quarantine, scientists don’t have a definitive answer. On Sept. 23, Anthony Fauci, the White House coronavirus advisor, told Congress that “it might take some time” for vaccine doses to be approved by the FDA and become widely available because of the meticulous testing required to create a vaccine that is both safe and effective."}, {"text": "Still, Fauci has put forward a vague timeline. Regarding manufactured doses of the vaccine, he said, “They  will be rolling in as the months go by and by the time you get to maybe the third or fourth month of 2021, then you’ll have doses for everyone.”"}, {"text": "According to Fauci, the main reason why it will take months to deliver the vaccine to the public is not the lack of vaccine, but the manufacturing process. “In November you’ll probably be maybe 50 million doses available. By December maybe another 100-plus million. And then you get into January and February. By the time you get to April, it’ll be a total of about 700 million.”"}, {"text": "In late November, the three most promising vaccine candidates were chosen for funding by Operation Warp Speed: Moderna’s mRNA-1273, University of Oxford and AstraZeneca’s AZD1222, and Pfizer and BioNTech’s BNT162. Phase III trial studies have found that BNT162 was 94 percent effective in people over 65 years old and was shown overall to be 95 percent effective."}, {"text": "As of Dec. 11, Pfizer and Biotech’s BNT162 has been issued emergency use authorization (EUA) in people 16 years of age or older by the FDA. “The FDA’s authorization for emergency use of the first COVID-19 vaccine is a significant milestone in battling this devastating pandemic that has affected so many families in the United States and around the world…” stated Stephen M. Hahn, MD, Commissioner of the FDA in response to this EUA. The first shipments of the vaccine reached states on Dec. 14, and are to be administered to those working on the front lines with the virus, mainly doctors and nurses, and long term care residents and workers in senior homes."}, {"text": "Whether it takes a few months or a few years, eventually the pandemic will end, but, “not until everybody gets vaccinated or until no new cases are seen for a long time,” according to Dr. Bhattacharya. In the meantime, as the pandemic experiences one of the largest surges in cases and deaths, remember to follow social distancing guidelines and wear masks to become part of the effort to save lives and keep this virus under control."}, {"text": ""}], "file_structural_elements": {"title": "Vaccines: When will they be ready?", "date": "December 22, 2020", "writer": {"q6Q38H1MOB4iX1yvzBi4": {"name": "Dahria Charadnichenka", "year": "2020"}}, "description": "      “When will we get back to normal?” sophomore Aarushi Bansal asked. This is a common question among many South students as the social distancing advisories and mask requirements drag on towards the end of 2020. \n     Since the beginning of the pandemic, people around the world have been asking ", "image": null}}