{"tree_elements": [{"text": "As winter approaches, WW-P’s temperatures have been dropping lower and lower. Other parts of the U.S. are also facing drastic changes in weather this season, either increasing or decreasing in temperature. This makes us all wonder: will this trend of increasingly extreme temperatures as compared to historical norms continue into the future? The ongoing struggle of climate change has been brought to the forefront to explain this winter phenomena."}, {"text": "Climate change, not to be mistaken with global warming, is the measure of the increasing changes in the climate, such as precipitation and temperatures, over a long period of time. Depending on the change, it can be harmful to different ecosystems by causing rising sea levels, wildfires or droughts."}, {"text": "ABC News reported, “This year was hotter than average in most parts of the world, including the Arctic.”"}, {"text": "On the other hand, the U.N. said, “[…]a large area of North America has been colder than the recent average.”"}, {"text": "Bhaskar responded, “This implies that due to human error and carelessness, we are destroying the climate, altering the climate and setting the stage for the destruction of our home.”"}, {"text": "The Weather Channel, an American television channel owned by the Weather Group, predicted that temperatures from December through February would be below average in the North and East coast and above average in the South and West coasts."}, {"text": "Jamie Roder, a Biology, Environmental Science and Genetics teacher at South, said, “I’ve heard the term ‘winter weather whiplash,’ where there are these extreme fluctuations of hot and cold throughout the winter.”"}, {"text": "Due to these variations in temperatures, as shown by The Weather Channel, the cold and warm climates clash as they travel in opposite directions, the warmth traveling southwest and the cold traveling northeast."}, {"text": "South’s Environmental Club President, Senior Nitya Narayanan, said, “I think that because of how the climate has been changing[…] it makes sense that winter has become unbearably cold in areas where it shouldn’t be as cold.”"}, {"text": "WW-P is expected to be hit by temperatures that are colder than usual during the prime of winter. Narayanan said, “I think maybe we’ll have more ice storms and black ice– things like that will be more common than normal.”"}, {"text": "Since New Jersey is located on the East coast, The Weather Channel has also said that our community will be expecting more rainfall with an increased chance by 33 percent."}, {"text": "Ms. Roder said, “I think that with snow melting and more extreme rain events, flooding will be a big problem specifically in West Windsor-Plainsboro.”"}, {"text": "Not only will the WW-P community experience colder weather, but there will also be harmful environmental effects. Ms. Roder explained, “When winters are unusually warm and then unusually cold[…] it can really hurt living things. For example[…] [when] you have an unusually warm day, plants bloom and then when it goes back to extreme cold, they frost over and [wither away].”"}, {"text": "Due to the abnormal climates clashing between warmer or colder than usual temperatures, WW-P is faced with issues such as the cold, snow and an increase in precipitation."}, {"text": "Ms. Roder said, “Seeing these effects of flooding, extremely hot summers and extremely cold winters, I hope that people in this community and at South start seeing it’s something we should start caring about[…] it will affect all of us[…] [so] try to make positive changes.”"}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Winter is coming: the coldest one yet", "date": "December 20, 2019", "writer": {"L2tabycjXwSAHtJCW6yQ": {"name": "Grace Choe", "year": "2019"}}, "description": "As winter approaches, WW-P’s temperatures have been dropping lower and lower. Other parts of the U.S. are also facing drastic changes in weather this season, either increasing or decreasing in temperature. This makes us all wonder: will this trend of increasingly extreme temperatures as compared to ", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/coldest-winter.jpg"}}