{"tree_elements": [{"text": "People all over the world poured into city streets to rally for women’s rights and equality for the annual Women’s March on Jan. 19."}, {"text": "The march united women globally to fight against misogynistic and patriarchal power structures deeply rooted in society. This march gave protestors a forum to speak their minds and stand with others who value positive change in society, treating women and men equally. As Nathaniel Hawthorne said, “ Every individual has a place to fill in the world and is important in some respect, whether he chooses to be so or not”. The Women’s March has helped many people find this place."}, {"text": "The first Women’s March in 2017, although a global rally, was mainly held in Washington D.C. on Jan. 21, the day after President Trump’s inauguration."}, {"text": "Women have made extraordinary strides since then. For example, Alexandria Ocasio-Cortez and Rashida Tlaib, along with 85 other women, were elected to the House of Representatives. Under the momentum of the #MeToo movement–a movement that encouraged sexual assault survivors to call out men in power for their predatory behavior–allowed Christine Blasey Ford to come forward with sexual assault allegations against Justice Brett Kavanaugh."}, {"text": "The march continues to inspire women. Freshman Akansha Joshi, an attendee of the Women’s March 2019, said, “[T]he Women’s March has taught me to be confident. It has proven to me that anything is possible as long as I believe in myself.”  She said her gender is an asset, not a detriment to what she can accomplish and, in everything she does, she expects to be treated for her abilities."}, {"text": "The Women’s March Organization is an umbrella group that serves to empower other minority groups, such as the L.G.B.T.Q.+ community and the Black Lives Matter movement."}, {"text": "Sophomore Aaheli Konar, another March participant, said, “My favorite part of the March was just the atmosphere that was surrounding me. You could really feel all of the anger [against injustice], while also seeing all the men and women supporting each other. There were so many moments where you could see the emotions in people’s eyes. They were so happy and grateful to be surrounded by so many allies.”"}, {"text": "But this year’s march also came with its own set of problems. Many women were boycotting the march because, according to the Washington Post, co-founders of the National Women’s March organization Tamika Mallory, Carmen Perez and Linda Sarsour, were accused of being affiliated with an anti-Semitic and homophobic Nation of Islam movement leader, Louis Farrakhan. Many queer and Jewish women, as well as many of their friends and allies, refused to attend the march to display their disapproval."}, {"text": "The affiliation sparked a contentious debate. Many challenged Mallory when she didn’t condemn statements made by Farrakhan, but, instead, repeatedly said that she didn’t agree with them during an interview on ABC’s “The View”."}, {"text": "This controversy, as well as the gloomy weather and possibly activism led to a smaller group of women coming out this year. This year’s group of about 80,000 attendees is shockingly low compared to the 500,00 that showed up for the 2017 march."}, {"text": "Is it possible that the pink era is coming to an end?"}, {"text": "I don’t think so.  The progress women have made publicly has helped thousands of women in their private lives. Women and men will continue to fight for gender equality until we arrive at the future we and our grandmothers and great grandmothers and great-great grandmothers and those who protested silently, have been fighting for."}], "file_structural_elements": {"title": "Women’s March: “Hey hey, ho ho! This is what democracy looks like.”", "date": "March 28, 2019", "writer": {"uCLiBSNVw88B8cvjzOCS": {"name": "Naqsh Mitra", "year": "2018"}}, "description": "   People all over the world poured into city streets to rally for women’s rights and equality for the annual Women’s March on Jan. 19.\n     The march united women globally to fight against misogynistic and patriarchal power structures deeply rooted in society. This march gave protestors a forum to ", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/womens-march-7-900x674.jpg"}}