{"tree_elements": [{"text": "Every day our Earth suffers a little more. Our atmosphere clouds, our oceans rise and we don’t spare a second’s thought towards it. We live on a dying planet and a youth-led court case is trying to do something about it."}, {"text": "*link to='https://www.ourchildrenstrust.org/juliana-v-us'*youth plaintiffs under Kelsey Juliana filed a lawsuit against the United States government,*/link*"}, {"text": "“As the successors of the Earth,” said junior Nitya Narayanan, President of the Environmental Club,  “I think it only makes sense for teens to start taking a stand and try inciting change to ensure a better future for us all.”"}, {"text": "*link to='https://static1.squarespace.com/static/571d109b04426270152febe0/t/57a35ac5ebbd1ac03847eece/1470323398409/YouthAmendedComplaintAgainstUS.pdf'*The filed document reads*/link*"}, {"text": "*link to='https://www.eia.gov/environment/'*U.S. Energy Information Administration*/link*"}, {"text": "A Btu is the amount of heat required to raise a pound of water by one degree Fahrenheit. The levels of heat we produce directly impact our atmosphere."}, {"text": "That same year, there were also 5,721 million metric tons of carbon dioxide emission."}, {"text": "*link to='https://climate.nasa.gov/climate_resources/24/graphic-the-relentless-rise-of-carbon-dioxide/'*higher than they have been at any time in the past 400,000 years*/link*"}, {"text": "Founding Co-President of the Human Rights Club, sophomore Rajat Khurana fears that the alarming rate of emission “has the potential to wipe out our entire species.”"}, {"text": "The 21 plaintiffs bring light to this issue of humanity’s future well being on Earth. Under the Due Process Clause of the U.S. Constitution, the plaintiffs filed their lawsuit arguing the use of fossil fuels and its impact on Earth violates an American citizen’s rights to life, liberty and property."}, {"text": "Due Process means that the United States government is legally obligated to provide fair treatment in court for any citizen with a grievance."}, {"text": "*link to='http://vjel.vermontlaw.edu/topten/juliana-v-united-states-constitution-guarantee-livable-planet-kids/'*Professor Melissa Scanlan, director of the Environmental Law program at Vermont Law School*/link*"}, {"text": "Federal lawyers are trying to get the case dismissed but preparations for the trial are continuing."}, {"text": "*link to='https://www.nationalgeographic.com/environment/2019/03/youth-climate-change-lawsuit-grows-support/'*over 32,000 youths signed a petition supporting the plaintiffs mission*/link*"}, {"text": "The lawsuit and youth-led support is part of a larger trend of teen activism that includes #Never Again, a movement led by students from Parkland High School, the site of a school shooting, calling for stricter gun laws."}, {"text": "“I think voicing our opinions has always been an intrinsic value of America, and it is what makes our country so unique. But to see younger people, like the 21 teens that are fighting in this case, shows a shift in the idea of taking action. We are done waiting for the adults to make decisions,” said Narayanan."}, {"text": "*link to='https://www.gse.harvard.edu/news/ed/18/08/student-activism-20'*Student Activism 2.0*/link*"}, {"text": "“When you see the headlines about these teenagers going against the US government to fight climate change, the amount of publicity that will generate will be on an enormous scale. That publicity results in more people getting educated about climate change,” explained Khurana."}, {"text": "Because of the influence of social media, more teens worldwide have contributed their own efforts towards causes like Juliana v. United States."}, {"text": "“For example, the student walkouts and marches after the shooting in Parkland, Florida brought the issue of gun violence to the center of national debate and even led to the writing of several bills which would increase regulation of assault weapons,” said sophomore Vineet Chovatia, Founding Co-President of the Human Rights Club."}, {"text": "Narayanan commented, “Teen activism is so effective because, I mean, what is more effective than a bunch of kids telling adults in power that they need to step up and make a change?”"}, {"text": "The next hearing is scheduled for June, 4 on behalf of the federal government’s appeal. Support is continuing to surge from around the country."}, {"text": "“From the college students who took action during the Civil Rights Movement to the high school students who are currently taking action against gun violence, it has always been the youth who have spurred societal change,” said Chovatia."}, {"text": "As for the 21 plaintiffs wait for a chance to go to trial, Chovatia reflected, “Student action commands the attention of spectators and is the driving force behind many activist movements in this nation. It is the youth who will be facing the issues of tomorrow, so it should be the youth who take action.”"}], "file_structural_elements": {"title": "Youth plaintiffs sue federal government over climate change", "date": "May 21, 2019", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "     Every day our Earth suffers a little more. Our atmosphere clouds, our oceans rise and we don’t spare a second’s thought towards it. We live on a dying planet and a youth-led court case is trying to do something about it.\n     On Sep. 10, 2015, 21 youth plaintiffs under Kelsey Juliana filed a la", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/climate-change-1.jpg"}}