{"tree_elements": [{"text": "Campaign Dialogue’s mission is simple yet overarching: “Everyone who comes in and out of our school — we want to make sure it’s the best environment that we can possibly create for them,” said sophomore Rakiya Hassan."}, {"text": "Led by co-chairs Hassan and sophomore Mehr Narula, Campaign Dialogue is South’s climate and culture team."}, {"text": "Narula joined the team in sixth grade and first felt the effects of her work when presenting on a panel at a Professional Development conference for district teachers."}, {"text": "“I think that moment where my fifth-grade teacher came up to me and told me how proud she was of me I knew I wanted to stay on this team until I graduated,” said Narula."}, {"text": "The club’s advisor, Ms. Chelsea Allen shared Narula’s pride in the student panels: “I think the combination of seeing these brave students speak openly about some of their greatest and most personal challenges in the hopes that it would help their school made me so proud.”"}, {"text": "Not only were the panels a meaningful moment for Ms. Allen and Narula, but they also led to one of Campaign Dialogue’s biggest projects to date in 2019. “After that panel was when we came up with the idea of making this Student-Made Teacher Handbook,” said Ms. Allen. “The students didn’t want it to be a one-and-done conversation, they wanted to create and leave a legacy for their school.”"}, {"text": ""}, {"text": "Hassan explained this legacy. “It’s a handbook for teachers, made by students at Campaign Dialogue that teaches them about different issues that students face in the classroom and in life as a whole especially catered to students at our school,” she said. “It discusses mental health issues, LGBTQ-related information, a lot of things basically designed to help teachers be better connected to their students.”"}, {"text": "The first edition of the Student-made Teacher Handbook was released during the 2019-2020 school year and is currently being updated."}, {"text": "“It’s really entirely student driven and we want it to cater to South and its students and have it be as up-to-date and modern as possible so the handbook right now might not look the same as the handbook in ten years or, hopefully, if it’s still around, in 20 years,” said Hassan."}, {"text": "Another one of Campaign Dialogue’s biggest achievements is the creation of Student Unconferences. Student Unconferences were first introduced to South in 2019 and consist of student-led conferences from a range of topics, in which students select two to attend."}, {"text": "“The Student Unconference was created in the hopes that students could connect with peers that have a similar interest who might not otherwise get the chance to meet,” said Ms. Allen."}, {"text": "Another of their projects geared towards developing connections is Narula’s project, the Unspeakables. The Unspeakables is an activity that consists of 8 to 10 students having discussions about “taboo” topics at South. The submissions can be personal or general and they remain confidential."}, {"text": "“We want to create an open environment and open space so that students feel comfortable enough to talk about their experiences, negative or positive, at South and how we can better that,” said Narula. The Campaign Dialogue team will soon be contacting Social Studies and Language Arts teachers in an effort to facilitate this activity during class time."}, {"text": "Hassan is also leading her own Campaign Dialogue initiative this year– the School Schedule Reform project. “We’re trying to reform the school schedule across the district to accommodate for a later start time especially in middle school and high school,” said Hassan."}, {"text": "Not only do Narula and Hassan hope to make a lasting difference in the district, but they also want to inspire other districts to follow suit. “I hope it becomes an example or a role model for other districts and we try and empower students from other districts to take their education into their own hands, take their school environment into their own hands and do something about it if they don’t like it,” said Hassan."}, {"text": "Naula added, “When you want to make a change in the world you always have to start small and as students, working with our community and our school is the first thing that we have to really tackle and take control of when we want to see change.”"}, {"text": "While they hope to be an example, both co-chairs agreed that this role was accidental. “We don’t set out to be that example, we just do what we think is right for our school and we hope that other districts will follow,” Hassan said."}, {"text": "Hassan added, “The team at its heart originally used to be called Campaign Connect and now it’s Campaign Dialogue but before all of that it was the school’s climate and culture team and that’s the biggest part of what our team is.”"}, {"text": "“Everyone is equally as passionate for making a difference at South for the students and the staff and the whole environment,” agreed Narula."}, {"text": "As far as the future of the Campaign Dialogue is concerned, both Hassan and Narula are excited to accept new members at any time."}, {"text": "“It is a safe space where we work on ideas to address specific issues, where everyone is valued and welcomed and where in the process, lots of connections are made,” said Ms. Allen."}, {"text": "Hassan added, “As long as you want to make South a better place, Campaign Dialogue is for you.”"}, {"text": ""}, {"text": "Image courtesy of Ms. Chelsea Allen."}], "file_structural_elements": {"title": "Campaign Dialogue fosters environment of inclusivity", "date": "May 27, 2021", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "Campaign Dialogue’s mission is simple yet overarching: “Everyone who comes in and out of our school — we want to make sure it’s the best environment that we can possibly create for them,” said sophomore Rakiya Hassan.\nLed by co-chairs Hassan and sophomore Mehr Narula, Campaign Dialogue is South’s cl", "image": null}}