{"tree_elements": [{"text": "“Social distancing is essential for the health of our bodies,”  said Vama Deshmukh, co-founder of Yoga Club, “but it’s harmful for our emotional and mental well being.”"}, {"text": "Since last March, students have experienced increased screen time."}, {"text": "“I do think it causes stress,” said Ms. Chelsea Allen, Student Assistant Counselor and Anti-bullying Specialist. “I don’t want to speak for students, but being someone who does talk to students I think that this has been really challenging.”"}, {"text": "Being socially connected helps students learn how to communicate with others which allows them to grow as people. “Well I think going into this quarantine it’s just not normal human behavior. You need to socialize,” said Ms. Jill O’Connell, physical education and health teacher. According to the Canadian Mental Health Association, it is very important to be socially connected because it can help to regulate emotions, lower stress or isolation and lead to higher self-esteem."}, {"text": "Ms. Allen said, “I also think it’ll be such a great thing to be able to hug my mom again or hug anybody. It’s a human connection and it feels good, it releases endorphins. It’s part of most peoples’ pleasure system.”"}, {"text": "Because students aren’t able to spend as much time physically with their friends, they can start to feel lonely. “There are days where I feel great but there are also days where I feel very alone and friendless,” said Deshmukh. “Since we don’t get to see our friends every day, whether it’s during lunch or passing them in the halls, it’s a lot harder to connect.”"}, {"text": "Although students don’t get to see their friends physically anymore, they are finding creative ways to stay connected. “It’s really important to use the opportunity to close the screens and do any type of interaction that you can with your parents or friends,” said Ms. O’Connell."}, {"text": "One tip is participating in activities, such as trivia nights. During trivia nights students play a variety of games to earn points for their grade. Hosted by the Student Council, these are events that give students an opportunity to communicate more with their peers."}, {"text": "Ms. Allen suggested joining a club. “You can see the different clubs that are offered to students and I think that’s another way to connect with your peers over topics you’re interested in and maybe find creative ways to volunteer or help others.”"}, {"text": "Another suggestion is spending time outside, either to take a walk or a bike ride. “Nature really helps,” said Deshmukh. “I was more of an indoors person before quarantine but walking outside gives you a break mentally and physically from the stress of staring at a screen and constantly working.”"}, {"text": "She also suggested doing small things that can help you feel relaxed such as listening to happy music, having an organized workspace, having time for yourself and writing your feelings down in a journal."}, {"text": "According to Sanford Health, keeping a positive mindset can go a long way in getting through difficult times."}, {"text": "Ms. Allen said, “If we have resilience we see positivity and if we’re positive we are certainly reinvigorated and we feel more resilient.”"}], "file_structural_elements": {"title": "Mental health during quarantine", "date": "December 22, 2020", "writer": {"941EjXfebbvxOpIkBLSY": {"name": "Sree Charani Avula", "year": "2022"}}, "description": "\nRelated stories\n Coping with school-related stress during the pandemic\n\nTime management tips for virtual learning\n\n\n\n     “Social distancing is essential for the health of our bodies,”  said Vama Deshmukh, co-founder of Yoga Club, “but it’s harmful for our emotional and mental well being.” \n    Sin", "image": null}}