{"tree_elements": [{"text": "High school is a time to get involved with the student community, explore passions and meet new people. Joining South’s vibrant and vast extracurricular community is a long-held tradition for students across all grades and this year is no different– except we’re still living through a pandemic and so everything is virtual."}, {"text": "Tuesday, Sept. 8 marked the start of the 2020-21 school year for students. In order to maintain social distancing and safety guidelines, clubs are entirely virtual. Even with these pandemic regulations, new clubs have been added to South’s roster."}, {"text": ""}, {"text": "Multicultural Club"}, {"text": "One such club, Multicultural club, is a former South club that was recently revived by junior Donna Nagorny. As club President, Nagorny has reinstated the club to spread awareness of the different cultures at South. Before the pandemic, Nagorny had high hopes of planning an International Food Fest. Despite the setbacks Nagorny said, “The Multicultural club will be up and running shortly, stay tuned!”"}, {"text": ""}, {"text": "American Sign Language Club"}, {"text": "American Sign Language Club (ASL) has already had its first few meetings. Co-President and senior Shira Black designed the club to adapt to virtual challenges and teach students how to sign over Zoom. The club also explores the deaf community. “In our club, we explore the complexities of the deaf community, which are often not acknowledged despite being a large portion of our society, through lessons, fun videos and competitions,” Black said."}, {"text": "ASL club will also feature guest speakers who are experienced with the deaf community or are deaf themselves."}, {"text": "“Learning ASL can be invaluable for becoming more accessible to deaf people, communicating with deaf family members, friends or customers, becoming more competitive as a job applicant, boosting your brain functions and making you a better communicator and listener. Plus it’s really fun to be able to communicate with a friend across the room or even over Zoom without saying a word,” said Black."}, {"text": ""}, {"text": "Village Mentors at HSS"}, {"text": "Village Mentors at South also teaches others virtually. The club is a chapter of Village Book Builders, a non-profit organization dedicated to building libraries in underprivileged villages and virtually mentoring the students there."}, {"text": "As part of the club, “Our members will get the opportunity to mentor students from Ghana, Nepal, Belize, Uganda, Kenya and several other places internationally,” said club President, senior Trisha Murali. “They get to participate in safe fundraising events and lead teams, all to adopt an entire village and fund their education in a place of their choice. They will also get the opportunity to write articles and get their work published.”"}, {"text": "As a result of the new school rules, Village Mentors operates virtually by mentoring and collaborating through Google Meets."}, {"text": "Reflecting on the virtual shift Murali said, “Seeing the smiles of our South students, hearing them laugh and talk to their friends and seeing them walk to catch a bus after is what we all miss, but we all remind ourselves that this is for the safety of the friends we love and the people we want to help through this club.”"}, {"text": "Health Occupation Students of America (H.O.S.A.)"}, {"text": "One of the newest clubs for students interested in health and safety, the Health Occupations Students of America (H.O.S.A.), was co-founded this year by junior Divyanjali Raskonda."}, {"text": "When asked why she co-founded the club, Raskonda said, “As a passionate science student myself, I really want to get into medicine and I’m sure I know many students at South who also want to go into medicine. Our school does have science-related clubs, but not one club that is focused on medicine and what the medical field is.”"}, {"text": "To give students like herself a “taste of medicine” Raskonda and her co-founders started H.O.S.A., a club dedicated to teaching students about medical topics. “H.O.S.A. is basically the M.U.N. of medicine,” Raskonda said."}, {"text": "Students in the club prepare for digital conferences where they take oral and written tests about medical topics. Based on their scores, students are chosen to continue to the next round. “It’s not easy, definitely not easy, but it’s doable. If you understand the concepts and you put in the time and effort and if you’re really passionate about it, you should be able to do really well.” Raskonda added, “Commitment is really important.”"}, {"text": ""}, {"text": "Attitudes in Reverse (A.I.R.) Club"}, {"text": "Attitudes in Reverse (A.I.R.) club, led by senior Elizabeth Nielson, works with the A.I.R. foundation based in West Windsor. “This club’s mission is to create a community of understanding, kindness and empathy through mental health awareness and community service,” said Nielson."}, {"text": "Students may be surprised to find A.I.R. is a lot more than it seems. “A.I.R. is not just an organization with cute therapy dogs,” said Nielson. She added that A.I.R. also raises awareness and mental health."}, {"text": "Given the range of activities students can participate in, Nielsen said,  “If you’re creative, artistic, musical, good at organization or have any other talents” A.I.R. has a place for you!"}, {"text": "Students looking to lift other spirits can join the club whenever they free up time during the school year."}, {"text": ""}, {"text": "Yoga Club"}, {"text": "Students hoping to lift their own spirits, on the other hand, need to look no further than Yoga Club. Founders junior Vama Deshmukh and sophomore Lichuhan (Amy) Chen co-teach and lead club members through relaxing exercises such as yoga, stretching and meditation. “We hope to show that Yoga is about YOU and listening to your body,” said Deshmukh and Chen."}, {"text": "Students can progress at their own pace to achieve emotional stability. Deshmukh and Chen explained, “One misconception about yoga is that it is always very slow but you’re WRONG, the speed you go really depends on you.”"}, {"text": "To accommodate the virtual shift the club will be meeting on Google Meets and will post announcements on Instagram or Google Classroom."}, {"text": "Despite the challenges of digital extracurriculars, students continue to show interest in joining South’s clubs. After taking notes during their Zoom classes and uploading their homework on Google Classroom, Pirates are plugging in to join South’s newest clubs even if it is from their screens."}, {"text": "With the excitement surrounding the reopening of clubs at South, 2020 marks the beginning of a new era of digital transformation and the continuation of South’s beloved after-school traditions."}, {"text": ""}, {"text": ""}, {"text": "*link to='https://flipgrid.com/a3e734f9'*https://flipgrid.com/a3e734f9*/link*"}, {"text": "“We’re not an opportunity just for you, we’re an opportunity for passionate learners worldwide.” Trisha Murali, Senior, President"}, {"text": "*link to='/cdn-cgi/l/email-protection#4d3a3a3d253e3e0d3b2421212c2a2820282339223f3e63223f2a'*[email protected]*/link*"}, {"text": "@villagementors_wwphss (Instagram)"}, {"text": "Classroom code: j427os5"}, {"text": "Regular meeting times: 4-5 p.m. (Tuesdays)"}, {"text": "“Our mission is to make sure that students in the American Sign Language Club are able to hold a conversation with someone by learning the basics of ASL that will allow them to communicate with deaf and hard of hearing people,” Shira Black, Senior, Co-President"}, {"text": "*link to='/cdn-cgi/l/email-protection#b0c7c7c0c3dfc5c4d8d1c3dcf0d7ddd1d9dc9ed3dfdd'*[email protected]*/link*"}, {"text": "@hssaslclub (Instagram)"}, {"text": "*link to='https://wwpsouthasl.wixsite.com/clubsite'*https://wwpsouthasl.wixsite.com/clubsite*/link*"}, {"text": "Classroom code: qobzicz"}, {"text": "Regular meeting times: 3-4 p.m. (every other Thursday)"}, {"text": "“I think it might just surprise new members what the medical field is. People who hadn’t decided to do medicine, after joining HOSA might like medicine because of the topics that they learned, or people who thought they weren’t sure about medicine might quit based on how rigorous or how difficult the topics are.” Divyanjali Raskonda, Junior, Treasurer"}, {"text": "*link to='/cdn-cgi/l/email-protection#cdbababdbea2b8b9a5a5a2beac8daaa0aca4a1e3aea2a0'*[email protected]*/link*"}, {"text": "@wwpsouthhosa (Instagram)"}, {"text": "Regular meeting times: 3-4 p.m. (Mondays)"}, {"text": "“Joining the yoga club and doing yoga can help you achieve better sleep quality.  We hope to show that Yoga is about YOU and listening to your body.” Vama Deshmukh, Junior, Co-Founder and Lichuhan (Amy) Chen, Sophomore, Co-Founder"}, {"text": "*link to='/cdn-cgi/l/email-protection#d8b9aeb9f6a1b7bfb9f6b0abab98bfb5b9b1b4f6bbb7b5'*[email protected]*/link*"}, {"text": "@ ava_hssyogaclub (Instagram)"}, {"text": "Classroom code: o47xi3d"}, {"text": "Regular meeting times: 3:15-4:15 p.m. (Fridays)"}, {"text": "“One thing we would like everybody to know about AIR Club is that we can utilize their talents, whatever they may be! As members of the club, students get to pick which activity/project they would like to work on. They can paint rocks to brighten our community, make dog toys to help raise funds for AIR, and make informative mental health posters to raise awareness (to name a few).” Elizabeth Nielson, Senior, President"}, {"text": "*link to='/cdn-cgi/l/email-protection#debfb7acbdb2abbcf0adb1abaab6f0a9a9ae9eb9b3bfb7b2f0bdb1b3'*[email protected]*/link*"}, {"text": "@airclub.south (Instagram)"}, {"text": "Classroom code: 5ossbvt"}, {"text": "Regular meeting time: 3-4 p.m. (every other Wednesday)"}, {"text": "“There will be virtual presentations from students as well as guest speakers. There will also be some interactive stuff (TBA) and performance/event planning (depending on how quickly the current situation gets better).” Donna Nagorny, Junior, President"}, {"text": "*link to='/cdn-cgi/l/email-protection#4c3f2339382421392038252f392038393e2d202f20392e0c2b212d2520622f2321'*[email protected]*/link*"}, {"text": "Classroom code: Coming soon!"}, {"text": "Regular meeting time: 3 p.m. (Tuesdays)"}, {"text": "Photo courtesy of Shira Black."}, {"text": "Image courtesy of Divyanjali Raskonda"}], "file_structural_elements": {"title": "New clubs at South", "date": "November 3, 2020", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "*For information about the meeting dates and contact details for the clubs mentioned in this article, see the sidebar at the bottom. \n     High school is a time to get involved with the student community, explore passions and meet new people. Joining South’s vibrant and vast extracurricular communit", "image": "https://thepirateseye.org/wp-content/uploads/2020/11/ASL-club-meeting-900x558.png"}}