{"tree_elements": [{"text": "“There are many different organizations that give high schoolers the opportunity to teach kids,” said sophomore Shrindi Dola, astronomy instructor. “But with Project Engage NJ, I get to teach kids something I am passionate about.”"}, {"text": "Project Engage NJ is an organization where high school students are able to become instructors for elementary and middle schoolers in a subject area of the instructor’s choosing. The current hybrid learning model is difficult for students, especially younger students, to grasp the information given in their classes."}, {"text": "Project Engage NJ was established during the pandemic in August 2020, right before the hybrid learning model at school began. Their main goal was to give their K-8 students a more enjoyable online learning experience."}, {"text": "“Project Engage NJ aims to make enrichment courses more accessible to the wider community by offering virtual classes that are completely free and taught by high school students,” said senior Carol Sun, one of the board directors of Project Engage NJ. “All of the courses that we offer are either subjects not taught in schools or taught in a different way from the typical classroom.”"}, {"text": "Unlike the typical core classes taught in school such as math, science, language arts or social studies, Project Engage NJ offers students a wide variety of classes, something for everyone’s interest. These classes include astronomy, journalistic writing, coding, neuroscience, yoga and many more."}, {"text": "“I believe that students should have the resources to learn things that they don’t learn in school or don’t know they can learn about,” said Dola."}, {"text": "Project Engage NJ not only benefits the younger students participating in these classes but also satisfies the instructors and also allows them to pass on their interests to younger children. Currently, there are 20 instructors from all different districts throughout New Jersey with approximately 420+ registrations from 125 families."}, {"text": "The board of directors consists of four South students, seniors Carol Sun and Asta Rossi and sophomores Kiko Yoshihira and Nandika Karnik, who all aim to make a difference in their student’s academic life."}, {"text": "Rossi said, “I decided to join because I thought that this organization had a lot of potential and is a great opportunity not only for myself but also for other instructors and students in our community.”"}, {"text": "Project Engage NJ is still accepting applications for new instructors and officers."}, {"text": "Sophomore Thara Ellsworth, a new member of Project Engage NJ, said, “One of my friends who was already involved in Project Engage NJ introduced me to it and I thought, wow, what a great opportunity. So, recently she let me sit into one session of one of her classes and I was really enjoying it. Then, I got the opportunity to become an instructor for my own class, persuasive writing.”"}, {"text": "Along with daily classes, Project Engage NJ also raises money for the NJ Pandemic Relief Fund (NJPRF). This nonprofit organization donates money to fund child care accessibility, digital connectivity in schools, mental health counseling and aid in restoring women and minority-owned small businesses that have been heavily impacted by the pandemic."}, {"text": "Already, NJPRF has collected over $64 million dollars from 62,000 donors since March 2020."}, {"text": "“We’ve donated about $50 to the NJ Pandemic Relief Fund so far and are very grateful to everyone who has donated,” said Karnik. “We recently were incorporated as a nonprofit in New Jersey and are discussing more fundraising ideas.”"}, {"text": "In addition to NJPRF, Project Engage NJ is also partnering with Snuggles For Children, a nonprofit organization that works with foster children by providing online tutoring sessions and sending care packages. Specifically, care packages include coloring books, stuffed animals, outdoor games, mental health resources and many more."}, {"text": "Not only does this organization bring together students of all ages from a variety of New Jersey school districts and donate to local nonprofit organizations, but the organization also creates a sense of belonging and camaraderie for many of the instructors and board members."}, {"text": "Rossi said, “Overall, I strive to create an environment where they can have fun, connect with others and learn something along the way.”"}, {"text": ""}], "file_structural_elements": {"title": "Project Engage NJ: A spin on online classes", "date": "April 15, 2021", "writer": {"t1wNGC5vCu2m5zKSZgLI": {"name": "Sophia Englezos", "year": "2020"}}, "description": "     “There are many different organizations that give high schoolers the opportunity to teach kids,” said sophomore Shrindi Dola, astronomy instructor. “But with Project Engage NJ, I get to teach kids something I am passionate about.”\n     Project Engage NJ is an organization where high school stud", "image": null}}