{"tree_elements": [{"text": "You’re sitting down on the carpet floor with your friends, laughing as you open your Doritos bag and sip your Caprisun and the noise of others joking around and talking surrounds you. This was how Project Pride meetings used to start before March 16, 2020."}, {"text": "The coronavirus pandemic changed the way clubs functioned in WWPRSD, including those in middle school. One such club is Project Pride."}, {"text": "Project Pride is a club at Grover that runs on Wednesdays and it’s designed to help middle schoolers gain confidence in themselves and be more comfortable with their peers. The group participates in fun activities with high school students that help the members build social skills."}, {"text": "Mr. Zachary Kumor, an advisor of the club, said, “Project Pride is a club that thrives on social interaction between students at the high school and middle school levels. Requiring this club to be virtual certainly limited social interactions to on-screen and also limited us to different activities and attendance.”"}, {"text": "Even though there have been many challenges due to the coronavirus pandemic, the club continues to maintain a structured routine during Zoom meetings. They start off with a group game and then move on to a fun breakout discussion activity."}, {"text": "Co-advisor, Ms. Honour Harrington, said, “Our high school students guide the middle school students in the activity and prompt the students to get them talking.” After that, they come back together to discuss the breakout activity and end off with a funny poll such as, “Which do you like better hot dogs or sandwiches?”"}, {"text": "When asked if the club would be better in person, junior Showrya Bandi, a volunteer for the club, said, “This club is all about coming together and everyone having a great time, enjoying themselves with each other. If this can be done in person, virtually, or in any other manner, it wouldn’t matter to me.”"}, {"text": "Like many other clubs at South, Project Pride has faced a decline in student attendance. Mr. Kumor said, “While we still reached out to as many students as we typically do, many did not check their email for the invites. But the folks who have been coming have been consistent and have made the most of our time!”"}, {"text": "Project Pride organized many activities, such as Christmas gift wrapping for those in need."}, {"text": "When asked “On a scale from 1-10, how much did the coronavirus pandemic affect the club?” the mean of the answers was 6.5. When asked, Daniel Haemmerle, a sophomore volunteer for the club answered 8. He said, “Throughout this year we had to have Project Pride virtually which affected my experience and I believe others as well. It was harder to connect with the middle schoolers and play more interactive and fun games with them. Not only that but going places such as going to Grover during Project Pride and the field trip at the end of the year, we couldn’t do [that. But] although virtual it was still lots of fun.”"}, {"text": "Ms. Harrington said, “I can definitely say that I would enjoy it more in person. I would love to see the high school and middle school students interacting in a physical space but we are grateful we were able to have the club at all this year and think that overall it was a success, given the circumstances!”"}, {"text": "Images courtesy of Mr. Zachary Kumor."}], "file_structural_elements": {"title": "Project Pride during COVID-19", "date": "May 27, 2021", "writer": {"441oJuAOMJ93mb04Urf2": {"name": "Jordan Blaise", "year": "2021"}}, "description": "     You’re sitting down on the carpet floor with your friends, laughing as you open your Doritos bag and sip your Caprisun and the noise of others joking around and talking surrounds you. This was how Project Pride meetings used to start before March 16, 2020.\n     The coronavirus pandemic changed ", "image": "https://thepirateseye.org/wp-content/uploads/2021/05/pasted-image-0-675x900.png"}}