{"tree_elements": [{"text": "The Scholastic Aptitude Test  (SAT) is one of the most tedious and anxiety-inducing experiences for most students in high school and takes up more than three hours on what could be a relaxing, fine Saturday.,."}, {"text": "But maybe the experience doesn’t have to be anxiety-inducing if you knew how to crack the test."}, {"text": "First, we have to understand the SAT."}, {"text": "According to the test prep company the Princeton Review, “The purpose of the SAT is to measure a high school student’s readiness for college, and provide colleges with one common data point that can be used to compare all applicants.” The test happens seven times a year: March, May, June, August, October, November, and December. Starting in 2024, the test will be pivoting from paper to online."}, {"text": "There are four sections on the test, each with different time breakdowns. The reading section is 65 minutes with 52 questions. The writing and language  is 35 minutes with 44 questions. Math is split into 2 sections: non calculator for 25 minutes with 20 questions and then calculator for 55 minutes with 38 questions."}, {"text": "The test is incredibly long and many find it difficult to do well. Luckily, I have compiled lots of resources and tips to ace the SAT."}, {"text": "Many students recommend taking the College Board tests found on Khan Academy. “Do the practice tests and see what you got wrong,” saidKevin Song (‘23). “For most of the ones I got wrong, I went to understand why they were wrong and read the explanations.”."}, {"text": "Khan Academy itself is also super helpful–breaking up each math concept into small chunks so you can target practice a certain concept is something I did routinely."}, {"text": "Reviewing the test to see where you went wrong is crucial as well. Melinda Wang (‘23) said,“After taking each practice test, I took time to review and take notes on problems that were challenging before taking another practice test.”"}, {"text": "Choosing when to prepare and take the final test is also very important. “You shouldn’t start prepping one year before–that’s simply too much. Instead, start two or three months before,” said Song."}, {"text": "Taking the SAT the August before junior year is a good idea.This gives you ample time to retest. The summer is particularly helpful as the school year means juggling school work and preparation for these tests is a handful. But avoid taking the test too early as well — precalculus is great as well as having PSAT practice experience from sophomore year."}, {"text": "Likewise, timing and concentration are important. “Trying a full length test is crucial — doing it separately is different from doing it as a whole, because you get really tired,” said Song."}, {"text": "Wang said, “Be disciplined with your preparation. You will see better results if you consistently practice instead of sporadically cram practice. While sitting down to study for the SAT/ACT may not be the most ideal way of spending time, it will pay off.”"}, {"text": "Test day preparation is also key. Wang said, “On the test day, get sufficient sleep, and eat a good breakfast. Try not to feel anxious and remind yourself that you are prepared and you got this!”"}, {"text": ""}], "file_structural_elements": {"title": "SAT Tips", "date": "November 17, 2022", "writer": {"mmPM0AAOdiQuDZH4MUVF": {"name": "Karen Yang", "year": "2022"}}, "description": "SAT prep books are a huge help. (Renee P)\n     The Scholastic Aptitude Test  (SAT) is one of the most tedious and anxiety-inducing experiences for most students in high school and takes up more than three hours on what could be a relaxing, fine Saturday.,.\n     But maybe the experience doesn’t have ", "image": null}}