{"tree_elements": [{"text": "After watching “The Fosters,” a Netflix show about the lives of foster children, sophomore Nikhil Das was inspired to create a non-profit organization to support foster children."}, {"text": "That idea became Snuggles for Children which launched in June. High school volunteers from New Jersey give support to foster children through much-needed resources and services.  A foster child is a child who is unable to be cared for by their biological family. They live in a temporary foster home until the child can find a permanent home or return to their family, according to the New Jersey Department of Children and Families."}, {"text": "Foster children move from home to home. They stay at a home for a few days or a few years, according to the website FosterMore, a nonprofit organization dedicated to raising funds and awareness for the needs of foster children."}, {"text": "Snuggles For Children provides duffle bags, which are sturdy and have drawstrings to be easily carried around."}, {"text": "“[We] donate duffle bags to help the kids,” Das said. In the duffle bags, Snuggles for Children also includes playing cards, coloring books, stuffed animals and more, to add a personal touch."}, {"text": "“I think those little sentiments and tokens are what makes it [different] from just a bag,” said sophomore Aru Kakar, a director of social media marketing."}, {"text": "To better understand the psychological and emotional impact of the lives of foster children, all board members completed a course from A Home Within, a non-profit organization that provides therapy for foster youth. The Snuggles for Children board directors received online training to understand how trauma affects infants to young adults. Kakar learned that it is important to discuss their emotions and reinforce a feeling of safety. After COVID-19, they are planning to set up stress-relieving activities such as arts and crafts."}, {"text": "Additionally, Snuggles for Children will provide a tutoring service that teaches science and math, as well as the humanities."}, {"text": "The team also hosted a book drive on October 31, raising over 2,650 books."}, {"text": "Both the tutoring service and stress-relieving activities will allow the high school volunteers to have a bonding experience with the children."}, {"text": "“Not only do they have someone to talk to, but they’re also learning new things and are able to develop their own interests,” said Das."}, {"text": "In addition to learning, being able to create a connection ensures that foster children can have a support system. Snuggles for Children has chapters at Rutgers University, Princeton High School, and Monroe. Das notes that their strong teamwork and chemistry was what allowed them to become an influential organization."}, {"text": "“I joined this nonprofit because the team behind this organization is extremely passionate,” sophomore Anish Jha, a manager at Snuggles for Children, wrote on its website."}, {"text": "The organization also sells masks to help support its events. This fundraiser will not only support foster children but also others in the community during this pandemic."}, {"text": "Through its many initiatives and a strong network of students, Snuggles for Children strives to create an impact on the lives of foster children. For more information on Snuggles for Children and their events, visit snugglesforchildren.org"}, {"text": "*link to='https://www.snugglesforchildren.org/contact-us'*here*/link*"}, {"text": ""}, {"text": "Photo courtesy of snugglesforchildren.org"}, {"text": ""}], "file_structural_elements": {"title": "Snuggles for foster children", "date": "December 7, 2020", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     After watching “The Fosters,” a Netflix show about the lives of foster children, sophomore Nikhil Das was inspired to create a non-profit organization to support foster children.\n     That idea became Snuggles for Children which launched in June. High school volunteers from New Jersey give supp", "image": "https://thepirateseye.org/wp-content/uploads/2020/12/119983597_328365781729324_4497893593017251780_n-900x900.jpg"}}