{"tree_elements": [{"text": "The coronavirus pandemic catalyzed a number of major changes to the Scholastic Aptitude Test (SAT), a college entrance exam. The College Board, which organizes and delivers the test, stated on January 19 that in an effort to reduce the stresses of the college admissions process in the midst of a global pandemic, the shorter SAT subject-specific exams would be eliminated in the United States and the standard four-section exam would no longer offer the optional essay component after June 2021."}, {"text": "Standardized testing — once a non-negotiable part of the college acceptance process — has widely declined since the pandemic began. The College Board reports that in 2020 there were 22,000 fewer test-takers compared to 2019. They tried, but were unable, to create a virtual offering of the exam and in-person testing was viewed by many as a risk due to the pandemic. Accordingly, many colleges temporarily eliminated the requirement for students to take the test and submit scores as a factor in their admissions. These changes led the College Board to reconsider the need for supplementary exams."}, {"text": "The SAT Subject Tests are not as widely taken as the SATs. These tests allow students to show their expertise in subjects that are not covered by the standard SAT test, which only has a math section and a reading and writing section. For example, students who study another language can take an SAT foreign language Subject Test, which enhances their college application. Subjects offered also include but are not limited to Biology, Physics, Chemistry, U.S. History and English Literature. Some colleges have specific requirements such as having to take a language in high school, which were previously filled by taking a Subject Test."}, {"text": "“Most colleges did not require the Subject Test,” said guidance counselor Molly Rooney in reference to the popularity of the tests before the pandemic. “But there were some very competitive institutions that did require the Subject Tests as another measure to compare applications.” South students took the Subject Tests for this reason."}, {"text": "“I haven’t applied to college yet (since I am only a junior), but I took the Biology Subject Tests,” said junior Sanjana Chimmaladinne, “because when I researched some of my goal schools, I saw that they recommended taking two.” “I chose to take the biology test because I want to go into medicine in the future. I was planning on taking the Math II Subject Test this year, but now I guess I won’t have to.”"}, {"text": "There are several reasons why the College Board chose to discontinue the Subject Tests, the primary claim being that Advanced Placement (AP) tests are widespread and can showcase specific skills in place of Subject Tests. Additionally, fewer students have taken the SAT Subject Tests in recent years. According to the Washington Post, out of the millions of students in the class of 2017 that took the SAT, only 220,000 took a Subject Test, which was 30% less than in 2011. The students who were planning to take Subject Tests were relieved to hear news of the change."}, {"text": "“Some people are grateful that they won’t have to study for these exams,” said Chimmaladinne, “Now we can pay attention to the SAT itself and the AP tests that are coming up.”"}, {"text": "According to National Public Radio (NPR), another outcome of this change has been an increase in college applications. Now that standardized testing for Subject Tests has diminished in popularity, trends indicate that a higher number of students are applying to more selective institutions than ever before. As stated in an article in the Wall Street Journal, Yale University had a 38% increase in applicants and Harvard University had a 57% increase."}, {"text": "While testing sites overall have become limited because of the pandemic, the changes to the SAT Subject Tests have actually offered more opportunities for the standard administration than before."}, {"text": "“Taking the Subject Tests out of circulation has now opened more seats,” Ms. Rooney said."}, {"text": "Before the pandemic, many juniors and seniors choose to take the SAT Subject Test alongside the standard SAT and/or ACT test. Jaison took the biology SAT Subject Test in the summer after her freshman year because there were colleges that required or recommended it."}, {"text": "“I feel like there weren’t that many people actively studying for them anyways, especially the Subject Test because they’re basically an easier version of APs with just the multiple-choice,” said junior Donna Jaison."}, {"text": "Jaison believes that grades and extracurriculars show a student’s strengths better than the SAT Subject Test."}, {"text": "“They’re over four years and they’re not just based off of a multiple-choice test,” she said, and Jaison is not alone in thinking so."}, {"text": "“In a district like West Windsor-Plainsboro, when our kids, our students are challenged with our rigorous curriculum in the classroom, to me the transcript is the best indicator of success and aptitude in college, not a test,” Ms. Rooney said."}, {"text": "Another change in protocol announced by the College Board is the optional essay. Students were originally given the choice to write an argumentative essay after reading a passage provided by the College Board. Although the essay has been optional, it has also been a requirement for many colleges and more South students took it compared to the Subject Test because they could take it immediately after the SAT."}, {"text": "After June of 2021, the SAT’s optional essay will be discontinued because writing skills can be shown in other ways, such as through the Reading and Writing and Language sections of the SAT."}, {"text": "“The colleges are using the student personal essay, they’re looking at transcript grades, they’re looking at the supplemental essays and they’re seeing that those factors, those touchpoints are better indicators of whether or not a student will be a successful college writer, than that optional essay on the SAT,” said Ms. Rooney."}, {"text": "Removing the optional essay has received a positive response from South."}, {"text": "“I think most of my friends are pretty happy that the essay was gone because most people really only take it in case there is a college that recommends it,” Jaison said."}, {"text": "South students are encouraged by the recent removal of the SAT Subject Tests and the optional essay, a result of the College Board adjusting to reflect the needs of students and colleges."}, {"text": "Ms. Rooney said, “They’re shifting their focus to what current times are really showing us which is: the less testing outside of the school, the better.”"}, {"text": "IMAGE BY KIKO YOSHIHIRA"}], "file_structural_elements": {"title": "South students encouraged by recent SAT changes", "date": "April 15, 2021", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}, "LpDIeLwdu280NdPILdWj": {"name": "Ashna Garikapati", "year": "2020"}}, "description": "      The coronavirus pandemic catalyzed a number of major changes to the Scholastic Aptitude Test (SAT), a college entrance exam. The College Board, which organizes and delivers the test, stated on January 19 that in an effort to reduce the stresses of the college admissions process in the midst of", "image": "https://thepirateseye.org/wp-content/uploads/2021/04/C8B8AA77-5BEB-47E0-A9A4-5E711D682D1B-900x675.jpeg"}}