{"tree_elements": [{"text": "“I have been learning cello for so long,” said junior Melissa Liu, founder and president of the Pitch Out Program, “and it’s just become something that I really value in my life. There shouldn’t be any limits, or anything stopping anyone from learning how to play an instrument, or getting to experience the gift of music.”"}, {"text": "In 2018, a group of South students who love playing music started the Pitch Out Program (POP), a 501(c)(3) non-profit organization to empower musicians. The students hold local performances and free music lessons to spread the joy of music."}, {"text": "“Music can really enhance your mood. It can comfort you, and you can relate to it,” said junior Rebecca Han, vice president of the POP."}, {"text": "Liu reached out to students at South or in local music groups, such as the Veritas Youth Orchestra which held virtual concerts amid the pandemic. Through Liu’s outreach, the POP was eventually able to expand its initiatives across the East Coast."}, {"text": "To fund these initiatives, the POP has partnered with nonprofits and local businesses. For instance, in a music book drive that occurred in September, they collected over 650 books which were donated to the Patterson Music Project and Trenton Music Makers. Some were also kept as supplies for their own organization."}, {"text": "Their book drive received an overwhelmingly positive response from the Patterson Music Project."}, {"text": "“The kids were really excited and really happy to see the books that we gave them,” said Partnership Director Aarushi Thejaswi."}, {"text": "POP members also placed donation boxes in local businesses such as Woo-Ri Mart, Kumon and Romeo’s Restaurant and Pizza. To further empower musicians, they held performances at local restaurants like Tribos Peri Peri in northern New Jersey."}, {"text": "Thejaswi said, “Through that performance we were able to raise over $140 in about one or two hours.” She believes that performances are a great way to fundraise because musicians can show their dedication through time and effort, and these funds allow them to purchase instruments."}, {"text": "In addition to furthering the POP’s mission, the audience is treated to wonderful music."}, {"text": "“When the performance was happening, everyone really enjoyed it,” said Tribos Peri Peri owner Lubna Ismail. “People were definitely moved by the concept behind it.”"}, {"text": "Since the Tribos Peri Peri performance in October, it has been difficult to hold performances in the winter due to the lack of indoor seating during the coronavirus pandemic. Despite the cancellation of a winter concert due to COVID-19, they created a virtual music album."}, {"text": "Additionally, POP music instructors teach music lessons to younger children through video calls. POP found passionate students from all over the district to keep the joy of music in young people’s lives."}, {"text": "“I teach this subject because I enjoy it,” wrote North sophomore Jonathan Huang in an email.  “Through teaching it and preparing for lessons, I learned that I actually know a lot about music.” Huang teaches fifth-grader Shubham Patel who enjoys playing music more now than before when he played for his school orchestra."}, {"text": "“I wasn’t playing a lot. Now I feel I play more,” Patel said. “I am learning what I want to learn and not something else.”"}, {"text": "*link to='https://www.youtube.com/channel/UCuhal4e_shJGGbHD8Nxn--w/videos'*Pitch Out Program*/link*"}, {"text": "Liu said, “I really think that music is a lifelong hobby and an activity that someone can pursue their whole life.”"}, {"text": ""}, {"text": "PHOTO COURTESY OF MELISSA LIU"}], "file_structural_elements": {"title": "The Pitch Out Program: Bringing the joy of music to all", "date": "February 12, 2021", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     “I have been learning cello for so long,” said junior Melissa Liu, founder and president of the Pitch Out Program, “and it’s just become something that I really value in my life. There shouldn’t be any limits, or anything stopping anyone from learning how to play an instrument, or getting to ex", "image": "https://thepirateseye.org/wp-content/uploads/2021/02/Woo-Ri-Mart.png"}}