{"tree_elements": [{"text": "Michelle Obama–First Lady, lawyer, mother, and now author of a memoir, “Becoming,” which is one of the most popular bestselling books of 2018. Though she is a cultural influencer in her own right, her place in the public consciousness is of course linked to her role as First Lady when Barack Obama served two terms as POTUS."}, {"text": "In her memoir, readers experience her rise from a small apartment on the South Side of Chicago to the White House as the First African-American First Lady. “Becoming” allows readers to walk in Michelle Obama’s shoes as she journeys with her husband to make their place in American history."}, {"text": "Currently, she is on a book tour. Her book tour has the same feel as her novel- she manages to make her presence as a national figure feel like an intimate meeting. Over 19,000 people have attended her readings, and, because of her popularity, her book tour has been extended through May."}, {"text": "In this book, she shows vulnerability and shares her views on things she has not spoken out about before, such as how her family’s safety was put at risk when in 2008 Donald Trump popularized birther conspiracy claims about her husband."}, {"text": "She is not new to writing books. Her first book, “American Grown: The Story of the White House Kitchen,” was about creating the White House garden. But her newest book, is more personal and has touched many people’s lives."}, {"text": "Before I started reading this book, I expected the prose to be dry, similar to a history textbook; however, her style was both witty and captivating. While memoirs are often too sentimental for me, Obama’s contained many laugh-out-loud moments, such as her irritation at Barack Obama when he showed up late for his first day as an intern at her law firm or her horrified reaction when she found out he smoked. She also discussed life lessons, such as when she learned about living life to the fullest when her best friend was diagnosed with cancer. Her memoir combines both humor and the serious sides of her life."}, {"text": "When Barack Obama won the presidency, she writes about her reaction, and this allows readers to connect to her as a person. When she and the president-elect drove to the victory parties, she asks: “Did I breathe the air as we stepped outside? Did I thank the person who held open the door as we passed by? Was I smiling?” Her nervousness and every-day manner in which she went through this historic experience shows how human she is; and that she is no different from us."}, {"text": "Obama ends her memoir after her husband’s term as President closes. She thinks about the next chapter in their lives. She says that whatever comes next, their journey to the White House was  “a story we could own.”"}], "file_structural_elements": {"title": "“Becoming:” Obama’s Masterpiece", "date": "March 28, 2019", "writer": {"BEBL4ArsEm9smMlIITfG": {"name": "Namitha Sethuraman", "year": "2018"}}, "description": "     Michelle Obama–First Lady, lawyer, mother, and now author of a memoir, “Becoming,” which is one of the most popular bestselling books of 2018. Though she is a cultural influencer in her own right, her place in the public consciousness is of course linked to her role as First Lady when Barack Ob", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/becoming-610x900.jpg"}}