{"tree_elements": [{"text": "“Bird Box” skillfully combines a stellar cast, a suspenseful apocalyptic plot, and a unique spin off of John Malerman’s book to create a smash hit. On Dec. 13, 2018 Netflix released the movie."}, {"text": "“Bird Box” has a phenomenal cast, including Academy Award winner Sandra Bullock as the protagonist, Malorie Hayes, and Golden Globe winner Sarah Paulson as Hayes’s sister, Jessica. The movie “Bird Box” is set  in a post-apocalyptic world in which the ability to see would lead to death. As a result, the civilians in the movie must wear blindfolds. The protagonist, Malonie Hayes must navigate herself and her children, Boy and Girl, to a sanctuary with only a blindfold as protection from the mysterious forces which create visions of the victim’s worst fears. According to Netflix, “45 million accounts” watched this thriller in the first week of its release. This translates to, “$400 million in box office revenue,” according to ABC news. As a result of the the widespread success and popularity, viewers are eager to create trends associated with the movie."}, {"text": "Immediately after the release of “Bird Box,” Netflix viewers used social media platforms to mimic the dangerous situation the  characters were in. The challenge emerged on social media when Instagram and Twitter users participated with the #BirdBoxChallenge tag. Participants in the “Bird Box Challenge” blindfolded themselves and attempted to navigate through difficult obstacles."}, {"text": "However, the Bird Box challenge rose to a new level of danger when participants began to film themselves driving while blindfolded. Due to the injuries and dangers associated with the “Bird Box Challenge,” Netflix released a statement that said, “We don’t know how this started, and we appreciate the love, but Boy and Girl have just one wish for 2019 and it is that you not end up in the hospital due to memes.”"}, {"text": "As high school students are heavily linked to social media, it is important to understand the dangers in participating in trends with dangerous consequences."}, {"text": "One way the challenge is spreading is through Youtube. For example, on Jan. 12, 2019, a seventeen-year old girl crashed her car in an attempt to drive while blindfolded, according to WSB-TV Channel 2 news, the video garnered over 1,000 views."}, {"text": "Due to the dangers associated with the challenge, YouTube released a new rule that prohibits “content that encourages violence or dangerous activities that may result in serious physical harm, distress or death.”"}, {"text": "Such dangers bring up important questions about whether law enforcement should take further action in restricting users from participating in the Bird Box Challenge."}, {"text": "Sophomore Adithya Sundar, a participant, said about the Bird Box Challenge, “It’s dangerous because you are blindfolded and you can hurt yourself in the process of these daily activities. Even daily obstacles such as furniture can cause you to trip and fall.”"}, {"text": "He said, “I realized it was very difficult to do such simple tasks such as navigating through my house. It’s so easy to get hurt.”"}, {"text": "However, others have approached the Bird Box Challenge more cautiously."}, {"text": "Sophomore Varshini Vimal said, “If you have other friends with you to help, it isn’t as dangerous as it seems. I can understand why it would be dangerous, but most people don’t do anything to a large extent.”"}, {"text": "Vimal refers to the activities in which one can get injured."}, {"text": "It is important to recognize that although internet challenges may seem comical, there is a boundary of safety that cannot be overstepped. As adolescents who frequently use social media for entertainment, we must be cautious with the information we post on platforms like Youtube  so viral trends do not become dangerous. The Bird Box Challenge can help us understand the limit we must set so we can enjoy the trends, but also keep safety in mind."}], "file_structural_elements": {"title": "“Bird Box” challenge enters list of viral, controversial social media activities", "date": "March 28, 2019", "writer": {"": {"name": "Cathy Xiang", "year": ""}}, "description": "     “Bird Box” skillfully combines a stellar cast, a suspenseful apocalyptic plot, and a unique spin off of John Malerman’s book to create a smash hit. On Dec. 13, 2018 Netflix released the movie.  \n     “Bird Box” has a phenomenal cast, including Academy Award winner Sandra Bullock as the protagon", "image": null}}