{"tree_elements": [{"text": ""}, {"text": "Magical creatures, thrilling adventures, Oscar winning actors: “Fantastic Beasts and Where to Find Them” has it all, not to mention it is set in the famous wizarding world of Harry Potter. How could a film like this still be surrounded by so much controversy?"}, {"text": "When J.K. Rowling announced in October of 2016 that there was going to be a spin-off series to the Harry Potter novels, I wondered how a new series would even compare to the captivating adventures at Hogwarts that had stolen the hearts of young and old across the globe."}, {"text": "Rowling had her work cut out for her to produce a film series that could equal the Harry Potter stories in all the qualities that had made it such a popular read."}, {"text": "On Nov. 16 2016, Warner Bros. released “Fantastic Beasts and Where to Find Them,” the first installment of a five part film series. The film is set 70 years before the time of Harry Potter and focuses on the protagonist Newt Scamander, played by Eddie Redmayne."}, {"text": "The main villain in the series was an extremely persuasive and dangerous wizard named Gellert Grindelwald. Briefly mentioned in the Harry Potter series, he was the Voldemort equivalent of this era. The first film provided a back story into the characters and set up a background for what was to follow in the next film."}, {"text": "“Fantastic Beasts and Where to Find Them” received mixed reviews; however, most of them were positive. The long awaited film received a 74 percent on Rotten Tomatoes and a 7.3/10 on IMDb. Many South Pirates agreed that the film was enjoyable, but had not developed a clear storyline. “I loved that we were able to see a different side of the Harry Potter world, but I felt like there was no clear plotline,” said sophomore Joshua Samuels."}, {"text": "On Nov. 16, 2018 the second film of the Fantastic Beasts series was released titled “Fantastic Beasts: The Crimes of Grindelwald.” As a fan of the first film, I was excited and was anticipating the release of this movie."}, {"text": "I remember coming out of the theater amazed after seeing the final credits roll onto the screen. The film had kept me on the edge of my seat, so you can imagine my surprise when I saw the negative reviews the film was receiving. Many were upset by the lack of action the film provided and how the sequel had just left more questions for the viewer."}, {"text": "Some viewers were disappointed by how different the Fantastic Beasts franchise was from Harry Potter. “I came in expecting to feel the same magic that I had felt when I first watched the original Harry Potter films, but I just didn’t feel that this time around,” said junior Shriya  Agarwal."}, {"text": "As an avid Harry Potter fan, I found Rowling’s storytelling capabilities exceptional in this film. Throughout the movie she developed rich and entertaining plots that kept us searching for answers until the last second. Rowling intertwined and connected these intense stories and allowed us to gain a deeper understanding of characters and the bigger conflict at hand."}, {"text": "J.K. Rowling is a writing genius and she doesn’t simply write things to fill up a page or fulfill a word count. Everything she writes, she writes for a reason and those aspects carry symbolic meaning that add to the story as a whole."}, {"text": "It’s time for Harry Potter fans to realize that Fantastic Beasts is not meant to feel like the Harry Potter series. It has magic and charm of its own. What Rowling has done is provide fans with another look into this magical world. These characters are not teenagers at Hogwarts trying to stop Voldemort. Instead, they are adults fighting a fight that is bigger than Good v.s. Evil. Sophomore Lindsay Bizenov said, “I feel like people want every little thing in Fantastic Beasts to be like Harry Potter. But they don’t understand that they are totally different things. They are both set in the same magical world, but with different characters, time periods, plots and conflicts.”"}, {"text": "Those who criticize the Fantastic Beasts franchise are simply unfamiliar with the wizarding world. These films are meant for the fans that fell in love with the magical universe J.K. Rowling created, not just a single character."}, {"text": ""}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "“Harry Potter” versus “Fantastic Beasts” – “Fantastic Beasts” Pro", "date": "January 23, 2019", "writer": {"": {"name": "Varsha Gollarhall", "year": ""}}, "description": " \n     Magical creatures, thrilling adventures, Oscar winning actors: “Fantastic Beasts and Where to Find Them” has it all, not to mention it is set in the famous wizarding world of Harry Potter. How could a film like this still be surrounded by so much controversy?\n      When J.K. Rowling announced", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/suitcase-654x900.jpg"}}