{"tree_elements": [{"text": "“Words in my humble opinion are the most inexhaustible source of magic we have,” said J.K. Rowling, author of the Harry Potter series. As I flipped through page after page, my universe was enveloped with that magic shielding me from the chill of the winter breeze."}, {"text": "Since the release of the first Harry Potter book, Harry Potter and the Sorcerer’s Stone in 1999, the Harry Potter universe has expanded in leaps and bounds. The original series started as a story about 11-year-old Harry Potter, an orphan discovering he was a wizard and the key to defeating Voldemort, the evil wizard. Since then, J.K. Rowling’s magical universe has grown into a multi-series franchise with numerous spin-offs."}, {"text": "“I hope the series goes on forever,” said junior Sarah Johnson."}, {"text": "Most recently, the release of the Fantastic Beasts movie series fans gave fans a way to discover the events before Harry Potter’s life. The second movie of the series “Fantastic Beasts: Crimes of Grindelwald” was released on Nov. 16. The movie develops J.K. Rowling’s Wizarding World, the fictional universe where witches, wizards and muggles (non-wizards) exist."}, {"text": "*link to='https://time.com/4572382/fantastic-beasts-harry-potter-timeline/'*54 years before the birth of Harry Potter*/link*"}, {"text": "“I’m obsessed with Harry Potter” said freshman Sumrudhi Jadhav, mirroring my fondness."}, {"text": "*link to='http://snapshot.numerator.com/brand/harry_potter'*91% of adults between the ages of 45-54 spent money on Harry Potter*/link*"}, {"text": "Sophomore Asta Rossi was introduced to Harry Potter by her parents’ interest in the Wizarding World. It all started when she “walked into the living room and [she] saw a big spider” on the TV screen while her parents were watching “Harry Potter and the Chamber of Secrets.”"}, {"text": "After the spider scene, Rossi left the room, but the experience led to her to read all the Harry Potter books and watch a marathon of all the movies."}, {"text": "Like Rossi, I started the Harry Potter series in an unusual way. I began by reading Harry Potter and the Chamber of Secrets, the second book in the series, before the first and I never found myself lost. The book stood on its own and watching Harry grow up at the same age I was fascinated me so much that I had no hesitations as I flew through the series."}, {"text": "It was this distinct relatability in Harry Potter, that struck a chord. It was the reason that I wanted to see Fantastic Beasts, to learn more about this magical world."}, {"text": "Sophomore Akshata Padalkar agreed, “[I want to see] Fantastic Beasts to find out how everything [in the Harry Potter Universe] started and where it came from.”"}, {"text": "However, unlike the excited Harry Potter fans, viewers who were not familiar with the original series found themselves bored and confused."}, {"text": "“Having some background would have been helpful,” said sophomore Mayank Chauhan. “I regretted not watching Harry Potter.”"}, {"text": "The Fantastic Beasts franchise is a treasure trove of pre-Harry Potter era information, but for Chauhan, who had never read the series or watched the movies, “Fantastic Beasts: Crimes of Grindelwald”  felt confusing."}, {"text": "Chauhan adds that his lack of “background of the magical universe and their powers” led to even the simplest elements of the movie, like magical transportation, “a lot to figure out.”"}, {"text": "Tidbits like Dumbledore’s past held no purpose for new fans of the Wizarding World, making Fantastic Beasts a lackluster franchise that only entertains a niche audience."}, {"text": "Harry Potter’s longevity comes from the idea that anyone can step into the Wizarding World and Fantastic Beasts does not have the range of appeal to cater to this universal audience. It feels like a tacked-on addition to the Harry Potter Universe rather than an expansion of the Wizarding World."}, {"text": "“I’ve watched all the Harry Potter movies and ‘Fantastic Beasts: Crimes of Grindelwald’ fails in comparison to the Harry Potter franchise,” said sophomore Jia Cheng Wang."}, {"text": "“Fantastic Beasts: Crimes of Grindelwald” was an interesting prequel, but only for those of us that already felt at home in this world."}, {"text": "The franchise is not another gateway into the wizarding world, it simply lacks the connection and enchantment of the original series."}, {"text": "The true magic, the spark I felt that winter morning, remains nestled in the pages of Harry Potter."}, {"text": ""}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "“Harry Potter” versus “Fantastic Beasts” – “Harry Potter” Pro", "date": "January 23, 2019", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}, "bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "     “Words in my humble opinion are the most inexhaustible source of magic we have,” said J.K. Rowling, author of the Harry Potter series. As I flipped through page after page, my universe was enveloped with that magic shielding me from the chill of the winter breeze. \n     Since the release of the", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/hp-654x900.jpg"}}