{"tree_elements": [{"text": "One charismatic, empowered woman on centerstage, nine outfit changes, and a squadron of professional dancers made Beyonce’s 2018 Coachella performance iconic. Netflix released “HOMECOMING: a film by Beyoncé,” a concert documentary, about how she made the show come to life."}, {"text": "The film was first announced on April 6, and released on Netflix on April 17. Along with the documentary,  an unannounced album, “Homecoming: The Live Album,” came out on music streaming services."}, {"text": "The album and film captured what made Beyonce’s Coachella set so remarkable: it celebrates the spirited and dynamic halftime shows that Historically Black Colleges and Universities (HBCUs) put on for Homecoming. Moreover, the bright collegiate gear worn by Beyonce references the black Greek letter organizations known as the National Pan-Hellenic Council. All of this came together with ballet and step dancing to create a truly purposeful, energizing moment at Coachella."}, {"text": "Such footage was included in the two hour and 17 minute Netflix movie along with behind-the-scenes glimpses of rehearsals and interviews with Beyoncé, her dancers and her audience. The film explores the very theme of “Homecoming” and the impact that HBCUs have had on black culture and its importance to American culture today."}, {"text": "In the documentary, during one of the first rehearsals, we see Beyoncé encouraging her dancers and talking about the responsibility of representing black culture to people. She says she hopes the Coachella performance “is an experience we remember forever” and is able to“touch people and give them hope and to make people feel beautiful, strong and united.” She expresses her gratitude for what each individual dancer adds to her performance and encourages them to show the audience the vibrancy of black culture."}, {"text": "Dancer Edidiong Emah, originally from Nigeria, said, “[To have] things that black families value up on stage for the world to see and understand us a little bit more, it’s just all a blessing.”"}, {"text": "In addition to the interviews, Beyonce includes voice-overs, clips and quotes from famous African-Americans such as Toni Morrison, Nina Simone, Maya Angelou and W.E.B DuBois. Representing black culture through the voices of such important American figures, Beyoncé also adds in her own voice and music to create a sense of purpose for what she is doing in the documentary and as an artist."}, {"text": "The importance of family to the singer is woven into  the film. She thanks her family for supporting her throughout her career and as a new mother. About 100 days after giving birth to her twins, she starts preparing for the Coachella performance. We see the pressure to move past her post-pregnancy uncertainties and put on a successful performance."}, {"text": "“In the beginning, it was so many muscle spasms and just internally my body was not connected. My mind was not there, my mind wanted to be with my children,” Beyonce says of the physical and emotional challenges that preparation posed."}, {"text": "The scenes of Beyoncé working hard to get back into shape, cutting almost 1,000 to 2,000 calories a day, and learning choreography, paralleled with the triumphant concert footage creates an awe- inspiring experience."}, {"text": "She reflects, “What people don’t see is the sacrifice. I would dance and go off to the trailer and breastfeed the babies, and the days I could, I would bring the children.”"}, {"text": "Beyonce is the first black woman to headline Coachella since the popular music festival began in 1993, and she shares the spotlight with loved ones. During her performance, among the special guests she brings onstage are her husband and rapper Jay Z; former groupmates of Destiny’s Child, Kelly Rowland, Michelle Williams; and sister, singer Solange."}, {"text": "It was personal scenes like these alternating with Beyoncé’s electric concert footage that made the movie “Homecoming” almost equally as successful as the two concerts themselves. Overall, the movie is an insightful glimpse into the hard work that one performer puts in  to bring her vision into her music and stage performance."}, {"text": "Luckily for fans, Beyoncé has a three project deal with Netflix for 60 million dollars, so they can be expecting more inside looks into Beyonce’s career and art."}], "file_structural_elements": {"title": "“Homecoming” documentary: behind the scenes of Beyonce’s iconic performance", "date": "May 21, 2019", "writer": {"bXXGgMig9e1Wk6o1Nt2M": {"name": "Gauri Nema", "year": "2019"}}, "description": "    One charismatic, empowered woman on centerstage, nine outfit changes, and a squadron of professional dancers made Beyonce’s 2018 Coachella performance iconic. Netflix released “HOMECOMING: a film by Beyoncé,” a concert documentary, about how she made the show come to life.     \n     The film was", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/Beyonce-1.jpg"}}