{"tree_elements": [{"text": "“Insatiable,” a blatantly offensive, dark comedy, was released in July as a Netflix original series. The show sparked immediate anger over references to fat-shaming. This did not stop the renewal of this series for a second season."}, {"text": "For a while, it seemed Hollywood was moving away from the stereotypical fat-girl-turns-beautiful plot line with television shows such as “This is Us,” which featured a diverse cast. But “Insatiable’s” warped view on body image counters Hollywood’s progressive culture."}, {"text": "“Insatiable” is set in a high school, so the renewal of a second season raises the question: How will this fat-phobic plotline affect teens?"}, {"text": "“Insatiable” details the glamorous life of the protagonist, Patty Bladell, after she loses weight due to jaw surgery. Since Bladell’s popularity increased after her weight loss, she realizes that  her weight loss was a “blessing.”This reflects a disturbing message to teens that adolescents without a skinny figure will not be happy."}, {"text": "Although “Insatiable” creator Lauren Gussis intended her series to be satirical of the negative high school culture teens face, many viewers were upset over the references to fat-shaming comments."}, {"text": "In response to the controversy, Gussis said, “I think that once people see the show, they will understand how deeply I understand all of the things they’re actually upset about.”"}, {"text": "However, Gussis’s attempt to spread a positive message through satire was missed  by viewers who were offended by fat-shaming remarks, including by the central character."}, {"text": "At Bladell’s first day of high school after her dramatic weight loss, Bladell says, “I could be the former fatty who turned into a brain or an athlete or a princess.”"}, {"text": "Bladell’s careless comment implies that anybody with a large body type can only be viewed as “fat” and unsuccessful."}, {"text": "Many high school students have strong opinions about“Insatiable’s”  plot line."}, {"text": "Varshini Vimal, a sophomore, said, “I just feel that the jokes they make to show ‘satire’ fall flat because of how dismissive the characters are about Patty’s eating disorder.”"}, {"text": "After Bladell’s jaw surgery, she says that she refused the option of eating solid food, which resulted in her weight loss. Even before Bladell’s jaw surgery, the show mocked binge-eating with different fat-phobic slurs targeted towards Bladell. Although the intent of the show was to provide a reason for the weight loss, a more problematic message is sent to people struggling with body-image."}, {"text": "Specifically, the show depicts Bladell trying healthy ways to lose weight but failing; however, when she doesn’t eat after her jaw surgery, she loses a significant amount of weight."}, {"text": "“I think that Netflix is such a good platform to send a positive message, especially to high school students,” Vimal said, “and painting the character as overweight and shameful conforms to the stereotypes Hollywood is starting to avoid.”"}, {"text": "Even though the show misses the mark of spreading the message on body positivity, some South students have found beneficial messages in the series."}, {"text": "“I do find parts of the show problematic,” sophomore Aaheli Konar said, “but in a way, the controversial parts of ‘Insatiable’ inform us of the unrealistic ideas and images portrayed in Hollywood.”"}, {"text": "Since many viewers of Netflix shows consist of high schoolers, putting such a controversial show on a media platform geared for impressionable teenagers has detrimental effects that hits close to South."}, {"text": "Chelsea Allen, South’s student assistance counselor, said, “I think it walks a really thin line on glamorizing something and bringing attention to the concerns and safety issues around it,” Allen said."}, {"text": "In high school, especially, body image is a defining part of how students view themselves around their peers. Creating a character like Bladell who is only skinny because she is glamorous or shameful because she is overweight is superficial and sends the wrong message to many teenage girls, including at South, on the ideal body type."}, {"text": "Most importantly, Allen felt the show portrayed a woman’s self-image dependent on a woman’s body type. Allen continued and said,  “I think to show these associations that are so obvious, it sends a pretty controversial message.”"}, {"text": "With the arrival of a second season, I am hopeful that the show will center on a more positive message on body-image and Bladell’s journey to finding a healthy lifestyle."}, {"text": "Bladell did not have a reliable confidante to share her struggles with before she lost weight.  At South there are many resources that can help students are struggling with body-image issues or eating disorders."}, {"text": "“As a counselor in high school, I recommend finding an adult that you trust.” Allen said, “I will specifically name Mrs. Hayden and Mrs. Fitzpatrick as helpful people to talk to.”"}, {"text": "“Insatiable” does not just have to be the series we condemn and then move on from.  It can be an opportunity to spread positive awareness on body image and reflect on the boundaries between satire on superficial high school culture and fat-shaming."}, {"text": ""}, {"text": ""}], "file_structural_elements": {"title": "“Insatiable” misses mark with controversial fat-phobic plot line", "date": "November 14, 2018", "writer": {"": {"name": "Cathy Xiang", "year": ""}}, "description": "   “Insatiable,” a blatantly offensive, dark comedy, was released in July as a Netflix original series. The show sparked immediate anger over references to fat-shaming. This did not stop the renewal of this series for a second season.\n     For a while, it seemed Hollywood was moving away from the st", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/Insatiable.png"}}