{"tree_elements": [{"text": ""}, {"text": "Does coral, the color of cherry blossoms, really represent the year of 2019?"}, {"text": "On Jan. 1, Pantone LLC chose “living coral” as the color of the year. Coral, as stated by their website, “[E]mbraces us with warmth and nourishment to provide comfort and buoyancy in our continually shifting environment.”"}, {"text": "Pantone LLC is an American fashion and interior design company based in Carlstadt, NJ that is best known for studying colors and provide expertise in what colors to use in workplaces. For the past twelve years, they have been following the tradition of choosing a color of the year."}, {"text": "Colors play an important role in our lives. 75 percent of South students claim that they feel a particular emotion when they perceive colors."}, {"text": "“We have certain associations with a color; certain emotions help us understand something,” said Melissa Hilton, a Language Arts teacher at South. “Just like when I say ‘they are feeling blue’ people understand that they are not literally blue, but that the person is feeling sad.”"}, {"text": "Colors are used frequently in literature too. “Typically, authors use colors to help shape the mood,” said Michael Novak, a Language Arts teacher at South. “Darker colors tend to foretell something and are pretty ominous; meanwhile, lighter colors tend to portray happier times.”"}, {"text": "Coral is a hue which lingers between pink and orange on the color wheel. It represents a relaxing, warm feeling. Pantone chose this color to represent 2019 because of the loss of face-to-face contact and emotional connection between people due to the rise of social media. According to Pantone, as the color “welcomes and encourages lighthearted activity,” it also brings people closer. This, they hope, will lead to people building a sense of community, which is the goal of 2019."}, {"text": "Although 65.6 percent of South students agree with Pantone’s claim, some students do not. “This year is starting out kind of cold and it’s had a rough takeoff,” said freshman Seher Talukdar. She said that the color of the year “should provide a jumping point for more changes.”"}, {"text": "She explained that a brighter color like yellow would be a better choice as it would signify “awareness.” Along with the shades of red, orange and yellow, students and staff of South also chose cool colors to represent the year. Cool colors such as blue and green evoke a relaxed feeling as they remind us of running water or flowing grass.  This contrasts with warm colors like red, which reminds us of the warmth provided by a fire."}, {"text": "For Ms. Hilton, “An optimistic, happy color like turquoise or a nice shade of lavender would describe this year.” She said that it was because her first year at South has been very “amazing” so far due to the supportive staff and the students she has."}, {"text": "There are as many views on what the color of the year should be as there are shades of color. Should “living coral” really be the color of 2019, or is there another shade in the spectrum of colors that you think represents this year?"}], "file_structural_elements": {"title": "‘Living Coral’ named Pantone’s color of 2019", "date": "March 28, 2019", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": " \n     Does coral, the color of cherry blossoms, really represent the year of 2019?     \n     On Jan. 1, Pantone LLC chose “living coral” as the color of the year. Coral, as stated by their website, “[E]mbraces us with warmth and nourishment to provide comfort and buoyancy in our continually shiftin", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/living-900x603.jpg"}}