{"tree_elements": [{"text": "“Music” has become one of the most controversial movies of 2021."}, {"text": "“Music” was released on Feb. 10 and stars breakthrough actors, like 18-year old dancer and actress from “Dance Moms” Maddie Ziegler, Golden Globe winner Kate Hudson and American singer and actor from Hamilton, Leslie Odom Jr. The film is directed by world famous, Oscar-nominated singer Sia."}, {"text": "As an avid fan of Sia, I was eager to see her new movie with Ziegler. Sia and Ziegler have worked on several projects together, their most recognized being their 2014 music video “Chandelier,” which became the seventh most watched music video on YouTube the year it was released and won several awards. They also worked together on other popular music videos like “Elastic Heart” (2013), “Big Girls Cry” (2014), and “The Greatest” (2016). Because of their successful collaborations, I was looking forward to seeing the movie “Music” and assumed it would receive positive reviews from critics."}, {"text": "Instead, the movie was met with controversy that erupted around the representation of both autistic and nonautistic characters. This controversy escalated after Sia released her first trailer for the movie on her YouTube channel and posted on Twitter to advertise the movie on Nov. 19 last year. The comments on both the YouTube video and the Twitter post were instantly filled with comments focused on Ziegler’s portrayal of Music, the autistic main character."}, {"text": "Critics said Sia gave her lead actress very few resources to accurately depict her autistic character and so actress Ziegler, who is neurotypical (that is she does not display signs of autism or other atypical patterns of thought or behavior) studied documentaries about autism and watched YouTube videos by parents who had recorded their child having an episode. Critics argue that this alone is not enough to accurately portray a child with autism."}, {"text": "The movie opens with Kazu “Zu” Gamble, a newly sober drug dealer who is left in charge of her younger autistic half-sister Music after the death of Music’s grandmother Millie. One morning, Music has a meltdown when Zu struggles to braid her hair and her neighbor, Ebo, comes to help calm Music down. With Ebo’s help, Zu learns how to take care of Music but she continues to sell drugs to support herself financially."}, {"text": "At the end of the movie, Zu brings Music to an adoption center but can’t bring herself to leave her there. Throughout the story, musical dance sequences take place in Music’s head because this is how she sees the world."}, {"text": "Although the plot was interesting and the music videos and dance scenes were fun and easy to sing along with, I couldn’t help notice how oddly bright and “flashy” the overall atmosphere of the scenes were. It was difficult to look at the screen at times because the lights were so vibrant, the colors extremely saturated and the actors’ facial expressions loud and over-the-top. In short, the scenes were overwhelming."}, {"text": "According to the National Center for Biotechnology Information, many autistic people have a hard time adjusting to harsh stimuli like overly bright colors and lighting. This, in addition to the overexaggerated facial expressions of the lead actress Ziegler, could indeed cause people with autism to feel upset with the movie."}, {"text": "According to South’s Learning Consultant Lorri Moser, autistic representation in media “is not helpful if they overgeneralize the features of autism and portray it in a negative light.”"}, {"text": "Ms. Moser said, “You have to keep an open mind and remember that anything portrayed in a movie could be created for the sole purpose of being interesting and not always accurate.” In other words, Ziegler’s portrayal of Music should be viewed with the idea that it might not be entirely accurate to the real life of an autistic individual."}, {"text": "In addition, Sia’s comments on social media added fuel to the fire. Instead of accepting the idea that it would have been better to depict autism differently by casting an autistic actress and also less visually stimulating dance performances, Sia defended her actions on Twitter and kept silent about any issues regarding her casting choice and the way she chose to portray autism."}, {"text": "I found it upsetting that this movie turned out to be executed so poorly, considering it actually had an interesting plotline and upbeat songs. As of now, Sia has deleted her Twitter account and sent out an apology, saying that her approach to the movie “isn’t quite ableism,” but critics are adamant that the damage has already been done."}, {"text": "Moser said, “People can always learn about autism by reading and researching on their own. The best experience would be taking time to meet people with autism, whether in a school setting or through fundraising for a local school that provides services for students with autism.”"}, {"text": "IMAGE BY KIKO YOSHIHIRA"}], "file_structural_elements": {"title": "“Music”: Why the controversy?", "date": "June 19, 2021", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "     “Music” has become one of the most controversial movies of 2021. \n     “Music” was released on Feb. 10 and stars breakthrough actors, like 18-year old dancer and actress from “Dance Moms” Maddie Ziegler, Golden Globe winner Kate Hudson and American singer and actor from Hamilton, Leslie Odom Jr", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/Screenshot-130.png"}}