{"tree_elements": [{"text": "“Patriot Act with Hasan Minhaj”, the first comedic talk show with an Indian-American host is breaking boundaries between comedy and political commentary."}, {"text": "Hasan Minhaj, a Peabody-Award winner and former “Daily Show” correspondent, was given the Netflix original series, “Patriot Act”, after his success with his Netflix comedy stand-up special Homecoming King and after he hosted the White House Correspondents dinner in 2017."}, {"text": "Since the first two episodes released last October 28, the show has received a lot of recognition for its innovative style and ingenious combination of comedy with hard-hitting news."}, {"text": "The show has managed to change the confines that most late-night hosts abide by.  Minhaj’s stage is surrounded with screens that present information on them. Also instead of sitting on a desk like most talk-show hosts, Minhaj enthusiastically gesticulates around the stage throughout each 24 minute episode."}, {"text": "Also, unlike most talk show hosts each “Patriot Act” episode revolves around a certain topical issue, which Minhaj describes as a “woke TED Talk.” The first episode was about Affirmative Action and appealed to a largely Muslim and Indian demographic. Minhaj often appeals to this demographic as many of his jokes and references are centered around his Muslim Indian identity and his immigrant parents."}, {"text": "For many Muslims and Indians in America, Minhaj is seen as a representative for the community. There are few Indian actors in Hollywood. According to the UCLA Hollywood Diversity Report, only 1.4 out of 10 lead actors are minorities."}, {"text": "In a “Patriot Act” digital exclusive called “Deep Cuts,” Minhaj responds to being asked how it felt to be in the forefront of the “brown come up” or era of the rise of South Asians in Hollywood. In the video, Minhaj reiterated the sentiment that there is a lack of minority, especially South Asian, representation in American media."}, {"text": "“I’m like the sixth most famous Indian-American,” he said as the audience chuckled. “But it’s so cool. There are a lots of really, really cool artists that are coming up and it’s really exciting.”"}, {"text": "At South, which has a 66 percent Asian student population, many Indian students are appreciative of the affirmation of their identity and experience. Junior Sanya Tejwani said, “In Hollywood, I feel like there’s not that many South Asian American actors or comedians in general so he’s definitely taking a big step.”  She added that “it’s nice to have someone making jokes that appeal to you.”"}, {"text": "Tejwani said that even if she wasn’t Indian, she would still watch the show as it is not “solely for Indian people.”"}, {"text": "Senior Jennifer Li agreed, “There are moments I’ll be sitting there and he’ll be telling a joke and I don’t know what he is saying but the good thing that he does is that he makes sure that the joke that only appeals to the Indian demographic doesn’t go on for a really long time.”"}, {"text": "Senior Varsha Ayyalapu noted that the show is also great representation for minorities in general. “A lot of it is based around how it feels to be a minority in the States and how the cultures clash.” Besides popularity among minorities and South Asians, the show also appeals to audiences because of its innovative combination of humor and the need for political and social awareness. Li said, “I’m not a big news person but I do think it is important to be socially aware. So “Patriot Act” is a good way to become socially aware through a different means: by fusing comedy and news.”"}, {"text": "Before the release of the show, a “New York Times” article predicted that the potential for this show might be limited. “New York Times” journalist, Dave Itzkoff wrote, “Maybe there’s no way for topical comedy to succeed on streaming TV and maybe Minhaj is doomed before he starts.”"}, {"text": "Hasan Minhaj’s ability to talk about difficult and extremely relevant topics has lead to his success because of his comedic style and vision of creating a platform that is humorous yet educational."}, {"text": "Junior Swati Warier said, “I love comedians and I love watching comedy specials and I think [Minhaj] is a really good one. He knows how to tell jokes and he knows how to do it in a way which is enlightening and funny.”"}, {"text": "For now, seven episodes make up the first season. The show will continue to release its weekly informative comedic presentations after the new year."}, {"text": ""}, {"text": "IMAGE COURTESY OF WWW.WIKIPEDIA.COM"}], "file_structural_elements": {"title": "“Patriot Act with Hasan Minhaj” exceeds expectations", "date": "January 23, 2019", "writer": {"bXXGgMig9e1Wk6o1Nt2M": {"name": "Gauri Nema", "year": "2019"}}, "description": "      “Patriot Act with Hasan Minhaj”, the first comedic talk show with an Indian-American host is breaking boundaries between comedy and political commentary. \n     Hasan Minhaj, a Peabody-Award winner and former “Daily Show” correspondent, was given the Netflix original series, “Patriot Act”, afte", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/Hasan-minhaj-778x900.jpg"}}