{"tree_elements": [{"text": "On a warm autumn evening, people take their seats alone, in pairs, in threes, in groups, quickly filling the auditorium. When the heavy theater curtains part, a light shines on Birdie Hendrickson (‘23), the lead actor, as they walk onto the stage. “The Curious Savage” is announced through the microphone and the story begins."}, {"text": "Performed in the playhouse from Nov. 17-19, “The Curious Savage” tells the story of “normal people’s” greed and materialism contrasted with “crazy people’s” warmth and loyalty.  The “crazy people” in the play are a group of psychiatric patients in a sanatorium called the Cloisters."}, {"text": "Written by John Patrick, an American playwright, the play premiered on Oct. 24, 1950, at the Martin Beck Theatre in New York City. The play lasted 31 performances in total, according to Playbill."}, {"text": "“The Curious Savage” follows Mrs. Savage’s journey in the Cloisters. Mrs. Savage, a kind and accepting blue-haired woman in her late 60s, has recently lost her husband. Hendrickson showed a breathtaking sweep of emotions in their portrayal of Mrs. Savage."}, {"text": "At the start of the play, Mrs. Savage is introduced to the psychiatric patients in the sanitorium. Her late husband left no money to his children, only to her. She intends to give the money to strangers who have no inheritance but have a dream to pursue. Her greedy stepchildren who want the $10 million for themselves put her in the Cloisters so she can “come to her senses”."}, {"text": "When she first arrives, Mrs. Savage feels suffocated in the Cloisters because people are hostile to her. She grew up in a wealthy environment where everything was done for her, so the sanitorium is a very different place. As the story progresses, Mrs. Savage learns about each of the patient’s traumatic pasts. The patients begin to find comfort in her presence, and she begins to reciprocate their feelings."}, {"text": "Even though Mrs. Savage’s eager step-children continue to demand money, the friends she makes at the sanitorium help her realize that not all people are greedy. At the end of the play, Mrs. Savage is declared sane."}, {"text": "High school dramas like “The Curious Savage” serve a purpose bigger than to entertain. For example, they create more possibilities for students."}, {"text": "“I think it’s really important for the people who are more artsy at our school and don’t get that chance to shine,” said Rachael Kapoor (‘23) who played Lily Belle, the obnoxious step-daughter of Mrs. Savage."}, {"text": "It also allows students who may not be as interested in partaking in the arts to enjoy a good show. As Hannah Shue (‘26) said, “It gives [South] something to look forward to.”"}, {"text": "Behind the scenes, an amazing amount of effort is put into the play to ensure the best performance. Since September, cast members have spent long hours after school memorizing lines and practicing scenes. During tech week, the week prior to opening night, the cast would spend at least six hours every day of the week practicing, making sure everything was perfect."}, {"text": "“It was really fun, but sometimes I was just like ‘I wish I could sleep a full eight hours,’” said Kapoor."}, {"text": "South theater persevered through all the bumps and curves they faced in producing the play and was able to overcome them through teamwork. The theater program continues to delight our family with a remarkable experience from beginning to end."}, {"text": ""}], "file_structural_elements": {"title": "“The Curious Savage”", "date": "January 6, 2023", "writer": {"nzWe67TLOyFH0NU0m5Q8": {"name": "Tiffany Lu", "year": "2022"}, "941EjXfebbvxOpIkBLSY": {"name": "Sree Charani Avula", "year": "2022"}}, "description": "     On a warm autumn evening, people take their seats alone, in pairs, in threes, in groups, quickly filling the auditorium. When the heavy theater curtains part, a light shines on Birdie Hendrickson (‘23), the lead actor, as they walk onto the stage. “The Curious Savage” is announced through the m", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/DSC_0409-900x603.jpg"}}