{"tree_elements": [{"text": "*link to='http://www.eleanorburgess.com/'*Eleanor Burgess*/link*"}, {"text": "After seeing her play “The Niceties” at McCarter Theatre on a Language Arts field trip, we decided we absolutely had to write an article about the riveting drama. It was thought-provoking, bold and intelligent- the kind of play that makes you want to make the world a better place."}, {"text": "Talking to the person behind the curtain was a long shot, but thanks to McCarter Theatre, we were getting the opportunity."}, {"text": "As we pressed the call button, we could not help but be a little intimidated. When we heard a friendly “hello,” we introduced ourselves."}, {"text": "“I’m Eleanor, but you probably already gathered that,” Burgess laughed, dissipating our anxiety all at once. In the background, we could hear the rush of airplanes taking off, the PA system making announcements and the usual airport hubbub."}, {"text": "*link to='http://www.eleanorburgess.com/bio'*Burgess*/link*"}, {"text": "“The Niceties” is her most recent work. It has been produced at multiple venues nationally including McCarter Theatre and directed by Kimberly Senior. The play ran from Jan. 11- Feb. 10 at McCarter."}, {"text": "“The Niceties” is set in an elite northeastern university and features a young African American college student, Zoe Reed (Jordan Boatman), caught in an intense crossfire of wits with her history professor, Janine Bosko (Lisa Banes), who is an expert on the history of revolutions."}, {"text": "Zoe visits her professor’s office hoping to get feedback on her history research paper about the American Revolution in which she poses the thesis that the American Revolution did not fail because it was carried out while slaves were being oppressed."}, {"text": "Janine, the professor, remarks that Zoe’s thesis is not supported by credible evidence and that experts in the field do not treat the American Revolution in relation to slavery."}, {"text": "The conversation between professor and student ranges from logical and even-toned to emotional and angry, both expressing their ideas about who gets to tell our stories. Zoe and Janine battle through racial prejudice, the generational divide between them and the power dynamics between their respective position as professor and student. Their conversation ends with a clap of thunder and no resolution."}, {"text": "*link to='https://www.nytimes.com/2015/11/09/nyregion/yale-culturally-insensitive-halloween-costumes-free-speech.html'*culturally unaware and insensitive*/link*"}, {"text": "University lecturer and Associate Head of Silliman College at Yale, Erika Christakis responded with an email supporting students’ right to free speech and free expression. In response students addressed an open letter to her, claiming her email supported cultural appropriation."}, {"text": "Christakis resigned after an explosive encounter between her husband Nicholas Christakis, former Head of Silliman College and a large group of students."}, {"text": "Burgess recalled over our phone interview, “I was struck by the fact that my friends couldn’t have a successful conversation about the protests. They took sides and the sides quickly led to fighting.”"}, {"text": "Her friends’ behavior was eye-opening. She said, “Smart people who are very well meaning, who want to be good people and make the world a better place, ha[d] so much trouble talking to each other.”"}, {"text": "Burgess recorded her conflicted thoughts in a notebook. The ideas in this notebook became the foundation of the play."}, {"text": "“I write to understand things,” Burgess explained. “I write about things that confuse me, I write about things that trouble me, topics where I really thought I knew what I believed and then someone said something that shook me down to my core and all of sudden I realize that maybe I don’t know what I believe.”"}, {"text": "Burgess said that her notebooks were written in dialogue form featuring two distinct voices that inspired the creation of the characters Zoe and Janine.  She explained, “Depending on the day, depending on the headline I’m reading, depending on the mood I’m in, I agree[d] with a very different [character].”"}, {"text": "She added that despite the fact that “Zoe is black, Janine is white, Zoe is 20, Janine is 60,” for Burgess the play is about their philosophical differences."}, {"text": "“Janine is someone who believes because her life has taught her this, that you can slowly win over a person or institution that is hostile to you,” Burgess said. On the other hand, Zoe declares on stage, “I just want to scream and yell and I want to tear down the way things are because the way things are is awful and I don’t trust them.”"}, {"text": "To Burgess, both claims are “a valid way to look at” the inequality for minorities in America."}, {"text": "“I think both my characters are on to something because I tend to be interested in writing about when two people disagree and I can see where both of the people are coming from and yet they totally don’t get along.”"}, {"text": "To better understand their perspectives, Burgess explained, “One line in the play that I really agree with is ‘We can’t always agree but we can believe that people feel the way they do and that they have reasons for feeling that way.’”"}, {"text": "“A lot of what you talk about is going to be emotionally loaded in a very different way for very different people,” said Burgess, “If it’s not race it can be gender, it can be family, it can be religion. We all have areas where it’s very hard to hear someone discuss them cavalierly.”"}, {"text": "“We understand each other less and less, we agree with each other less and less, we empathize with each other less and less […] we haven’t found a way to the other side […] we haven’t come through on that side,” she commented."}, {"text": "Accepting other perspectives helps open up the truth. An example Burgess gives is the reference to ‘peccavi’ in “The Niceties.” In the play, Janine references Indian colonial history. In 1843, General Charles James Napier conquered a province called Sindh in northwestern India and sent back a telegraph to the government in England with a single word: “Peccavi.” This is Latin for “I have sinned,” a pun that Jeanine explains to Zoe while chuckling."}, {"text": "However, Burgess said, “[T]he funny thing about this story is that this story is incorrect. It never happened. That story of peccavi originated as a joke in a British humor magazine, Punch.”"}, {"text": "The truth of this story has been so muddled it is now written in textbooks and is believed to be an actual historical event. Burgess added, “So you can read a textbook and believe it’s true. But it’s not. So it’s part of that theme in the play of what is true. How do you know? It’s what becomes the story. What can you rely on?”"}, {"text": "When it comes to our opinions and the opinions of others, Burgess urges that “[y]ou should write it down, you should explore it, you should share it with people you trust” as a way of opening up conversations."}, {"text": "Despite the difficulties, Burgess has faith in the idea that there is still power in writing and talking about these issues."}, {"text": "“If we really really do our jobs well, we can add truth to the world.”"}], "file_structural_elements": {"title": "“The Niceties” playwright Eleanor Burgess asks, “Who gets to tell our stories?”", "date": "March 28, 2019", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}, "bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "     Imagine us: two high school journalists about to make a phone call for an interview with the nationally known playwright Eleanor Burgess. We were as excited as we were nervous.  \n     After seeing her play “The Niceties” at McCarter Theatre on a Language Arts field trip, we decided we absolutel", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/niceties-color.jpg"}}