{"tree_elements": [{"text": "“The Hate U Give” is a tear-jerking film set in Queens, New York that explores the effects of institutionalized racism in today’s law enforcement."}, {"text": "Before I watched the movie, I read the book by Angie Thomas. The novel is riveting and a must-read."}, {"text": "“The Hate U Give” is a story about a teenage girl named Starr Carter, played by Amandla Stenberg, who lives two lives: one dictated by the black community in which she lives, and the other dictated by the posh private school she attends in a white neighborhood. Khalil, played by Algee Smith, is a childhood friend. One day, they are in a car together and Khalil is driving. A police officer is behind them and they pull over to the side of the road. Starr is a witness to the police officer shooting Khalil."}, {"text": "According to policeviolencereport.org, in 2017, “Black people were more likely to be killed by police, more likely to be unarmed and less likely to be threatening someone when killed”"}, {"text": "In the movie, after Khalil’s shooting, we see the emotional and mental turmoil Starr and Khalil’s families experience."}, {"text": "For Starr, the shooting is the catalyst that turns her into an activist: she fights for Khalil’s justice."}, {"text": "In one scene, Starr’s father sits with her and her siblings to give them “The Talk.” “The Talk” is a conversation most African American parents have with their children about what to do if they ever get pulled over by a cop. In an interview with National Public Radio, the director of the film, George Tillman Jr., explained that “The Talk” is  the reality of institutionalized racism, particularly in law enforcement, that the African American community lives with.“The Talk,” Tillman said, is about “survival and how we can continue to stay on this earth without police brutality or being shot or being killed.”"}, {"text": "Sophomore Sanaa Acharya said the movie was eye opening and “highlights the conflicts we have in society about race and violence.”"}, {"text": "The movie has received mostly positive reviews. Jessica Kiang of Variety magazine described the movie as a “brilliantly modulated balancing act between . . . white privilege mined for pointed laughs and black fury portrayed as a galvanizing force for change.”"}, {"text": "This coming-of-age movie leaves you feeling empowered and ready to declare war on racism."}], "file_structural_elements": {"title": "“The Hate You Give” tackles real-world problems on the big screen", "date": "January 25, 2019", "writer": {"uCLiBSNVw88B8cvjzOCS": {"name": "Naqsh Mitra", "year": "2018"}}, "description": "     “The Hate U Give” is a tear-jerking film set in Queens, New York that explores the effects of institutionalized racism in today’s law enforcement. \n     Before I watched the movie, I read the book by Angie Thomas. The novel is riveting and a must-read. \n     “The Hate U Give” is a story about a", "image": null}}