{"tree_elements": [{"text": "Imagine a world where everyone can live forever. If an injury occurs, such as a broken arm or a gash on the head, the damage is healed within five minutes. A world in which if you die, you are revived within three days. But here’s the catch: To keep the world population in balance, while you can live forever, you can also be killed at any minute."}, {"text": "“Thunderhead,” by Neal Shusterman, is a terrific continuation of the novel “Scythe.” Sophomore Tinney Mak explained that the series is a “futuristic world in [the] form of science fiction and fantasy.”"}, {"text": "I rate the novel four out of five stars. “Thunderhead” perfectly captures the ups and downs of a dystopian society. Shusterman ingeniously develops the storyline. Sophomore Jesse Cheng described the book as “a world where nothing is perfect” making “it interesting how the protagonist acts.”"}, {"text": "The title “Thunderhead” refers to the database where every person’s information is kept and collected. Future medical technology in this dystopian series gives people the ability to live forever. However, with immortality comes a price- a group of people labeled Scythes, control the population through lawful executions."}, {"text": "“Thunderhead” explores the theme that “deaths exist for life to have meaning.”"}, {"text": "Scythes act as Grim Reapers and have a ring that grants people of their choosing immunity from death for one year."}, {"text": "It’s never good to be on the bad side of a Scythe since they have the power to choose and kill anyone. This isolates the Scythes from other people."}, {"text": "“The novel uses the term “glean” in order to replace “kill” and lighten the burden Scythes have. The word shows the definite line between the everyday people and Scythes. However, with this immense power to kill, some Scythes run rampant, abusing their abilities and hurting others."}, {"text": "In the first novel, “Scythe,” Citra and Rowan, who are Scythe trainees, battle each other to become a Scythe. “Thunderhead” picks up the story when Citra becomes Scythe Anastasia. She assumes the responsibility of execution, while Rowan runs from the other Scythes who hunt him down."}, {"text": "Problems arise when people question the morality of Scythes. Are the Scythes taking advantage of their role in society? And more importantly, are the gleanings immoral and misused?"}, {"text": "After I read the novel, I thought the plot was exciting and suspenseful. Such as the scene when Rowan evades the other Scythes while, unbeknownst to them, literally hiding under their noses."}, {"text": "Rowan evades even the highest powers in the Scythedom by simply disguising himself as a janitor. While referring to the great Scythe and leader of all Scythes, High Blade Xenocrates, he says, “Come now, Your Excellency, there hasn’t been a terrorist in hundreds of years. I’m just a janitor cleaning filth from dark corners.”"}, {"text": "“Thunderhead” perfectly captures the individual struggles of Citra and Rowan as they gain a new perspective of the Scythe realm. Citra’s struggles are her inner turmoils with the broken rules of the Scythe killings and Rowan’s are other Scythes who search for him."}, {"text": "When Citra chooses a Scythe title, she says, “I choose to be known as Scythe Anastasia after the youngest member of the family Romanov, she was the product of a corrupt system.” She makes this reference to explain how the Scythe world is corrupted and it won’t change who she is just like the Grand Duchess Anastasia."}, {"text": "The plot of “Thunderhead” was written at a steady pace, making it easy to follow and understand. Shusterman inserts all the necessary concepts with relatable characters."}, {"text": "He uses Citra and Rowan to show the corruption in the Scythe world while also keeping their own personalities and morals consistent."}, {"text": "Citra and Rowan develop from being naive to being aware. The corruption in the Scythe world changes them to be more mature."}, {"text": "Although the novel provided an enjoyable read with a strong storyline, like other dystopian novels, “Thunderhead” emphasizes the idea of the inevitable as it says, “that what comes cannot be avoided.”"}, {"text": "“Thunderhead” allows the characters to develop and the readers along with them. Just like Citra and Rowan it’s not always bad to go against the current."}], "file_structural_elements": {"title": "“Thunderhead” explores immortality and corruption", "date": "March 28, 2019", "writer": {"L2tabycjXwSAHtJCW6yQ": {"name": "Grace Choe", "year": "2019"}}, "description": "     Imagine a world where everyone can live forever. If an injury occurs, such as a broken arm or a gash on the head, the damage is healed within five minutes. A world in which if you die, you are revived within three days. But here’s the catch: To keep the world population in balance, while you ca", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/thunderhead-785x900.jpg"}}