{"tree_elements": [{"text": "“I don’t think words can describe how excited I was to watch this year’s Super Bowl,” said freshman Jaanvi Kumar."}, {"text": "After a long period of quarantine and virtual learning, students and staff were looking forward to the 55th Nation Football League’s (NFL) Super Bowl on Sunday, Feb. 7. In addition to the national competition, there is the iconic Super Bowl Halftime Show in Tampa, Florida."}, {"text": "In the past three years, artists such as Shakira and Jeniffer Lopez, Travis Scott, Big Boi and Justin Timberlake have performed at the Halftime Show. This year, The Weeknd performed at the Halftime Show."}, {"text": "“I think The Weeknd is a very talented singer and he has an amazing voice,” said freshman Veer Sehgal. “He knows how to make a viral song and he has music that everyone will like.”"}, {"text": "Junior Yasmine Husseini agreed. “Most of his performances are exciting to watch, especially because his new music has big messages about Hollywood and the effects of the industry,” said Huss. “He never fails to impress.”"}, {"text": "Some believe that his music style was an unusual pick for the Super Bowl Halftime Show."}, {"text": "“The only thing is that his music’s overall vibe is a bit more mellow than what you would typically expect for a halftime performance, except for the song ‘Blinding Lights,’” said world history teacher Sydney Miller."}, {"text": "Kumar also had suspicions about the performance. “I can’t tell if he will live up to how elaborate the previous performances were since I don’t think he has a large fan base,” said Kumar."}, {"text": "The day after the Super Bowl, his fan base did become larger."}, {"text": "Husseini said, “Honestly, his performance was out of this world on so many different levels. My favorite part was the many clones of himself all scrambling around to paint a picture in our heads.”"}, {"text": "She added, “Their costumes also enabled wearing masks since their faces were completely covered, which was also a big plus!”"}, {"text": "But some people felt let down by the performance."}, {"text": "Kumar is one of them. “It just didn’t meet up to my expectations and did not come anywhere close to past performances such as Shakira and Katy Perry,” she said. “Plus, his microphone was terribly low, which only made him hard to hear.”"}, {"text": "2021 has been a most unusual year and the Super Bowl was bound to be different."}, {"text": "Sehgal said, “Considering the pandemic, The Weeknd’s performance will forever be one of the greatest in history. I look forward to seeing all that he does in the future and, more so, the Halftime Performances in upcoming years!”"}], "file_structural_elements": {"title": "2021 Super Bowl Halftime Show review", "date": "March 11, 2021", "writer": {"yCkJnR93m7cf2NvYleFK": {"name": "Mahek Upadhyay", "year": "2020"}, "NOlffvh7x2ouyJpAMrkO": {"name": "Arishtha Dey", "year": "2021"}}, "description": "     “I don’t think words can describe how excited I was to watch this year’s Super Bowl,” said freshman Jaanvi Kumar.\n     After a long period of quarantine and virtual learning, students and staff were looking forward to the 55th Nation Football League’s (NFL) Super Bowl on Sunday, Feb. 7. In addi", "image": null}}