{"tree_elements": [{"text": "Bangtan Sonyeondan or BTS, the biggest K-pop (Korean pop) boy band in the world, is on fire."}, {"text": "Their recent releases “Butter,” “Permission to Dance,” and “My Universe” have all debuted on the Billboard 100. Spotify and YouTube streams of all three songs broke into the billions. And BTS is not stopping anytime soon."}, {"text": "Their hit songs “Butter” and “Permission to Dance” are sung in English and “My Universe” is predominantly in English."}, {"text": "Junior Ruchita Jegan explained, “I think they’re singing more in English because of their huge international fan base. I’m so proud of them for learning and singing in English just for us.” RM, the group leader, is fluent while most members are learning English."}, {"text": "Senior Rebecca Han said, “When the songs were in Korean, radio stations would only play them a couple times, but when they were in English, they were played much more.”"}, {"text": "Junior Anahita Roy said, “I believe that they wouldn’t have personally agreed to releasing music that’s all in English, but after all, they are part of an entertainment industry where there is a lot of pressure.”"}, {"text": "No matter the language of their songs, some ARMY (Adorable Representative M.C. For Youth–what BTS’s fan base calls themselves) are unwavering in their devotion."}, {"text": "Han said, “They speak Korean, they are Korean, they eat Korean food, they live in Korea, and they sing plenty of songs in Korean. A couple of English songs are not going to change that.”"}, {"text": "Their past discography shows their Korean roots: their November 2020 album was entirely in Korean, other than their hit “Dynamite” and a mixtape released by SUGA, a member of BTS, that is also completely in Korean."}, {"text": "According to Roy, their new music is different from their old music. “Their old music had a lot of deep meanings, and I feel like BTS was able to represent and convey their feelings more through that music.”"}, {"text": "Jegan said, “While their newer songs have less ‘deep’ lyricism compared to their older songs, I don’t think that’s necessarily a bad thing. The whole point of their newer songs is to comfort and heal others.” She added, “They never stick to one genre and that’s what makes them amazing.”"}, {"text": "BTS’s genre expansion and entry into the western market has garnered them more widespread attention."}, {"text": "“K-pop has definitely become more mainstream,” said junior William Liu. He describes himself as someone who does not listen to BTS on a regular basis, but enjoys the song “Butter.”"}, {"text": "Many fans are just happy growing alongside BTS, which started in 2013, when the youngest member, Jung Kook, was sixteen."}, {"text": "“I also think it’s so cool that I learn so much by being an ARMY,” said Han. “I would not have known anything about how the music industry works and I love how BTS is breaking boundaries in not just America, but all over the world.”"}], "file_structural_elements": {"title": "A “Butter”ful crack at the American Market:  BTS’s latest song releases", "date": "November 9, 2021", "writer": {"mmPM0AAOdiQuDZH4MUVF": {"name": "Karen Yang", "year": "2022"}}, "description": "Bangtan Sonyeondan or BTS, the biggest K-pop (Korean pop) boy band in the world, is on fire.\nTheir recent releases “Butter,” “Permission to Dance,” and “My Universe” have all debuted on the Billboard 100. Spotify and YouTube streams of all three songs broke into the billions. And BTS is not stopping", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Screen-Shot-2021-11-09-at-1.05.45-PM-900x664.png"}}