{"tree_elements": [{"text": "*link to='https://thepirateseye.org/2118/culture/a-day-in-the-life-of-a-virtual-student/'*A day in the life of a virtual student*/link*"}, {"text": "At 7 a.m. my alarm blares. As I stumble out of bed to get ready for school, I scroll through my emails and glance at my work desk to check my class notes and homework before my day starts. After finishing breakfast, I check how many minutes I have before my first class and I go through my schedule for the day ahead."}, {"text": "Although this schedule may seem typical for a high school student, during the pandemic instead of rushing to my bus stop, I will be logging onto Zoom."}, {"text": "For many students, the coronavirus pandemic has called for a series of unprecedented changes in education and afterschool activities. According to NJ.com, over 400 school districts in New Jersey started the school year with hybrid learning and 242 districts started the year with all-remote learning."}, {"text": "At South, students and staff follow a virtual/hybrid model. In hybrid learning, students attend their first four classes in person before returning home to complete their last two classes virtually. Hybrid students have a two-week cycle in which they follow the hybrid model for one week, while the other week consists of synchronous, virtual learning."}, {"text": "On the other hand, virtual students attend all classes virtually over Zoom. What follows is the experience of a virtual student’s typical day."}, {"text": "As a virtual student who attends classes from my room, my daily schedule inevitably differs from South students who follow a hybrid model. While hybrid students and teachers wear masks and socially distance, I watch the classroom I would otherwise be sitting in through my computer screen."}, {"text": "Despite the different locations between hybrid and virtual students, classes begin every morning at 7:40, when we log onto Zoom."}, {"text": "While classes for the first hour are an extra ten minutes so hybrid students and staff can get their temperature taken, the format of classes are still similar to an in-class setting. Despite having online classes, I still take quizzes and complete assignments, have small-group discussions. I still communicate with my peers through breakout rooms,"}, {"text": "Before quarantine, five minute breaks in between classes were for getting from one class to another. Especially when my classes were on opposite ends of the school, it was difficult getting between classes during the five minute breaks pre-quarantine. Now, the breaks in between my classesI usually use for t tasks such as getting water or preparing notes for my next class."}, {"text": "Most classes are similar to the actual classroom environment.Breakout rooms help replicate group activities and teachers can share their lessons through the shared screen function."}, {"text": "Workouts for Physical Education have become more independent, with various new activities and opportunities such as completing a workout on PLT4M, an app that provides lessons on different exercises such as ab workouts or squats, or choosing from a list of activities assigned on Google Classroom. Typically, I choose ab workouts or stretches so I can exercise in my room."}, {"text": "Because of the independent nature of gym classes, I can devise my own workout plans from the options provided by the gym teachers. Personally, I enjoy going on walks around my neighborhood or running on my treadmill."}, {"text": "After my morning classes, instead of travelling back home, I log off of Zoom and directly transition to a one-hour lunch break. Since I no longer see my friends in person, I take time to FaceTime with them so we can catch up and talk about our day. Because of the limited options for social interaction,  FaceTiming has become an important and necessary part of my daily routine."}, {"text": "At 1:15 p.m., I log back onto Zoom to complete my two 45-minute afternoon classes. Because the afternoon blocks are shorter than the typical hour-long class, school goes by quickly."}, {"text": "After my last class of the day, I try to go outside and exercise to get a break from my computer screen. By taking time for myself between classes and homework, I find that when I go back to working on my classes, I am more efficient and can focus on my classwork."}, {"text": "Because I am not in school and I have more independence in between classes and during lunch, I can organize my time more effectively, maintain contact with my friends and find new exercises to stay active. Even after school, I have learned how to organize my schedule so I have more time to relax, spend time with my family and catch up on books or television shows."}, {"text": "Despite the shift to online learning, we can all find a positive in our “new normal.”"}, {"text": ""}], "file_structural_elements": {"title": "A day in the life of a virtual student", "date": "December 7, 2020", "writer": {"5ZZyMhdJyIdn45SwdcwV": {"name": "Catherine Xiang", "year": "2020"}}, "description": "\nLife during COVID-19 series\nA day in the life of a virtual student\n\n Freshman year during COVID-19\n\n\n\n     At 7 a.m. my alarm blares. As I stumble out of bed to get ready for school, I scroll through my emails and glance at my work desk to check my class notes and homework before my day starts. Aft", "image": null}}