{"tree_elements": [{"text": "Beep, Beep, Beep! My 6 a.m. alarm rings obnoxiously, reminding me that my bus will leave with or without me at 7:11 a.m. Groaning, I throw my covers off and start my day. I brush my teeth, pack my Chromebook and loop the straps of my mask around my ears."}, {"text": "Though the last part of my morning routine is an uncomfortable addition, it is a necessary one for going to school in person during the pandemic. To see my teachers and peers and to make meaningful connections with them makes this uncertain time just a little bit brighter."}, {"text": "WWPRSD is among more than 400 districts that kicked off the school year with a hybrid option for students, according to NJ.com. Hybrid students follow a schedule so that they come to school in-person every other week. When in the hybrid week, students spend the first four periods in school, leaving school at 12:05 p.m. for lunch. In the afternoon, there are two 45-minute classes. As any current sophomore, junior and senior would know, this is different from last year’s schedule, where there were three classes before and after lunch."}, {"text": "After I get on my bus, it journeys to the Penn Lyle Road side of South. As I approach the school entrance, I can see a line forming in the glass vestibule entrance, where the security aids, Jim Carvalho and Lloyd Oertal, are taking the students’ temperatures with non-contact infrared thermometers."}, {"text": "Following my daily temperature check, I pass commons one, where students are sitting at desks six feet apart. What once was a lively area full of round tables inviting you to socialize with friends is now nearly silent ."}, {"text": "Once I enter my designated classroom, I say good morning to my teacher, as usual, and the one or two other students in class.  I open my Chromebook and log onto Zoom. Right before the lesson starts, the PA announcements inform us about absent teachers and special events happening later in the day."}, {"text": "After those announcements, the teacher uses the share-screen feature on Zoom to play the daily Pirate News Network broadcast (PNN) senior and Student Council President Vinayak Nair announces new clubs, virtual events, various other extracurricular opportunities and, of course, the Joke of the Day. Today, the joke, submitted by freshman Aaryana Yenuga, was “Why doesn’t Elsa have a balloon?” Answer: “Because she will let it go!” The teacher then greets all virtual and hybrid students on Zoom and gives the directions for the day’s work."}, {"text": "During class, I either work independently or I am placed in a breakout room. This essential feature provides students with an opportunity to connect and work with their classmates. I try my best to help and cooperate as I see the teacher’s effort to make the class more interactive: for example, I turn my camera on as often as I can and participate in discussions."}, {"text": "Once my first class ends, I have five minutes to sanitize my workspace by wiping it down with a liquid disinfectant and get to my next class. If some of my teachers’ classrooms, both former and present, are nearby, I swing by to say hello. Even a simple greeting and check-in could make their day as it makes mine."}, {"text": "If my teacher is absent, either I work independently on Google Classroom, or the teacher teaches remotely. In both cases, I need to go to substudy. Unlike pre-pandemic school, when substudy was in one of the four commons, substudy is now located in the old gym, where the desks are spaced six feet apart. Once I settle in the area with my class, I log onto Zoom and the class begins."}, {"text": "However, there is one class that really differentiates virtual and hybrid studies: PE. While the virtual students have their independent workouts and submit a screenshot of it by the end of class, my in-person classmates and I have a variety of activities planned out in class. Sometimes, the workout could be a yoga class or a walk outside and other times it can be my choice between golf or badminton."}, {"text": "After my last in-person class, I briskly walk to my bus and head home for lunch. It takes anywhere from 10-15 minutes to get home. After I drop my backpack off in my room, I quickly prepare some food and join my friends on FaceTime to have lunch together."}, {"text": "The afternoon classes go by relatively quickly. After the last period, I typically attend a club, meaning I stay on the computer screen for one or more hours. And after all my extracurriculars are done, I am thoroughly exhausted. So, I try to have a snack or talk to my family to catch a short break before my homework."}, {"text": "After completing assignments and studying for quizzes and tests, I finally have a few hours to myself. Before getting ready for bed, I typically read, write or spend some time with my family to finish my day off on a good note."}, {"text": "Because of this schedule, I am far more weary than I ever was. Screen fatigue has become a daily nuisance for me and has resulted in homework becoming more time consuming. Even though I have more flexibility with time, computer issues have made this a more difficult experience, leaving me hoping for the end of this pandemic."}, {"text": "Luckily, WWPRSD has enacted Screen-Free Wednesdays. Every Wednesday until Dec. 16 is to be a half day (until 12:05 p.m.) and all classes will be shortened to 40 minutes. Students are, “encouraged to close their Chromebook and spend the afternoon participating in activities away from their computer screen,” according to the WWPRSD website."}, {"text": "Despite all this, the hybrid experience has taught me to be more independent with my learning, more comfortable around computers and more responsible with my time management. Additionally, it has challenged my communication skills, as connecting with people over screens is not as simple with lag and eye strain. Moreover, this kind of experience has shown me some of the positives of partially in-person and partially virtual instruction: more flexibility with time and more room in a schedule for activities."}], "file_structural_elements": {"title": "A day in the life of a hybrid student", "date": "December 7, 2020", "writer": {"q6Q38H1MOB4iX1yvzBi4": {"name": "Dahria Charadnichenka", "year": "2020"}}, "description": "\nLife during COVID-19 series\nA day in the life of a virtual student\n\n Freshman year during COVID-19\n\n\n\n     Beep, Beep, Beep! My 6 a.m. alarm rings obnoxiously, reminding me that my bus will leave with or without me at 7:11 a.m. Groaning, I throw my covers off and start my day. I brush my teeth, pac", "image": null}}