{"tree_elements": [{"text": "The murders of George Floyd, Breonna Taylor, Ahmaud Arbery, Tony McDade and far too many others are tragedies that have played out over four centuries in the United States of America.  These tragedies are the result of generations of inhumane treatment, racism and injustice in America. Racial injustice has seemed intangible and daunting to solve."}, {"text": "Two WWPRSD high school students realized that it was a long past time to address the deep, systemic and structural inequalities by starting with their community. In April 2020, high schoolers Denia Smith and William Dory united with those calling for safety, dignity, opportunity, reform and justice and the West Windsor-Plainsboro People of Color Advocacy (POC Advocacy) was born."}, {"text": "The POC Advocacy has already spread roots throughout the community, collaborating with other student organizations such as the North and South Black Student Unions as well as the schools’ climate teams. After months of planning, collaborating and growing as a group, the organization has held multiple successful community events and established itself as a fresh force fighting for social progress in the school district."}, {"text": "As a chair for the POC Advocacy’s Programming Committee, I’ve immersed myself in the work of the organization and witnessed our progress first hand and becoming a powerful body wasn’t a process that took place overnight. In order to gain a deeper understanding of the youth advocacy building process, I sat down with co-founders Denia Smith,  junior at South and William Dory, a senior at North, to take an inside look at how the POC Advocacy began and how it’s developing."}, {"text": "What sparked the creation of the WWP POC Advocacy?"}, {"text": "Denia: I believe that our organization was born as the result of numerous incidents of race-based discrimination in WWP. Many students have expressed that they’ve experienced such incidents throughout their academic careers, but little to no action occurred as a result. Thus, when the Tik Tok incident occurred in April 2020, students from High School North and South met to discuss their initial reactions and how we can build a more anti-racist and conscientious school district."}, {"text": "Will: When students organized informally to discuss the events that took place, we decided that there were actionable steps that needed to be taken to foster a more inclusive and accepting environment for BIPOC students."}, {"text": "Denia: The impermissible experiences of racial prejudice expressed during our meetings ultimately gave birth to the spark that became the WWP POC Advocacy."}, {"text": "How did you decide that creating an organization would be the best way to enact change?"}, {"text": "Will: At first it just started as an action plan. However, we knew that to enact the type of change that our community really needed, it would take the support of our peers."}, {"text": "Denia: After we presented our Action Plan to administrators at WWP North, South and Dr. Aderhold, it was evident that we needed the support of students to enact our initiatives. The WWP POC transformed from an action plan to an organization after our membership drives during the summer and winter. We welcomed 80 ardent and assiduous students to work within our Policy, Education and Programming Committees and it has been an honor to work alongside them all."}, {"text": "What are some of your proudest moments from the POC Advocacy thus far?"}, {"text": "Denia: I’m immensely proud of the racial sensitivity event hosted by our Programming Committee. I was amazed by the experiences, perspectives and opinions shared by both students and staff. Both parties began to foster a mutual understanding’s testimonies and worked together to bridge the gap between each other pertaining to topics of race and racism. As we continue to have these conversations, I’m confident that students and staff will continue to work together to make WWP schools more equitable for all BIPOC students."}, {"text": "Will: There are definitely an abundance of proud moments but I think receiving an honorable recognition from the West Windsor Township Council for the work we’re doing in our community towards combating hatred, bigotry and racism is another important one."}, {"text": "What has been your favorite part of the organization thus far?"}, {"text": "Denia:  My favorite part has been providing opportunities for BIPOC students to become advocates for change. We’ve been able to give students a platform to discover the power in their voice, connect with like-minded students and vocalize their concerns to their peers and staff. More importantly, moreover, is the community we’ve built amongst our members. It’s been wondrous connecting with so many people of various backgrounds and being able to invite high school (and soon middle school students) to join the family."}, {"text": "Will: My favorite part has to be listening to others. The perspectives I’ve gained from students, parents, teachers etc. has been incredibly eye-opening. It’s a privilege for people to confide in us and it comes with the responsibility that we’re going to work our hardest to address their concerns. Every action our organization takes is grounded in the experiences both good and bad of our community."}, {"text": "What are some of the challenges you face in leading a youth organization?"}, {"text": "Denia: Unfortunately, some people may oppose our initiatives, making it slightly challenging to garner widespread support for our work. However, we’ve viewed this not as a hindrance but as an opportunity. We’ve sought to work alongside individuals with different perspectives and beliefs to ensure that our initiatives will positively impact the entirety of the WWP community to the fullest extent."}, {"text": "Will: I look at our organization as one composed entirely of leaders. We’re students who are involved in many aspects of our school and township community so we’re all pretty busy students but regardless of those challenges we make time for what’s important and the POC Advocacy is incredibly important."}, {"text": "What are some of the events and projects that you are currently working on and planning to implement?"}, {"text": "Will: Arguably one of the most important projects we’re transitioning towards is preparing to formally present our Anti-Racist Action Plan to the school district."}, {"text": "Denia: For Black History Month, our Education Committee is currently composing a booklist and resources for grades K-3 and 4-5 on African American History. The Programming Committee is also planning to host an event discussing Black History Month soon. We’re also looking to invite middle school members to join the WW-P POC Advocacy’s Development Team."}, {"text": "What are the long-term goals of the organization? What do you hope to see in the future as a result of the WW-P POC’s work?"}, {"text": "Denia: Our long-term goals include presenting our Anti-Racist Action Plan to both students, staff and the Board of Education and gaining its approval. Afterward, we plan to work within our committees to implement the plan and ensure that it’s adhered to by students and staff. In the future, we hope to see inclusivity and equity embraced throughout the West Windsor-Plainsboro Regional School District through apparent modifications/implementations in school policy, curricula and programming. We hope that through the enactment of the WWP POC’s initiatives, our dream of a more just and equitable society will come to fruition."}, {"text": "What is some advice that you would give students that plan to embark in similar journeys with youth advocacy or youth activism?"}, {"text": "Denia: I would advise students to take a leap of faith. Youth activism/advocacy may appear to be a very time-consuming task; however, so long as you’re committed to combating a specific issue or injustice, you can accomplish anything. I also want to emphasize that it will take a lot of time when getting started. Don’t rush the journey; remain calm, motivated and steadfast."}, {"text": "How can interested students get involved with the organization to be a part of the change?"}, {"text": "*link to='https://forms.gle/jTL42wPozuK5QWQk8'*here*/link*"}, {"text": "Images courtesy of William Dory and Denia Smith."}], "file_structural_elements": {"title": "A look into the POC Advocacy Group: Q&A with Co-founders Denia Smith and William Dory", "date": "March 12, 2021", "writer": {"LpDIeLwdu280NdPILdWj": {"name": "Ashna Garikapati", "year": "2020"}}, "description": "     The murders of George Floyd, Breonna Taylor, Ahmaud Arbery, Tony McDade and far too many others are tragedies that have played out over four centuries in the United States of America.  These tragedies are the result of generations of inhumane treatment, racism and injustice in America. Racial i", "image": "https://thepirateseye.org/wp-content/uploads/2021/03/17A78B32-47E3-4452-AD5D-D5201510F900-900x720.jpeg"}}