{"tree_elements": [{"text": "The shrieking sound of missiles from the sky seems worlds apart from the Mad Hatter’s tea party, but Alice by Heart is a novel that creatively ties the two together."}, {"text": "Originally an off-broadway musical, Alice by Heart debuted in London in 2012. The musical was adapted as a young adult novel by Steven Sater, who was also the lyricist and scriptwriter of the musical and published in the United States in February. The novel often references Alice’s Adventures in Wonderland, a novel written by Lewis Caroll."}, {"text": "The novel takes place in the London bombing raids of World War II. When Alice Spencer’s friend Alfred is quarantined for tuberculosis, Alice denies his condition. She attempts to heal him by retelling their favorite story, Alice’s Adventures in Wonderland. Like Alice and Alfred, other children have become stranded from their families, and they all take shelter in a make-shift sanctuary in a subway station. In Alice’s story, she and these children each represent fictitious characters. For the children, imagining Wonderland is an escape from the traumas of war."}, {"text": "In a video Q&A session with the musical cast, Steven Sater said that the musical, Alice by Heart is really about the power of the imagination, to get us through the hardest times.”"}, {"text": "Alice’s imaginary Wonderland helps her forget the bleak, war-torn world. Yet at times, these same childish hopes blind her of the truth about Alfred."}, {"text": "For example, around the middle of the book, she insists on continuing the story even when he tells her: “Alice, stop […] This isn’t just some silly game. I have no time left ‒ not for this.” Even when Alfred is weak, Alice cannot accept that he is dying, and instead, she spends time with him in their imagination."}, {"text": "Throughout the story, the sound of sirens and missiles frequently interrupt daily life. During these moments, the novel reveals how terrifying the war is, especially for children separated from their families."}, {"text": "Children are often sent away from London in hopes of survival and demolished homes leave people nowhere to live. Although these scenes are violent and sad, I’m glad that the author revealed the shocking effects of war through a child’s perspective."}, {"text": "Even though this book has many appealing aspects, there were moments where I found it difficult to read. Specifically, it was hard to keep track of Alice’s present and imaginary worlds, along with her frequent flashbacks to her childhood."}, {"text": "Despite the confusing structure, the overall plot was creative, and I liked the illustrations and photographs of real children during World War II who were in the same situation as Alice and Alfred. All in all, I recommend this to anyone who has a preference for historical events with a tip of the hat to a work of classics."}, {"text": ""}], "file_structural_elements": {"title": "A Modern Twist on Wonderland", "date": "May 18, 2020", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "  The shrieking sound of missiles from the sky seems worlds apart from the Mad Hatter’s tea party, but Alice by Heart is a novel that creatively ties the two together.\n     Originally an off-broadway musical, Alice by Heart debuted in London in 2012. The musical was adapted as a young adult novel by", "image": null}}