{"tree_elements": [{"text": "“We’re returning back to normalcy,” said Assistant Principal Ernie Covington."}, {"text": "From a global perspective, this year was one with historical significance as the world emerged from three years of the COVID-19 pandemic and events once again resumed."}, {"text": "The most important series of events this year that impacted the world was the gradual lifting of COVID restrictions, like social distancing and masking."}, {"text": "Starting this year, with cases beginning to drop and vaccinations increasing, social distancing and travel restrictions were  lifted and people are beginning to return to their old lives."}, {"text": "At South, the effect of a gradual return to normalcy is apparent to teachers and students."}, {"text": "Mr. Brad Borsuk, social studies teacher, said, “As a teacher, it’s been one of the best years since COVID.”"}, {"text": "Speaking of the end of  the mask mandate, he said, “I feel like I know my students better. I recognize them in the hallways. Before everyone was dressed like bank robbers.”"}, {"text": "With Covid-19 restrictions loosening, international events resumed."}, {"text": "From Feb. 4-20, the Winter Olympics were held in Beijing, China with athletes from 91 countries participating in the multi-sport international event."}, {"text": "This was the first of its kind in over two years. But it was not one without controversy, as China’s human rights record was questioned by the international community."}, {"text": "Yet that didn’t take away from the amazing show of competition, kindness and sportsmanship. People from all over the world tuned into these games, amassing a total viewership of two billion individuals, according to the International Olympic Committee website."}, {"text": "Other events scarred our world. On Feb. 24, Russia launched a full-scale invasion of Ukraine, according to CNN. This marked the beginning of major conventional warfare on the European continent. The Russian invasion drew sharp international condemnation."}, {"text": "Reflecting on the war in Ukraine, Mr. Borsuk said, “That’s been an unfortunate war that didn’t need to happen. And it’s causing all sorts of ripple effects.”"}, {"text": "Although millions have fled the country, Ukrainians have not given up fighting to protect their country."}, {"text": "2022 also marked a return of the film industry. Released on May 27, Paramount’s “Top Gun: Maverick” grossed over $1.4 billion worldwide, making it the highest grossing film in the world this year, according to CNN."}, {"text": "The movie became the fifth highest-grossing film in North American history, propelling it as one of Hollywood’s biggest successes since the pandemic forced the film industry to grind to a halt."}, {"text": "This year, social media trends continued to influence and shape our lives and culture. By September 2021, Tiktok users had surpassed one billion, and continued to grow in 2022."}, {"text": "About 82% of global internet was made of video content, according to a study by Cisco. Creators on Tiktok, YouTube and Instagram are expanding heavily, with many consumers engaged in their content."}, {"text": "Politically, 2022 brought some major events that shaped U.S. politics for years to come. On June 24, the United States Supreme Court made a landmark decision that overturned Roe v. Wade, ending the constitutional right to an abortion in America."}, {"text": "The ruling gave the states individual power to decide the legality of abortion. The decision was widely controversial, and guest opinion writer Amy Littlefield wrote for the New York Times how it became a driving factor for voters in the 2022 Midterm Elections."}, {"text": "The United States held its midterm elections on Nov. 8. Democrats retained control of the U.S. Senate, and Republicans, with a slim margin, won back the majority in the U.S. House of Representatives."}, {"text": "Ishan Kaluskar (‘26) said that in terms of global events, “I think the elections were the most important, because they affect how our country is run, and they affect our lives more directly than the presidential elections.”"}, {"text": "Beyond the U.S., on Nov. 15, the United Nations reported that the global population hit a record eight billion. This comes 12 years after the population hit seven billion. And since 2010, the population growth rate is slowing down."}, {"text": "From Nov. 20-Dec. 18, the FIFA World Cup took place in Qatar. It was the first World Cup to ever take place in an Arab country. Argentina won the championship in a penalty shootout over France in the final."}, {"text": "When the interviewees described 2022 in one word, they reflected similarly."}, {"text": "Mr. Borsuk described the year as, “hopeful,” whereas Mr. Covington said “rebound.” Both had a message that many around the world feel: a sense that we can look forward to the future."}], "file_structural_elements": {"title": "A year gone by", "date": "January 6, 2023", "writer": {"h5iYDRm76aX63ZO61oDR": {"name": "Vedant Trivedi", "year": "2022"}, "HscWTKotl6r8mP1RYAO5": {"name": "Hoin Lee", "year": "2022"}}, "description": "     “We’re returning back to normalcy,” said Assistant Principal Ernie Covington.\n     From a global perspective, this year was one with historical significance as the world emerged from three years of the COVID-19 pandemic and events once again resumed. \n     The most important series of events th", "image": null}}