{"tree_elements": [{"text": ""}, {"text": "Roll out the red carpet! Freshman Raghav Mehrotra went on tour this past summer as Freddie the drummer in the show “School of Rock.”"}, {"text": "Through his journey on Broadway, Mehrotra had the opportunity to collaborate with legendary musicians such as Slash, from the famed hard rock band Guns N’ Roses, and play shows all over the world."}, {"text": "But Mehrotra didn’t become a star overnight.  He said it all began 11 years ago when he was still a toddler.  His parents discovered he had a natural sense of rhythm and inclination towards music. “They had a fight over whether they should get me a guitar or a drum set,” Mehrotra said. “They decided to get me both for my birthday. I leaned towards my drum set and played that more. So, that became my thing.”"}, {"text": "While Mehrotra is known for his skills as a drummer, he has picked up other instruments during his career as well. “I’ve been playing the bass guitar for five years and the guitar and keys for four.”"}, {"text": "In addition to performing on Broadway and playing gigs around the world, Mehrotra participates in the music program at South and is a member of both the South concert and jazz bands."}, {"text": "“Obviously he’s musically talented,” said Jesse Argenziano, Mehrotra’s band teacher. “But what I really like is that the rest of the students respect him for it. Especially being as young as he is, it’s great to see not only other freshmen but also seniors who appreciate and respect his talent.”"}, {"text": "Mr. Argenziano isn’t the only who recognizes Mehrotra’s humble character. “Raghav is really down to earth,” said freshman Matthew Xu, Mehrotra’s bandmate. “He doesn’t brag about his accomplishments and he’s just a real, genuinely nice guy.”"}, {"text": "Being a musician does come with challenges. Mehrotra admitted that getting a piece perfect is a process, which sometimes takes longer than anticipated. After having been a drummer for 11 years, and a guitarist for about five, Mehrotra confessed that he does occasionally have a bad drumming day. “When I’m having some trouble, I often sit in bed thinking about it for a few hours, until I get it right.”"}, {"text": "Regardless of obstacles Mehrotra faces, he always looks back at his love for music and works through whatever the struggle may be."}, {"text": "“He really enjoys what he’s doing,” Mr. Argenziano said. “He’s not thinking about what he’s playing but he’s always in the moment. And that’s what having fun playing music is all about.”"}, {"text": "Mehrotra credits Broadway with amplifying his passion for music, which is central to his life. “Being on Broadway really taught me about the importance of my job as a drummer.”"}, {"text": "Mehrotra said he learned “that the drummer truly is the backbone to making music.”"}], "file_structural_elements": {"title": "After “School of Rock,” freshman stays on beat at South", "date": "March 28, 2019", "writer": {"LpDIeLwdu280NdPILdWj": {"name": "Ashna Garikapati", "year": "2020"}}, "description": " \n     Roll out the red carpet! Freshman Raghav Mehrotra went on tour this past summer as Freddie the drummer in the show “School of Rock.”\n     Through his journey on Broadway, Mehrotra had the opportunity to collaborate with legendary musicians such as Slash, from the famed hard rock band Guns N’ ", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/rsw_360h_180cg_true-1.png"}}