{"tree_elements": [{"text": "Instead of staring at a screen for six hours a day, students now commute to school and walk to each classroom. They have to raise their hands to ask questions and tests are completed on paper. Students no longer log off for lunch and go to their kitchen table but instead make their way to the school cafeteria."}, {"text": "After almost two years of trying to learn through a screen, students have come all in to celebrate this new school year post-Zoom. On Wednesday, Sept. 8, the doors of South were open for the 2021-22 school year."}, {"text": "From seeing the occasional face amongst the sea of black screens to walking through South’s hallways filled with masked students, adjusting from virtual learning to in-person schooling can take some time."}, {"text": "“It’s a little different because of the masks, but it actually fits my expectations a lot,” said sophomore Imani Laird, a virtual student last year."}, {"text": "Regardless of whether students are new to this school or returning after quarantine, all of South is gradually adjusting."}, {"text": "Many students faced challenges during the first few days of school following the transition to in-person learning. From socializing with others to physically sitting in the classrooms, it is clear that it will take some time to fully adapt. But, it seems like South has had a head start."}, {"text": "“I adjusted quicker than I thought I would,” said Laird. “It just feels like school. It feels nostalgic.”"}, {"text": "Similarly, freshman Aiden Wang, who was virtual last year said, “The adjustment was pretty casual. It was like maybe a little bit uncomfortable for the first few days, but then after the second week of school, I was back into the groove of it.”"}, {"text": "On the other hand, some students are still feeling the effects of coming back to in-person learning."}, {"text": "“It does feel a little bit draining because before you had the ability to relax, but now it’s like, I don’t know, there’s a lot of expectations on you,” said junior Kaylee Moyne, a previously virtual sophomore."}, {"text": "In-person learning has also helped students change for the better. Now that students are back in a better learning environment, paying attention and understanding the information that is being taught has become an easier task."}, {"text": "“I feel better. I feel more confident when I have tests. It doesn’t stress me out because it feels like I haven’t asked the teacher enough questions or learned the whole thing,” Laird said."}, {"text": "Students spent their previous school year learning either in the comfort of their homes or in a nearly empty school. Now that South has returned to in-person school this year, things are slowly transitioning back to the old normal. Students fill the hallways and classrooms once again, teachers stand in the front of a classroom giving instruction, and assignments and tests are back on paper."}, {"text": "“Being in-person has made my sophomore year infinitely better than my freshman year,” said sophomore Eliana Du, who spent her freshman year as a hybrid learner. “I feel like sophomore year will become a much better memory for me.”"}, {"text": "This school year is a transition from virtual and hybrid learning to all in, but it is also something that South is embracing."}, {"text": "“Just be open to change,” said Moyne."}], "file_structural_elements": {"title": "All In For South", "date": "December 6, 2021", "writer": {"nzWe67TLOyFH0NU0m5Q8": {"name": "Tiffany Lu", "year": "2022"}}, "description": "     Instead of staring at a screen for six hours a day, students now commute to school and walk to each classroom. They have to raise their hands to ask questions and tests are completed on paper. Students no longer log off for lunch and go to their kitchen table but instead make their way to the s", "image": null}}