{"tree_elements": [{"text": "“Alliance of Youth Leaders in the United States (AYLUS) not only allows me to make new friends but also allows me to contribute to society,” junior Alisa Zihui Xiao said. AYLUS is a national volunteer and student-driven organization dedicated to the advancement of local communities. It has 86 branches in over 20 states and counting."}, {"text": "Their mission is simple: “AYLUS promotes the development of its members’ leadership, integrity and innovation, through the planning and execution of volunteer projects that aim at benefiting their communities.”"}, {"text": "Many South students volunteer at the Greater Princeton branch of AYLUS. This branch has many projects focused on saving lives and helping citizens, with students at the forefront of the action. In fact, in 2020, South students led AYLUS in the fight against COVID-19 by donating more than 50,000 personal protective equipment (PPE) items nationwide to support frontline heroes."}, {"text": "They have also helped local organizations by financially supporting the Princeton First Aid and Rescue Squad with a benefit music performance, creating a Walk to End Alzheimer’s and hosting an AYLUS Art Show at the Princeton Medical Center. Additionally, students have continued year-round plastic film recycling programs, tree plantings at nearby parks and winter clothing donations for people in need."}, {"text": "As a result of these outstanding contributions to the community, the Greater Princeton branch has received recognition from the Princeton Mayor and Council in May 2020."}, {"text": "The New Jersey State Senate and General Assembly Joint Legislative recognized that the branch had “outstanding dedication and abiding concern for others during the COVID-19 pandemic.” The New York State Assembly acknowledged the Princeton branch for its “generous donation of PPE, masks and hand sanitizer.”"}, {"text": "In addition to these accolades, students have gained valuable experience. Junior Cassie Tammy Wang, founder and President of the Greater Princeton branch since 2018, has been the AYLUS national president since 2020. Wang also oversees the AYLUS Leadership Summit and is the Editor-in-Chief of the monthly newspaper, The AYLUS Times, which summarizes notable volunteer events across the country."}, {"text": "“From this experience in a leadership role, I’ve learned to communicate with companies, veteran’s homes, hospitals, rescue squads, senior living centers, the importance of collaboration and finding fitting roles and events for more than 3,000 AYLUS members across the country to use their diverse talents,” Wang said. She feels that AYLUS is a platform where many students gain opportunities to try new things, such as planting trees, packing food in a food bank, working as a first responder and gaining leadership."}, {"text": "Xiao, co-Vice President of the Greater Princeton branch, also values the life lessons she has learned through AYLUS. Due to AYLUS’s diverse range of activities, she has had the chance to conduct concerts for veterans and found this very fulfilling. “I learned how to become a more useful person in society because AYLUS offers a lot of volunteer opportunities for protecting the environment, spreading peace and love and helping people,” she said."}, {"text": "Likewise, sophomore Sarah Yan, AYLUS’s Sports Committee Chair, feels that AYLUS has opened her mind with new experiences. “With AYLUS, I learned that there are a lot of ways to help the community not only just by donating money to some organization.” Yan teaches a chess class for middle schoolers, engaging students who are stuck at home with fun ways to test their skills."}, {"text": "Yan said, “Seeing what different people think in strategic games such as chess and watching them improve is something that is very valuable.”"}, {"text": "AYLUS is also constantly adding new programs, including online marketing and business management activities. Sophomore Amy Xu, Business Committee Chair, is in charge of designing and advertising AYLUS uniforms, which include sweatshirts and winter hoodies."}, {"text": "Xu has found this process to be rewarding. “Learning to invest and finding the difference between cheap materials and higher quality materials has allowed me to build confidence,” Xu said that AYLUS’s format of student-led endeavors has allowed for more self-directed learning, exposure to problem-solving strategies and creative freedom."}, {"text": "Yan, too, noticed AYLUS’s impact to be widespread.“Not only are you helping a small number of people,” she said, “but the entire community grows to be a better place.”"}, {"text": ""}, {"text": "Image courtesy of Amy Xu."}, {"text": "*link to='/cdn-cgi/l/email-protection#36574f5a43455144535742534446445f58555342595876515b575f5a1855595b'*[email protected]*/link*"}], "file_structural_elements": {"title": "AYLUS: South students volunteer in national organization", "date": "April 6, 2021", "writer": {"mmPM0AAOdiQuDZH4MUVF": {"name": "Karen Yang", "year": "2022"}}, "description": "     “Alliance of Youth Leaders in the United States (AYLUS) not only allows me to make new friends but also allows me to contribute to society,” junior Alisa Zihui Xiao said. AYLUS is a national volunteer and student-driven organization dedicated to the advancement of local communities. It has 86 b", "image": "https://thepirateseye.org/wp-content/uploads/2021/04/AYLUS.jpg"}}