{"tree_elements": [{"text": "Roberta Berrios, fondly known as “Bert,” has helped keep the South community safe for 22 years. Students may see her in the mornings standing vigilant at the front door, shouting out greetings; during the day, walking around school; after school, supervising activities."}, {"text": "Bert is a graduate of South. When she was a student, she was part of WWPH 107.9 FM Radio, the student radio station. Bert had many roles: she hosted a music program; and she was a news, weather and sports broadcaster."}, {"text": "“I was in a very spirited class. We had celebrations at the local park and the class provided a great education,” Bert said. “At 107.9 you can be you. There are no filters.”"}, {"text": "At the radio station, Bert recalls playing country and 80’s music. Students and staff members held radio shows before, after and during school, a feature that Bert hopes will be brought back."}, {"text": "Her former teacher Glenn Allison, South’s broadcast writing teacher and supervisor of the 107.9 radio station club, said, “Bert is a Pirate through and through.” He added, “Bert is very gregarious and friendly and she brought her spirit right to my class and, as a teacher, I loved that.”"}, {"text": "Bert’s first job at South was as an instructional assistant for the LARKS program, a special education program that provides one-on-one assistance for students with cognitive disabilities."}, {"text": "Later, Bert said, “The former principal, Michael Carr, came to me and asked me if I would be interested in becoming a security aide at the school since I knew the building very well.”"}, {"text": "As a security aide, Bert fulfills many responsibilities, ranging from helping students and staff to ensuring that the building is safe and functioning properly. Bert has been working as a security aide since 2000."}, {"text": "“I monitor cameras and review them for lost or stolen property. I monitor the drills and posts for fire safety and medical emergencies,” Bert said. “I make sure all the rules are followed, I submit work orders for the building that need some maintenance and I make sure everything is ready.”"}, {"text": "Throughout the day, Bert walks around the school and takes note of abnormal activity, such as missing items or exits that are unlocked. Additionally, Bert oversees the technology setup and delivers messages to students and teachers."}, {"text": "For Bert each day at South is different."}, {"text": "“That’s the best part about working at South: it’s never a repetitive day. My day varies, I never know what to expect,” Bert said. “I could be talking to or helping a student, assisting in a fire drill, monitoring if something happens in areas of the school like commons one, or I could be in meetings just for disciplinary action with the principal.”"}, {"text": "Bert connects with staff members and students through small and large ways, like helping teachers and students with audiovisual equipment setup, escorting students and visitors and monitoring morning and afternoon school duty."}, {"text": "“Over the years, I have created strong bonds with the staff, like those with the girls in the main office,” Bert said. “They are like my sisters.”"}, {"text": "As a student, Mr. Allison recalled, she was also in the main office a lot, talking to staff members.\nHer comfort at South comes as no surprise. Bert’s mom is also part of the South family. Bert said, “My mom was a bus driver for the district for 26 years and I still have parents come up to me who have been driven by my mom in elementary school.” She added, “It’s also good to see alumni when they come back, recognize me and tell me how well they are doing.”"}, {"text": "Even after four years of attending South and 21 years of working here, Bert learns something new every day while she walks around the building."}, {"text": "“I can learn about different cultures and different celebrations. I’m always here and I can witness the talent and creativity of the student body,” Bert said. “When I’m passing through the halls or doing my rounds, I overhear teachers talking and it brings me back to when I was in high school.”"}, {"text": "Just as Bert learns from the staff members and students, she hopes that students can learn from her. “I hope to be a role model by always being on point, greeting students and getting to know them,” Bert said."}, {"text": "The sense of community Bert has fostered is a big part of why South is welcoming and safe."}, {"text": "“I have walked a lot of miles around this school,” Bert said. “South is my second home.”"}], "file_structural_elements": {"title": "Bert: Celebrating 22 years and counting", "date": "February 13, 2020", "writer": {"": {"name": "Cathy Xiang", "year": ""}}, "description": "Roberta Berrios, fondly known as “Bert,” has helped keep the South community safe for 22 years. Students may see her in the mornings standing vigilant at the front door, shouting out greetings; during the day, walking around school; after school, supervising activities.\nBert is a graduate of South. ", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/Bert-1-900x675.jpg"}}