{"tree_elements": [{"text": "Over one million copies sold in its first year; 30 weeks on the New York Times bestseller list; winner of a Pulitzer Prize–Donna Tartt’s 2014 “The Goldfinch” is an extraordinary book and it is now a movie."}, {"text": "“The Goldfinch” hit theaters Sept 13. Set in present-day America, the story follows the life of Theo Decker. As a young boy, Theo lost his mother in a terrorist bombing and is left struggling to navigate life. Consumed with grief, Theo clings onto a famous painting he received on the day of his mother’s death."}, {"text": "The oil painting created by Dutch painter Carel Fabritius shows a goldfinch chained on a perch."}, {"text": "Along his life journey to find happiness again, Theo encounters new people and places. The storyline is quite complex, but is gracefully conveyed through descriptions of beautiful artwork, experiences of love, loss and even a shocking murder. I think that the complexity of the novel’s plot is what made it award winning."}, {"text": "Since the book was so successful, I was concerned the movie wouldn’t do it justice, even with a star-studded cast. The main character, Theo Decker, is played by Golden Globe-nominated Ansel Elgort. Elgort’s supporting actors include A-List celebrities such as Finn Wolfhard, Nicole Kidman, Luke Wilson and Sarah Paulson."}, {"text": "However, as talented as this cast is, the movie missed the mark. It was rushed, with no real focus and frequently jumped around leaving the viewer with questions about the previous scene. For example, the reason Theo kept the Goldfinch painting in his possession for 10 years was unclear to viewers. Towards the end of the movie when Theo and his friend Boris traveled to Amsterdam to retrieve the stolen painting, the action scene was rushed and confusing to follow."}, {"text": "“I definitely got confused and bored pretty quickly because I haven’t read the book,” said senior Maddy Vivona. Although the movie depicted the general plot of the book pretty well, there just wasn’t enough detail."}, {"text": "It is simply unrealistic to fit an 800-page book into a two hour movie. Most of the book is Theo’s internal thoughts, written in the first person voice and it is common for movies to struggle in capturing the detailed thoughts of characters. “The Goldfinch” is one of my favorite books because of the depth of the characters in the novel. The movie was unable to perfect this important element of the book.\nPopular online movie reviewing site Rotten Tomatoes gave the movie a 25 out of 100 percent. Time magazine wrote, “It lies flat and baffling on the screen.”"}, {"text": "Senior Phoebe Elias expressed similar views, “When I read the book I loved Theo’s character but when I saw the movie I felt like they didn’t do his character justice.”"}, {"text": "Overall, I enjoyed the movie despite its rushed nature. If you want to see the new movie, I strongly recommend reading the book first to avoid confusion."}, {"text": "I enjoyed the movie solely because “The Goldfinch” is one of my favorite books, so seeing the book come to life on the big screen was exciting."}, {"text": "PHOTO BY CATHY XIANG"}], "file_structural_elements": {"title": "Book vs. movie:  “The Goldfinch”", "date": "November 1, 2019", "writer": {"": {"name": "Alyse Dunn", "year": ""}}, "description": "Over one million copies sold in its first year; 30 weeks on the New York Times bestseller list; winner of a Pulitzer Prize–Donna Tartt’s 2014 “The Goldfinch” is an extraordinary book and it is now a movie.\n“The Goldfinch” hit theaters Sept 13. Set in present-day America, the story follows the life o", "image": null}}