{"tree_elements": [{"text": "In the highest halls of American government, elected members of the nation gather to discuss, deliberate, and decide on legislation that will provide solutions to the country’s greatest troubles and that will improve life for its people."}, {"text": "The Asian American Pacific Islander (AAPI) community has not had representation in the federal government until the middle of the 20th century. But as time passes, more figures from the community have joined and gained greater recognition, bolstering the community’s voice."}, {"text": "As anti-Asian sentiment rose during the COVID-19 pandemic, Asian Americans became more vocal than ever in demanding social change for issues such as combating racial discrimination and stereotyping. However for this historically underrepresented group, facilitating such extensive reform requires more members of the AAPI community taking part in the democratic process."}, {"text": "“In general, it’s always important to have our voices and interests heard, because we are citizens in this country,” said North language arts teacher Jessica Wong. “And we should exercise our rights to vote and also have our voices heard and our concerns heard.”"}, {"text": "Junior Elizabeth Li said, “Having a government that only has politicians from the same ethnic group means that the government cannot represent everyone’s voice and meet everyone’s needs.”"}, {"text": "According to a 2022 survey from the organization Leading Asian Americans to Unite for Change, 58% of Americans could not name a prominent Asian American figure, let alone an Asian American politician."}, {"text": "The first Asian American to make waves in the world of politics was Dalip Singh Saund, a Sikh Indian man who became the first Asian American to be elected into Congress in 1957. Prior to his appointment, Saund played a key role in allowing Indian immigrants to become naturalized citizens, which served as a stepping stone to his campaign for House Representative of California, which he won. During his term, he took a trip to India while the Cold War was waging to speak on the “freedom of opportunity” prevalent in America and address communist propaganda commonplace at the time that prejudice against Asian Americans was rampant in America."}, {"text": "Another figure well known among AAPI political history is Hiram Fong, one of Hawaii’s first senators and the first Asian American senator. During his term, he was known for being an avid supporter of civil rights, writing an amendment to the Voting Rights Act of 1965 that called for poll watchers to safeguard elections. He was also concerned with immigration and providing aid to refugees."}, {"text": "As the Vietnam War waged, he introduced more immigration relief bills than any other senator to ease the plight of refugees from conflicts in Indochina."}, {"text": "Born in the same state as Fong, Patsy Mink became well-known for being the first Asian American woman to be elected to Congress. She retained her seat as a representative for Hawaii in the House of Representatives, for five re-elections. During this time, she helped pass several pieces of legislation vital to supporting education and women’s rights: the Early Childhood Education Act that kickstarted a series of laws to make quality education more accessible for children, Title IX of the Education Amendments of 1972, which prohibited discrimination based on sex in schools or any education program funded by the government, and the Women’s Educational Equity Act to provide grants to help schools and programs develop “nonsexist curricula.”"}, {"text": "In recent years, more Asian Americans have become involved in federal and local governments. Last year, Michelle Wu became the first woman and Asian American to be elected mayor of Boston."}, {"text": "Kamala Harris earns the title of the first woman, Asian American, and Caribbean American to be vice president of the United States."}, {"text": "Though more work remains to be done, both past and contemporary AAPI members of the government represent the strength of the AAPI community’s belief in having a seat and voice at the table."}], "file_structural_elements": {"title": "Brief history of Asian Americans & Pacific Islanders in politics", "date": "June 22, 2022", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}, "x0qtq92usjgRms9hU9NA": {"name": "Alexander Chang", "year": "2021"}, "Gxd1r1z0AAbCXQdmEWSS": {"name": "Kalyani Samudrla", "year": "2021"}}, "description": "In the highest halls of American government, elected members of the nation gather to discuss, deliberate, and decide on legislation that will provide solutions to the country’s greatest troubles and that will improve life for its people.\nThe Asian American Pacific Islander (AAPI) community has not h", "image": null}}