{"tree_elements": [{"text": "Due to the coronavirus pandemic, South is much emptier than it ever was. The few students in each classroom sit distances apart from each other and the usual hallway chatter between classes is much softer. Students bring the spirit and without them, South has changed."}, {"text": "But one teacher is determined to keep the school spirit alive. In late October, gym teacher Beth Fitzpatrick organized a school-wide decoration project which she called Operation Positivity. Since then, students and staff have painted, drawn and hung pictures around the school, all in an effort to brighten the atmosphere."}, {"text": "“I just wanted to try and make a difference somehow and that’s the way I did it,” said Ms. Fitzpatrick."}, {"text": "She started to recruit in-person students from every gym class to spend their gym periods decorating. As the word spread, students from sub-study and study hall also helped decorate the school."}, {"text": "Gym students were given the choice to either do physical activities or decorate. “I would say a little more than half of the students in each class decided to help out,” said gym teacher Joseph Gambino. “So roughly 15 students per period.”"}, {"text": "Many locations at South have already been decorated: the entrances, glass panels near the office, commons where students used to eat and walls all around the school — every location students often pass by has had a makeover."}, {"text": "“Because I pass them as I’m entering the building in the morning, I feel like it’s a nice ‘hello and good morning’ from the school,” said junior Hannah Kim, a hybrid student."}, {"text": "Although Operation Positivity did not have a formal starting date, the idea of decorating the school was brought up to various gym classes before Halloween. The project lasted until the end of marking period one before losing traction. In this time, students met up twice after school hours, once on Nov. 1 and once on Nov. 3. Around 15 students attended each session."}, {"text": "Such a large number of participants means the decorations are widespread and unique. Some drawings simply read “Smile,” while others have pirate mascots. Characters from the video game “Among Us” have also made appearances on posters and windows."}, {"text": "“The only instructions we were given was that the art was for Homecoming and that it should represent our school. Other than that, we were just given supplies and could do whatever,” said sophomore Maria Maiorova, a participant in the project."}, {"text": "Although Operation Positivity happened alongside Homecoming decorations, they are not the same. Art for the Operation was made purely for school pride and did not come down after the holiday season is over."}, {"text": "“They are just decorations to bring us together as a school community, to have some pride towards your grade and just to connect us,” said Ms. Fitzpatrick."}, {"text": ""}, {"text": "PHOTO BY DANIEL WU"}], "file_structural_elements": {"title": "Brightening up South with Operation Positivity", "date": "March 11, 2021", "writer": {"jDWiWuTI7F9KAJjATiXf": {"name": "Daniel Wu", "year": "2021"}}, "description": "     Due to the coronavirus pandemic, South is much emptier than it ever was. The few students in each classroom sit distances apart from each other and the usual hallway chatter between classes is much softer. Students bring the spirit and without them, South has changed. \n     But one teacher is d", "image": "https://thepirateseye.org/wp-content/uploads/2021/03/Screen-Shot-2021-03-11-at-10.36.06-AM-900x677.png"}}