{"tree_elements": [{"text": "The South Theater department performed “Brighton Beach Memoirs” to an open, pandemic-regulated audience last month in the New Theater — the first since the COVID-19 pandemic began in March 2020."}, {"text": "The play, originally written in 1982 by Neil Simon, features a cast of seven characters who are part of a fractured family. The play’s opening run on Broadway in 1983 received mixed critical reception, but was popular with audiences and had a three year legacy on stage. The play takes place in 1937 Brighton Beach, New York, a small neighborhood in Brooklyn."}, {"text": "14-year-old Eugene Morris Jerome, played by senior Connor Rossi, serves as the storyteller of the play, often speaking directly to the audience as he recounts his family’s troubles in his secret memoir."}, {"text": "The entire play takes place in the Jerome family home. Constructed as an as they moved between floors. The"}, {"text": "open front, two story house, the set allowed for dynamic interactions between characters second floor bedrooms provided the actors with the challenge of staying in character even when the focus of the scene was elsewhere. This created for the audience a more realistic family experience."}, {"text": "Another part of the verisimilitude in the play was the costuming. To fully pull the audience into the 1930s, looser and more casual suits, vests, newsboy hats and wide shouldered dresses were all taken out of South’s wardrobe closet. Even the most minute details, like the wrinkles indicative of a stressed and aging man drawn on senior Chase White’s face for his role as Eugene’s father Jack, brought the play to life."}, {"text": "At the start of the play, the audience learns of each family member’s problems, which range in severity. Eugene feels like he gets unfairly blamed for every mistake in the house; his older brother, Stanley, played by senior Dhruv Badaryan, struggles with serious job instability that threatens the family’s livelihood. As the play progresses, these issues start to intersect between characters, and as the stakes become greater and relationships start to fracture, characters are forced to make sacrifices to save their family."}, {"text": "Rossi steals the show as Eugene, delivering every line with the conviction and energy of a conflicted 14-year old. The rest of the cast turn in fantastic performances in their own right. Badarayan’s frustration and exasperation perfectly encapsulates the mental struggle of an 18-year old who is stuck between the freedom of childhood and the sudden responsibility of assisting in providing for his family."}, {"text": "White’s mellow yet understanding attitude portrays the life of a father that both works two jobs, and is burdened well, showing the pain of having to often sacrifice your own feelings to be able to better care for your family."}, {"text": "Finally, sophomore Gabby DiRusso and junior Emily Quigley star as Blanche’s aforementioned daughters, Nora and Laurie. DiRusso lives Nora’s increasingly rebellious nature as she tries to become a Broadway star, desperate to persuade her family to support her endeavors. Quigley does a phenomenal job matching the energy of an innocent and curious young girl, unintentionally being an annoyance to the other characters around her."}, {"text": "Despite the seriousness of the plot and frequent tension between characters, the play is at its heart a comedy, drawing on frequently crude humor as Eugene narrates his experiences undergoing puberty."}, {"text": "The performance refreshingly jumps between heavier and lighter scenes, maintaining a range of emotion that accurately encompasses life with family."}, {"text": "A delight from start to finish, “Brighton Beach Memoirs” succeeded in all facets of Neil Simon’s original vision, from character development to setting. And as the latest in a long line of quality theatrical to come, one thing is abundantly clear: behind the scenes or on stage, South theater is in very good hands."}, {"text": ""}, {"text": "Photo by Connor Rossi and Renee Pujara"}], "file_structural_elements": {"title": "Brighton Beach Memoirs: a triumph for South Theater", "date": "December 21, 2021", "writer": {"xcHHOYKQ8MJMj6FRgYiE": {"name": "Danny McElroy", "year": "2021"}}, "description": "         The South Theater department performed “Brighton Beach Memoirs” to an open, pandemic-regulated audience last month in the New Theater — the first since the COVID-19 pandemic began in March 2020.\n\n     The play, originally written in 1982 by Neil Simon, features a cast of seven characters wh", "image": "https://thepirateseye.org/wp-content/uploads/2021/12/image1-1-e1640131481121.jpg"}}