{"tree_elements": [{"text": "As drum beats boomed throughout the theater, a Chinese lion soared ten feet high, held by dancers holding its handles inside the costume, kicking their feet in imitation of the fierce mythical creature. The silver lion playfully intimidates the red lion, displaying its ability to stand on its hind legs, as the first performance at China Night. The        This year’s China Night was hosted on March 18 by South’s Chinese Club and Chinese teachers Vivian Yu, Jume Shen, and Suey Lain Pei to celebrate Lunar New Year and the year of the tiger. The tiger is an auspicious symbol in Chinese tradition."}, {"text": "“Tiger is the symbolism of bringing the strength, power, to overcome the challenges,” said Ms. Yu."}, {"text": "Students from both South and North gathered in-person to make China Night possible, a welcome change from last year’s virtual event."}, {"text": "Booths, which before the pandemic were activity tents where a particular craft was showcased or a skill was taught, had to be made virtual last year. “Our president turned the booths into a website,” said Chinese club member and senior Cindy Lu. “There was so much technical difficulty that we had to watch the show another day.”"}, {"text": "This year, Chinese Club spent countless hours making sure the in-person events occurred smoothly, adjusting to many changes."}, {"text": "“We hosted it at the theater, so it’s a larger space and not at the playhouse anymore, which we’ve been doing for the past four years,” said junior and Chinese Club Public Relations officer Elizabeth Li in a phone interview. “We have limited tickets to sell because we can’t sell over three hundred.”"}, {"text": "They also had to take into consideration COVID-19 restrictions."}, {"text": "“It used to be that we had food, but students came up with the idea of pre-packed snacks,” said Ms. Shen."}, {"text": "In addition to suggesting new ideas, members had to be flexible by adjusting to each other’s busy schedules."}, {"text": "“A lot of our dancers have multiple tasks for China Night and other clubs,” said junior Naomi Lyu, who was the head of traditional and modern dances. Because there were dancers who were also performing a skit or were athletes, they had to ensure everyone could do the dance efficiently."}, {"text": "“In the first part of the dance everybody is on stage,” Lyu said. In the second part, one dancer has a solo, then the other dancers return."}, {"text": "“They meet throughout the months,” said Liu. “They put it all together and show all their work and the culture to the whole entire school. The booths represent how we can share a different culture.”"}, {"text": "Before seeing the performances, participants took part in various booths."}, {"text": "“They can learn something about traditional Chinese activities and crafts, hands-on activities and customs,” said Ms. Yu."}, {"text": "Junior Neha Menon learned to use chopsticks at a booth where she used them to pick up Skittles."}, {"text": "“Thankfully someone taught me,” Menon said. “Now that I know the basics, I might actually make an effort to learn.” She appreciates that China Night introduced her to Chinese culture."}, {"text": "“Everybody comes here and has some takeaway,” said Ms. Shen. “ They taste the craft, and they get a taste of music, of dance. It is a family activity, and they feel the touch of Chinese culture,”"}, {"text": "Another booth showcased Chinese calligraphy."}, {"text": "“One huge thing we do on Chinese New Year is, on red paper, you write 福 (fu), which means joy,” said junior Amy Chen."}, {"text": "Chen took part in the traditional Chinese group dance called 不染 (bù rǎn) along with juniors Naomi Lyu, Karen Yang, Xiying Fan, and sophomore Rebekah Wang. Their graceful movements left the audience in awe. Lyu, who learned with a professional dancer in China, led the dance team."}, {"text": "“That’s when I really started to get inspiration and what kind of emotion or expression you want to express to the audience when you do certain moves,” Lyu said. “I believe that is the most important thing that I tried to bring to the traditional group dance.”"}, {"text": "She also performed a traditional solo dance, holding a fan and wearing a qipao, a dress with a high neck and short sleeves. Her elegant dancing style in this performance is called “Yun-we” and reflects the character of a shy young girl."}, {"text": "Martial arts, another important aspect of Chinese culture, were showcased in a performance where students wielded a sword, a whip and incredible acrobatic skills."}, {"text": "“They’ve already started at a really young age to reach that high of a level,” said Chen."}, {"text": "At the end, they had a fashion show with various Chinese traditional clothing such as qipao and hanfu which featured a cross collar, a longer skirt and sleeves. They were vibrant reds, greens, and blues, reflecting the bright stage lights."}, {"text": "As a diverse district and community, it is valuable to share the traditions of Lunar New Year with everyone."}, {"text": "Junior Arthur You who is an officer-in-training of Chinese club said in a survey by The Pirate’s Eye staff, “A good proportion of our high school’s demographic is Chinese, and I think a night dedicated to Chinese culture encourages a unity and a bond where we all come together and have fun under the same umbrella.”"}, {"text": "“This is one of the best experiences I’ve had,” Li said."}, {"text": ""}, {"text": "PHOTOS BY GRACE YUAN, KIKO YOSHIHIRA AND RENEE PUJARA"}], "file_structural_elements": {"title": "Bringing good fortune to South: China Night", "date": "May 5, 2022", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}, "yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "       As drum beats boomed throughout the theater, a Chinese lion soared ten feet high, held by dancers holding its handles inside the costume, kicking their feet in imitation of the fierce mythical creature. The silver lion playfully intimidates the red lion, displaying its ability to stand on its", "image": "https://thepirateseye.org/wp-content/uploads/2022/05/IMG-4933-e1651771861373-900x450.jpg"}}