{"tree_elements": [{"text": ""}, {"text": "Disney’s announcement of a live-action “Aladdin” did not come as a surprise to many. Disney has added many classic stories to its live-action productions such as “Beauty and The Beast” and “Cinderella.” But director Guy Ritchie disappointed fans because though he attempted to choose a diverse cast, the actors he chose don’t share the cultural heritage of the story."}, {"text": "The controversy over “Aladdin” was that the movie, according to some, would be “whitewashed” due to the non-Middle Eastern  actors cast in major roles in the film. Finding actors to play roles in the live-action “Beauty and The Beast,” which is set in Europe, was easy. But casting for “Aladdin” posed a challenge because only three percent of actors in Hollywood are of Middle Eastern descent."}, {"text": "“Aladdin” is based on a collection of Middle Eastern folk tales called “The Book of One Thousand and One Nights,” commonly known as “The Arabian Nights.” The story of  “Aladdin and the Magic Lamp” was recreated into an animated Disney movie in 1992."}, {"text": "The producers added a new character in the live-action version of the story, Prince Anders (played by Billy Magnussen). Many fans believe that the role taken of Prince Anders was “unnecessary” and “offensive” since Prince Anders is played by a white actor."}, {"text": "“It’s very important to have an actual [Middle Eastern] cast because it’s about [Middle Eastern] culture,” freshman Lily Akman said."}, {"text": "Actor Mena Massoud plays Aladdin in the film. Massoud was born in Egypt and grew up in Canada.  Naomi Scott plays the part of Princess Jasmine in the film. Scott is a British actor with an Indian heritage."}, {"text": "Mena Massoud was known for his acting performance in the Amazon series “Tom Clancy’s Jack Ryan” as Tarek Kassar. Naomi Scott is best known for her co-leading role as the Pink Ranger in the 2017 “Power Rangers” movie. Billy Magnussen is best known for his performance in “Into The Woods” and “Game Night.”"}, {"text": "Freshman Jasmine Akman,  who watched the original animated film, said the live-action version, “[S]hould have more [Middle Eastern] people especially with their leading cast because cultural awareness is really important.”  Fans believed that “Aladdin” was being “whitewashed” even with Richie’s efforts to find actors who reflect the cultural background of the story. Guy Ritchie said that the “Disney studio wanted actors of Middle-Eastern or Indian descent.”"}, {"text": "*link to='https://www.huffingtonpost.ca/meera-solanki-estrada/we-should-celebrate-aladdins-diverse-cast-not-argue-about-it_a_23036699/'*2,000 actors*/link*"}, {"text": "Another criticism was that Will Smith was chosen as the genie in the film. Guy Ritchie was in the decision making process of either choosing Will Smith or the American comedian Gabriel Iglesias during the summer of 2017. When choosing the genie for the live-action movie, the film maker worried about how the new genie was going to compete with Robin Williams’ performance in the animated movie in 1992."}, {"text": "Ritchie chose an important story to remake but the casting of actors created controversy among “Aladdin” fans."}], "file_structural_elements": {"title": "Casting controversy: live action “Aladdin”", "date": "May 21, 2019", "writer": {"BpJiyaRd5yUVxEfXfKmO": {"name": "Jaidyn Hines", "year": "2018"}}, "description": " \n    Disney’s announcement of a live-action “Aladdin” did not come as a surprise to many. Disney has added many classic stories to its live-action productions such as “Beauty and The Beast” and “Cinderella.” But director Guy Ritchie disappointed fans because though he attempted to choose a diverse ", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/Aladdin-900x636.jpg"}}