{"tree_elements": [{"text": "Ms. Maureen O’Conner"}, {"text": ""}, {"text": "How long have you worked at South?"}, {"text": "I was the school nurse at South for 11 and a half years. Prior to that I was a substitute nurse in the district for many"}, {"text": ""}, {"text": "How was your experience at South?"}, {"text": "My first year at South was a strange and a difficult transition as I was trying to adjust to my new role. I started shortly after the loss of beloved teacher Brian Welsh. Luckily, Mrs. Grabell [a former South nurse] was a wonderful mentor and helped make that first year be the best that it could be."}, {"text": ""}, {"text": "What will you miss about South?"}, {"text": "One achievement that I was happy to be part of was with the WW-P Continuing Education department. I helped organize informational sessions for parents with a licensed family therapist about the effect of academic stress on students. I think many parents found it helpful and enlightening."}, {"text": "Where do you plan to go next?"}, {"text": "My retirement plans include lots of traveling with my husband, moving out of West Windsor to the Jersey shore, and the most exciting will be enjoying my new role as a first time grandmother in September."}, {"text": "What final thoughts would you like to share?"}, {"text": "I enjoyed my time at South. Every day was a new adventure. I will miss the many students that I have gotten to know, and will dearly miss my wonderful colleagues and friends who will always hold a special place in my heart."}, {"text": ""}, {"text": "Ms. Jeanette Hanos"}, {"text": ""}, {"text": "How long have you worked at South?"}, {"text": "Thirteen years, but I’ve been in the district for 32 because I started out in Maurice Hawk as a teacher’s aid then I went to Dutch Neck as a teacher’s aid. I became a secretary at Town Center in the library, then I transferred here."}, {"text": "How was your experience at South?"}, {"text": "Very enjoyable. I was a little apprehensive of coming to high school cause all of my career I had always worked with younger kids. But I realized I liked the high school students just as much as the young students."}, {"text": "How was your experience at South?"}, {"text": "I’m the attendance secretary. Students are constantly coming in late, leaving early, so this job keeps me busy. It’s just always busy, but it helps the day go by and I do enjoy it."}, {"text": ""}, {"text": "What will you miss about South?"}, {"text": "I will miss the students and the staff. I know it’s really funny to say, but the kids who come in late, I know the most. The kids that leave early too. So I’ll miss the students the most."}, {"text": "Where do you plan to go next?"}, {"text": "I’m going to be home! I’m hoping I’ll be traveling a lot. I do want to go to Paris, and places that I haven’t been to. My husband also retired last year, so now that we’re both retired, we can travel, and I have two grandsons so hopefully I’ll be doing more things with them."}, {"text": "What final thoughts would you like to share?"}, {"text": "South is a really nice place to work , the people, the students. My son went to school here too; he graduated a while back. Family is what this school is like."}, {"text": ""}, {"text": "Ms. Mary Fregosi"}, {"text": ""}, {"text": "How long have you worked at South?"}, {"text": "I’ve been at South 9 and a half years after being a counselor at Grover Middle School for six years. I moved to South in 2012."}, {"text": ""}, {"text": "How was your first year at South?"}, {"text": "I loved my first year at South! I still had a lot to learn at the high school level and I was very fortunate to work with a great team of counselors who helped me figure out my new responsibilities."}, {"text": "What was your favorite moment at South?"}, {"text": "I loved seeing the talent of the students in the plays, musicals and acappella groups. It was fun spending the evenings with the juniors and seniors all dressed up at their proms."}, {"text": ""}, {"text": "Where do you plan to go next?"}, {"text": "For my next act, I plan to take life a little bit slower so I can enjoy some of the hobbies that I’ve been neglecting, such as pickleball, gardening, and photography.. Traveling is definitely going to be part of my future journey! In addition to that, we run a small business in which I plan to take on a bigger role."}, {"text": ""}, {"text": "What will you miss the most about South?"}, {"text": "Without a doubt, I will miss the people the most! I have been very"}, {"text": "fortunate to work with some incredible people and have made many friends over the years. I will miss all of those daily conversations, making each other laugh, and supporting each other when times were difficult."}, {"text": "What final thoughts would you like to share?"}, {"text": "I have had at least three careers in my life and I can honestly say that being a high school counselor has been the most rewarding of all. I am grateful for all of the opportunities I had, the people I met and for the friends I made along the way. And now, after over 45 years of working, I am loving being retired!"}], "file_structural_elements": {"title": "Celebrating Retiring Teacher", "date": "June 21, 2022", "writer": {"71hhF0oQr1LLxWE03E35": {"name": "Sidd Shetty", "year": "2021"}, "0LTNH0YiaG7NWv8Ik0Uj": {"name": "Ishita Vinay", "year": "2021"}}, "description": "Ms. Maureen O’Conner\n\nHow long have you worked at South?\n     I was the school nurse at South for 11 and a half years. Prior to that I was a substitute nurse in the district for many\n \nHow was your experience at South?\n     My first year at South was a strange and a difficult transition as I was try", "image": null}}