{"tree_elements": [{"text": "People often associate others with a couple of quick words to describe their stand-out traits, eccentric hobbies, or inherent talents. But aren’t we more than what others point out about us? What makes us who we are? In Disney’s new movie “Encanto,” the Madrigal family grapples with this very idea."}, {"text": "The movie dives deep into the value of connections we make in our lives, connections that bring us purpose and happiness. The combination of remarkable animations, a lively soundtrack, dynamic characters, and meaningful storyline catapulted “Encanto” to becoming a Disney classic."}, {"text": "On March 27, “Encanto” won an Oscar for the Best Animated Feature award. Set in Columbia, Mirabel, a 15-year old, is on a mission to save the future of her home. But her house isn’t just a normal three bedroom residency, but one with a life of its own, with dancing floor tiles and lively kitchen drawers. This magic is the result of a miracle candle that built the house."}, {"text": "Years ago, Mirabel’s grandmother had to flee her home with her husband and three kids and one candle to light the road ahead. As they were escaping, the intruders took the life of Mirabel’s grandfather."}, {"text": "The candle suddenly grew mountains and trees, making it a place of refuge for Mirabel’s grandmother to raise her kids and care for the Madrigal family. This safe haven was an “encanto,” a motif in the movie. In English, encanto means charm, happiness, or delight–all of which are themes explored in the movie. Beyond this miracle , each member of the family has a special power. To name a few, Mirabel’s mother Julieta has the power to heal others with food, Mirabel’s long-lost uncle Bruno can see prophecies, and her sisters Luisa and Isabela have super strength and can make flowers bloom. But Mirabel was given no gift."}, {"text": "When the family home that has a life of its own begins to crack and dent, Mirabel finds purpose in uncovering the mysterious downfall of her house."}, {"text": "Many are already saying that “Encanto” is their favorite Disney movie. Senior Rebecca Han saw the movie with her younger sister in the theaters. “I’m so happy that I watched ‘Encanto’ because I think that it had a positive message for youth,” said Rebecca. When asked what mark the movie has left on her and her sister, she said “You don’t need special talents to be special. Everyone is unique for who they are. There’s truly no one like you in the world.”"}, {"text": "Similarly, junior Maanav Sharma said that he thought that the message of the movie was meaningful. “The movie tied together with a great storyline, music, and theme,” he said. “The message highlights that we are more than just other people’s portrayals of us. Everyone is special in their own way and that’s priceless.”"}, {"text": "Junior Josh Kim watched the movie twice. “When I watched ‘Encanto’ for the second time with my sister, I enjoyed it just as much or even more than before. There are so many details in the movie I missed the first time. It was a 10/10.”"}, {"text": "Set in the vibrant, rich Latin culture with catchy musical soundtracks, “Encanto” touches the heart of its audience and sends a message that we are extraordinary in our own way."}], "file_structural_elements": {"title": "Charmed by “Encanto”", "date": "May 5, 2022", "writer": {"IEgx27jeMWPMtV0BxA2O": {"name": "Melissa Liu", "year": "2021"}}, "description": "     People often associate others with a couple of quick words to describe their stand-out traits, eccentric hobbies, or inherent talents. But aren’t we more than what others point out about us? What makes us who we are? In Disney’s new movie “Encanto,” the Madrigal family grapples with this very i", "image": "https://thepirateseye.org/wp-content/uploads/2022/05/IMG_2033-1-675x900.jpg"}}