{"tree_elements": [{"text": "“Chromebook extensions make certain long, difficult assignments a lot easier,” said senior Akshata Padalkar, who has been using chrome extensions for almost six years. “Chromebook extensions are really helpful when we need to present a topic or even for writing essays.”"}, {"text": "At South, many students use Chromebook extensions to access their classes and to complete assignments, but rather than completing day-to-day tasks manually, there may be another way for students to ease their transition to a virtual class and become more productive and efficient: chrome extensions."}, {"text": "Similar to apps on Google Playstore — an online platform used to get apps, games and other digital content — Chrome Extensions are mini software programs that can be installed onto various devices such as computers, phones and tablets. These extensions have been around since 2010 and many are free on the Chrome Web Store. Many students at South have used this resource in order to be more productive, especially during virtual learning."}, {"text": "One common Chromebook extension that is favored by South students is Dark Mode, a software used for Zoom, an online communication platform that South students use for classes. According to Cat Ellis’s Techradar article on the application, Zoom has its benefits, such as the ability to screen-share and to record meetings, but its default bright blue and white theme negatively impacts sleep and device battery by increasing the amount of screen glare emitted by one’s personal device."}, {"text": "Senior Michael Zhilaev said, “Dark Mode is easy on the eyes when you’re looking at a small screen all day.”"}, {"text": "Not only can Chromebook extensions benefit health, but they can also benefit academics. Grammarly is a free digital writing assistance resource that can not only correct grammar and spelling but can also adjust writing tone and style. “It allows me to complete worksheets and type up emails, correcting my mistakes,” Padalkar said."}, {"text": "For classes that involve measuring angles, Padalkar recommends the Protractor tool. She also suggests the Start – A Better New Tab feature."}, {"text": "Padalkar said, “It has this amazing notes feature and weather feature which makes it easy to quickly jot down notes and check out the weather too.”"}, {"text": "Another extension that can help in the classroom environment is Screencastify, a free screen recorder that can produce downloadable and editable videos. “Screencastify is usually needed for school when teachers have assignments that require us to screen record our presentations for example,” senior Sanjita Bhattacharya said."}, {"text": "Despite the far-reaching benefits of extensions, it’s important to keep in mind the storage of your computer. Padalkar said, “Something to look out for is how much storage an extension takes up and the ratings on it to help decide if it is good to install or not.”"}, {"text": "Regardless of the challenges of an academic year, Chromebook extensions have left a positive effect on the lives of students. Student productivity becomes enhanced because Chromebook extensions lessen the workload."}, {"text": "For students new to chrome extensions or people who are just starting to expand their extensions library, chrome extensions provide an opportunity for independence because it’s up to the user which extensions they choose to download or remove."}, {"text": "Zhilaev said, “A student can customize their digital learning experience, letting them work more efficiently in a way best for them.”"}], "file_structural_elements": {"title": "Chrome extensions improve efficiency at South", "date": "April 6, 2021", "writer": {"": {"name": "Elise Ko-Davis", "year": ""}}, "description": "       “Chromebook extensions make certain long, difficult assignments a lot easier,” said senior Akshata Padalkar, who has been using chrome extensions for almost six years. “Chromebook extensions are really helpful when we need to present a topic or even for writing essays.”\n     At South, many st", "image": null}}