{"tree_elements": [{"text": "On the final night before Homecoming, paint brushes glided on long strips of butcher paper, sticky tape ripped and plastered against the splotchy brick wall, dusty graphite and chalk almost magically came together into vivacious images. South students from all four classes desperately rushed to put the final touches on their work: white, yellow, green, and black colors representing Athens, Mexico City, Honolulu, and New York City. This year, students finally returned to school to bring their artistic visions to life for Homecoming."}, {"text": "With a difficult year of virtual/hybrid learning behind them, the traditional energy of Homecoming was in full display as members of every classes’ decorations team began planning their designs. The theme this year was Cities Around the World, a theme decided by the Student Council and their advisor Matthew Coburn. He said the purpose was for students to “celebrate cultures and places around the world and break out of WW-P for just a day or so,” allowing each class to decorate according to the city they wished to represent."}, {"text": "Senior Parmida Espad said, “We wanted to be able to show diversity through the city we chose, and New York obviously has that diversity. It has cuisine from all over the world, a well-known city culture, and a lot of pop culture references that were used for decos.”"}, {"text": "Sophomore Eliana Du said. “While I wasn’t necessarily disappointed by the participation, I would like it, especially for our grade, to be higher.”"}, {"text": "The school’s fire code placed restrictions on how much space the students could work with. Students could only cover a maximum of 20 percent of the walls to prevent their decorations from becoming a fire hazard. This meant that the four classes could not install any hanging decorations."}, {"text": "“There’s so much space, and it’s also a challenge getting everyone on the same page because you have different people on different days,” senior class advisor Gabriel Randazzo said."}, {"text": "In spite of the lower attendance and space restrictions, many students felt glad to be working on decorations again. For upperclassmen who had helped out previously their freshman and sophomore years, it’s a tremendous comfort knowing they can begin returning to their familiar, traditional South customs. For underclassmen who have never experienced real Homecoming decorations, it’s a marvelous introduction to what South student life is all about."}, {"text": "“A lot of people enjoyed it immensely because I feel like being part of Homecoming decorations also felt like we were being part of the move back to being in person,” Du said."}, {"text": "Mr. Randazzo said, “I think everyone did a really good job with what they had available to them. We took on the challenge of the 20 percent, and I think everyone figured out a kind of creative way to handle it and deal with it.”"}, {"text": "This Homecoming, the hearts of South students are proudly on display."}, {"text": "PHOTO BY MARISSA WHITNEY AND LAUREN KIM"}], "file_structural_elements": {"title": "Coming home to Homecoming", "date": "November 11, 2021", "writer": {"x0qtq92usjgRms9hU9NA": {"name": "Alexander Chang", "year": "2021"}, "MNQBpPiewE2i25uloP4l": {"name": "Marissa Whitney", "year": "2021"}}, "description": "     On the final night before Homecoming, paint brushes glided on long strips of butcher paper, sticky tape ripped and plastered against the splotchy brick wall, dusty graphite and chalk almost magically came together into vivacious images. South students from all four classes desperately rushed to", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/image1-2-900x675.jpg"}}