{"tree_elements": [{"text": "As I sat with anticipation on the comfy red chairs in the AMC theater, I wondered: How was the demon Valak brought to earth? Why is a nun involved? How is this movie related to  the “Conjuring?” I couldn’t wait for “The Nun” to begin."}, {"text": "“The Nun” is a prequel to the original series “The Conjuring” one and two. The movie is meant to give a backstory to the demon Valak, who torments the main characters in “The Conjuring 2.”"}, {"text": "“The Nun” was supposed to be this epic movie exposing Valak’s origins, the source of her cruelty in the past Conjuring movies. Instead, “The Nun” raised more questions about the demon Valak, leaving viewers puzzled as the story dragged on."}, {"text": "“The Nun” made over $359 million in the box office.  The mega movie directed by Corin Hardy surpassed the “The Conjuring 2” by $20 million, which astonished movie viewers at South."}, {"text": "Sophomore Vonesha Shaik said that “‘The Conjuring’ series had an amazing plot.” This led her to assume that “The Nun” would be better than the first movies."}, {"text": "Shaik said she thinks that the craze for “The Nun” was because of its sister movies ‘The Conjuring’ part one and two."}, {"text": "She notes the diversity of the cast.  For example, Demian Bichir, a Latino actor who played the role of Father Burke in the film, made “the people in Mexico crazy about the movie.” Another actor, Jonas Bloquet, a Belgian, played the role of a Canadian character Frenchie, who boosted the popularity of the film beyond Latin America."}, {"text": "Many attribute the diversity of the cast to the success of the first two movies in foreign countries."}, {"text": "But not everyone thought the movie was a letdown. Sanya Nair, a sophomore, found the movie “to be super gory with tons of special effects.”  Rather than hating the movie’s ghastly scares, like most of the audience, she said that the “horror aspect was amazing.”"}, {"text": "Nair did not find the ending of the movie startling, unlike Shaik.  She said that the plot made up for the abrupt ending. “Lots of demons, jump scares and creepy music,” were the benefits of going to the theatre, she added."}, {"text": "This moviegoer wondered if the money spent on the ticket, popcorn, and soda were really worth it?"}, {"text": "Although the movie earned a lot of money from the box office, it got tepid reviews from most viewers."}, {"text": "Shaik said that there were “many gory scenes that were unnecessary for the actual plot of the movie.”"}, {"text": "As “The Nun” came to a close, I didn’t hear a single shriek of terror in the AMC theater. Instead, the audience was confounded by the ending."}, {"text": "The true terror in “The Nun” lies in its lackluster performance."}, {"text": ""}], "file_structural_elements": {"title": "Conjuring up a disappointing prequel: “The Nun”", "date": "November 14, 2018", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "      As I sat with anticipation on the comfy red chairs in the AMC theater, I wondered: How was the demon Valak brought to earth? Why is a nun involved? How is this movie related to  the “Conjuring?” I couldn’t wait for “The Nun” to begin. \n     “The Nun” is a prequel to the original series “The Co", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/NUN-T1-0020-900x377.jpg"}}