{"tree_elements": [{"text": "With the endless piles of homework and five tests tomorrow, stress can often feel like a growing weight that never ends. Since the start of the pandemic, high school students across the United States have been conducting classes and activities over a computer, with minimal face-to-face interactions."}, {"text": "South students have also felt more stressed with the start of school following a virtual/hybrid model. According to a survey conducted over a Google form, almost two-thirds of students at South rated their stress levels during the pandemic as an average of 3.35 out of 5, many stating that staring at laptops for hours was the main reason for their stress."}, {"text": "Because many South students have linked their stress levels to increased screen time, it is important to highlight different ways to deal with stress, especially during these unprecedented times."}, {"text": "Chelsea Allen, South’s anti-bullying specialist, advises us to not overlook the importance of sleep. “I cannot stress enough the value and benefit of sleeping and getting enough sleep. It helps recharge your brain and helps you maintain and process the information you’re learning.”"}, {"text": "Not only does a consistent sleep schedule help improve energy levels, but it also helps students in the long run, by aiding the learning process."}, {"text": "Kevin Scully, Biology and AP Environmental Science teacher said, “Are you better off finishing everything and not learning anything, or doing a third of it, learning something and getting some rest so then in the morning you’re ready to actually learn in class?”"}, {"text": "A stable sleep schedule is one way to relieve stress."}, {"text": "Another is making time for exercise, which helps release endorphins, which also helps reduce stress. In fact, exercising earlier in the day can lower stress levels and improve sleep."}, {"text": "Talking to other people about stress can also really help with mental health. Stressors can be hard to talk about, but confiding in someone can provide a new perspective on the stress or even provide a solution."}, {"text": "“Talk to someone: communicate with your teacher, talk to a parent, reach out to your counselor,” said Brooke Parrott, a counselor. “There are a ton of people who want to help! We are aware of how challenging this time is for everyone and are putting in place many more supports for students, staff and families.”"}, {"text": "According to the Mental Health Foundation, another way to relieve stress is to be aware of your surroundings, such as noticing sights, smells and sounds. By taking in the details of your surroundings, your mind shifts away from your stressors. There is no need to sit in the lotus position or buy fancy meditation rugs. Simply bring yourself into the moment, and focus on your breathing and the present."}, {"text": "Although some stressors are beyond our control, we often create more stress for ourselves."}, {"text": "“We bring some of it on ourselves trying to de-stress, but what that actually does is that it adds to the stress,” Mr. Scully said."}, {"text": "Procrastination is a common stressor, and quite painful when too much work starts to pile up. Mr. Scully acknowledged the importance of keeping track of time by creating a schedule."}, {"text": "“I’m setting an alarm. When the alarm goes off, I’m going to do two hours of work,” Mr. Scully said. By sticking to schedules, it is easier to concentrate."}, {"text": "To avoid having to cram time for a quiz or test on the last day, Mr. Scully recommends the following method. “It’s far less stressful to try to learn every class period during class and try to learn while doing classwork at home rather than setting aside a separate time to learn from when you’re sort of getting things done,” Mr. Scully said. By reviewing what is done in class every day, it is easy to be familiar with  90 to 95 percent of the test."}, {"text": "One of the most important ways to cut down on stress is taking a break from homework. Mrs. Parrott said, “I think there are many things that students can do to help with their mental health. Being connected to others, activities, school. Taking time to disconnect from the screen and engage in activities that they really enjoy,” Of course, too many breaks are not helpful, but a break every so often can help soothe your mind."}, {"text": "Stress is an important factor in our lives that needs to be carefully balanced. Mental health can become imbalanced during these unprecedented times and worrying can only amplify that. It is important to take care of yourself."}, {"text": "Photos by Aditi Kamal."}], "file_structural_elements": {"title": "Coping with school-related stress during the pandemic", "date": "January 6, 2021", "writer": {"71hhF0oQr1LLxWE03E35": {"name": "Sidd Shetty", "year": "2021"}, "cvlanWQYrichCyWNFVSY": {"name": "Aditi Kamal", "year": "2020"}, "1gxmLoWPOUXUra1rHMcD": {"name": "Melvina Deb", "year": "2020"}}, "description": "\nRelated Stories\nTime management tips for virtual learning\n\nMental health during quarantine\n\n\n\n    With the endless piles of homework and five tests tomorrow, stress can often feel like a growing weight that never ends. Since the start of the pandemic, high school students across the United States h", "image": "https://thepirateseye.org/wp-content/uploads/2021/01/photo_2021-01-06_13-57-01.jpg"}}