{"tree_elements": [{"text": "South’s doors opened to welcome shoppers into a warm and wonderous world of handcrafted charm at the annual WW-P Holiday Craft Show on Dec. 7."}, {"text": "“The Craft Fair has been running for a little over 25 years,” said Heather Nielsen, a member of the Parent Teacher Student Association (PTSA) executive board and coordinator of the Holiday Craft Show. The event was created by South’s former Accounting Administrator Sherry Bailey “as a means for helping fund student clubs and to help provide scholarships awarded by the school,” explained Nielsen."}, {"text": "To receive funds, students and advisers can sign up as clubs and organizations to volunteer at the Holiday Craft Fair. “We volunteered because it is a major source of funding for our club,” said junior Vaani Bharnagar, Vice President of Academic Decathlon."}, {"text": "Junior Priyanka Rajan, who helped set up the Holiday Craft Show the day before, commented that it was “pretty cool” that clubs could earn money for their time for being involved with school events."}, {"text": "“I think helping people with setting up all their different things they’re going to be selling is a nice way to bring the community together,” Rajan added."}, {"text": "Nielsen agreed that it is a group effort, saying, “There are many teachers and clubs that come to help out and the PTSA could not run the Craft Show without the many hands that do their part to set up and run the show.”"}, {"text": "After volunteers like Rajan set up the Craft Show, other groups of volunteers arrived hours early to help vendors set up. “It’s a buzz of activity that starts at 6 a.m. as the PTSA and the custodial staff make their final preparations and then vendors enter the building at 7 to set up their displays and the items they sell,” described Nielsen."}, {"text": "“I got here really early so I didn’t see any students at the time, but I’ve seen them helping other people,” said Diane Chiocca, French teacher at Grover and first time vendor at the WW-P Holiday Craft Show.\nVendors like Ms. Chiocca start selling their crafts at 9:30 a.m. when the show begins. “There is always a bit of a line at the door because people have come to expect great things from the Craft Show and the vendors always deliver top-notch hand-crafted items,” said Nielsen."}, {"text": "Shoppers can select from an impressive array of personalized, crafted items ranging from homemade soap, to vintage jewelry, unique headbands, crocheted items and wooden baskets."}, {"text": "“It’s better than shopping at the mall because you know that everything you purchase is a quality hand-made item,” said Nielsen. “Some of the skills required to make these items would fall under the ‘lost art’ category in that you don’t find many people in the age of technology making things by hand.”"}, {"text": "One vendor, Bettye Niedt, practices Scherenschnitte, a German scissor-cutting art. Niedt says that she has been coming since the first craft fair."}, {"text": "Niedt, who’s been practicing the art for 28 years, said, “I just saw an advertisement in a magazine and I thought it looked interesting so I sent away for the scissors and that’s how I got started.” Over the years she has sold her art at the Holiday Craft Show."}, {"text": "She has noticed the addition of more crafters and vendors. Ms. Chiocca agreed. She first attended the Holiday Craft Show as a customer. “I like to shop as much as I do sell,” she said, laughing. She was impressed with the professionalism of the vendors."}, {"text": "As for her own table, Ms. Choicca said, “I used to do other craft fairs when my children were young and I started doing these origami flower arrangements this summer. I made over a 100 and I thought ‘Whoops. I have to sell them. There’s no more room in my house.’”"}, {"text": "Her bright paper flowers were a crowd-pleaser."}, {"text": "Rajan said, “And it’s so cool that people make all of those crafts.”"}, {"text": "After the Craft Fair wrapped up at 3:30 p.m. and customers streamed out, Bhatnagar and other student volunteers arrived to help clean up."}, {"text": "“We folded up tables and chairs,” said Bhatnagar. Not only was it a good way to earn funds, but “[i]t was an amazing team building activity.” Bhatnagar added, “I got to know my club mates and had loads of fun lifting the super heavy tables from one part of the school to the other.”"}, {"text": "Bhatnagar looks forward to volunteering at the Craft Fair next year."}, {"text": "Nielsen encouraged others to attend the Craft Fair as well, “If you have never been, I would suggest coming at least one time….you’ll be hooked after that!”"}], "file_structural_elements": {"title": "Crafting joy at South’s Holiday Fair", "date": "December 20, 2019", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "South’s doors opened to welcome shoppers into a warm and wonderous world of handcrafted charm at the annual WW-P Holiday Craft Show on Dec. 7.\n“The Craft Fair has been running for a little over 25 years,” said Heather Nielsen, a member of the Parent Teacher Student Association (PTSA) executive board", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/Flowers-with-color-675x900.jpg"}}