{"tree_elements": [{"text": "“You will never meet someone so dedicated to the art room in our school,” said junior Ridhi Reddy about her classmate Emily Woo. “It’s her home away from home and once you see her artwork you will truly appreciate her talent.”"}, {"text": "Woo discovered her passion for pottery during an art class over a middle school summer. Since the out of school art program wasn’t offered again, Woo had to find another way to pursue her passion."}, {"text": "Looking to continue art, Woo took Art Foundations during her freshman year. “I got to know Ms. Proulx very well,” said Woo."}, {"text": "Jane Proulx has been teaching at South and North for 17 years and counting. She has taught Art Foundations I; Drawing and Painting 1, 2, and honors; AP Studio Art; and Sculpture and Ceramics."}, {"text": "“Towards the end of my freshman year I told her I’ve done wheel throwing [pottery] before,” said Woo. This conversation was her ticket to pursue pottery in the art classroom."}, {"text": "Ms. Proulx’s experience as an artist and as a teacher helped her gauge Woo’s talent. “When you look at people’s work process and what their work ethic is, it helps grow trust. I saw that she followed through and was well organized with her work. Then I asked her a few questions about what she’d done and I figured I’d give her a chance.”"}, {"text": "This opportunity led to some of Woo’s biggest accomplishments: her sophomore and junior years she was a part of The National K-12 Ceramic Exhibition Foundation. This year, in late January she won the highest prize— Best in Show—at the Phillips’ Mill Community Association Youth Art Exhibition."}, {"text": "“I was hoping for a second-place sculpture at best. I didn’t even think first place sculpture would be possible,” Woo said."}, {"text": "This achievement was a turning point in Woo’s life. She explained that the art show validated her passion and potential as a career sculptor."}, {"text": "“I think that junior year is the year that a lot of people are starting to think about what they’re going to do in their life. It helped me solidify the idea of going to an art school and having a purely art-based career,” said Woo."}, {"text": "Due to quarantine, she has not been able to throw. Woo used to spend her free time working in the art classroom and making her pieces flawless.  She is looking forward to getting back to work in the art room next year."}, {"text": "Reddy, a close friend of Woo’s, said, “She is never satisfied with her piece, she always tries her hardest to make it bigger and better each time.”"}, {"text": "Woo’s passion for pottery motivates her to keep improving her work. Although she has sculpted over 40 functional and decorative pieces, Woo is only satisfied with a few. “When I say I’m proud of three to four pieces, that means they reach my standards,” said Woo."}, {"text": "Reddy explained, “Emily has this need to constantly try and improve her artwork, no matter how perfect it may seem to anyone.”"}, {"text": "One of the ways Woo is working to improve her skills is through Ms. Proulx’s sculpting challenges designed to keep Woo experimenting."}, {"text": "“Emily is a very careful, very studious and methodical potter. But a ceramist needs to not put all their eggs in one basket so to speak, at least not early on in their development and understanding clay and all of its issues, because clay has lots of issues,” said Ms. Proulx."}, {"text": "One of these challenges was to make a platter. “Platters are very difficult because there is a centripetal force that works against the clay in extreme ways,” said Ms. Proulx."}, {"text": "Initially, not expecting the challenge to be difficult, Woo struggled with the platter for the first few days."}, {"text": "Ms. Proulx said, “She continued to work and I think it was the third one, maybe fourth, but it took a lot of work to be able to understand and be able to create a platter she wanted to keep.”"}, {"text": "Reddy said that she is excited about Woo’s future as a potter. “She has an insane amount of talent and she has so much perseverance to never give up on her projects, which makes me so thrilled to see what she will produce in the future.”"}, {"text": ""}], "file_structural_elements": {"title": "Emily Woo: a passionate potter", "date": "June 11, 2020", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "“You will never meet someone so dedicated to the art room in our school,” said junior Ridhi Reddy about her classmate Emily Woo. “It’s her home away from home and once you see her artwork you will truly appreciate her talent.” \nWoo discovered her passion for pottery during an art class over a middle", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/527B722A-E6D6-4E52-9F3C-14728EF7AB33-675x900.jpeg"}}