{"tree_elements": [{"text": "“It was truly revolutionary,” junior Ronit Sethi said of “Slumdog Millionaire,” the groundbreaking movie that was nominated for ten Academy awards and won eight of them."}, {"text": "Since the popularity of “Slumdog Millionaire,” the Hollywood movie industry has continued to break racial boundaries at a faster pace than ever before."}, {"text": "Classic Hollywood has traditionally relied on white lead actors, while minorities were rarely found as anything more than supporting roles."}, {"text": "The current movement to bring diversity to  Hollywood movies began in the early 2000s when actors and actresses such as Halle Berry, an African-American actress, began winning awards for their roles in films."}, {"text": "When Halle Berry won Best Actress at the 2002 Oscars for her performance in the romantic drama “Monster’s Ball,” she dedicate her award to “every nameless, faceless woman of color that now has a chance because this door tonight has been opened.”"}, {"text": "Reflecting on this revolutionary moment 13 years later in 2015, Berry was saddened to see that since 2002, the progress of racial representation in films had virtually stopped."}, {"text": "In 2008, the movie “Slumdog Millionaire” came out to high acclaim. This movie features an all- Indian cast, was made in India, and still went on to win Oscars. This was also one of the first movies to become widely popular in the U.S. with an all minority cast."}, {"text": "“Although I was too young to watch it at the time, when I finally decided to watch the movie a few years later, I remember feeling proud that a movie that was so big in the United States had a minority group dominating every role, from the main characters to extras,” said Sethi."}, {"text": ""}, {"text": "After this unprecedented movie, the movement progressed when the television show series Scandal came out – a political thriller that features a strong, African-American woman protagonist played by Kerry Washington. Throughout the entire show, the main character, Olivia Pope, is portrayed as a fierce, talented and successful politician, an unprecedented role for an African-American actress. This furthered the normalization of minority actors and actresses in lead roles."}, {"text": ""}, {"text": "The movement began to pick up more momentum when the historic box office success, “Black Panther,” came out in 2018 – a movie that features a primarily African-American cast that celebrates African culture."}, {"text": "“It was so cool to be able to learn so much about a minority group that we rarely ever get to learn about. It was even more cool that I got to learn about this through a movie that standardized the use of African-American actors,” Adela Agnew, a senior, said."}, {"text": "The newest films helping to standardize minority casts is ones featuring strong East Asian lead actors. On August 15, “Crazy Rich Asians,” a movie that features an entirely Chinese cast, came out in theaters. This had not been done in 20 years, since The Joy Luck Club."}, {"text": "In making the film, the producers-Nina Jacobson, Bradford Simpson, and John Penotti- wanted to create a movie that did not focus on race disparity. When Sethi was watching the film, he “completely forgot about race and just enjoyed the funny, light hearted story.”"}, {"text": "Following this, on August 17, a new Netflix film, “To All The Boys I Ever Loved”, was released. It details a story about a typical high school caucasian jock that falls in love with a typical high school nerdy girl; however, this time, that girl is Korean. This movie furthered the normalization of different races being in lead roles."}, {"text": "Although Hollywood has a long way to go, progress has been made in seeing more races represented in Hollywood. Who knows, maybe Hollywood will soon accurately reflect the demographics of our nation."}, {"text": ""}], "file_structural_elements": {"title": "Evolution of entertainment industry representation of minorities", "date": "November 14, 2018", "writer": {"vcRNXdDaPStd2IWpBNRh": {"name": "Alexa Bornstein", "year": "2018"}}, "description": "     “It was truly revolutionary,” junior Ronit Sethi said of “Slumdog Millionaire,” the groundbreaking movie that was nominated for ten Academy awards and won eight of them.\n     Since the popularity of “Slumdog Millionaire,” the Hollywood movie industry has continued to break racial boundaries at ", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/Hollywood-900x654.jpg"}}