{"tree_elements": [{"text": "From runway to display, fast fashion is taking over the country. But what is fast fashion?"}, {"text": "According to Merriam Webster, fast fashion is defined as an approach to the design, creation, and marketing of clothing fashions that emphasizes making fashion trends quickly and cheaply available to consumers."}, {"text": "Essentially, fast fashion is cheap and trendy clothing made to keep up with fast-changing styles. However, the need to keep up with the fast pace of fashion has led to a harmful shift in the fashion industry."}, {"text": "Fast fashion became popular around the 1990s and early 2000s when dressing better for less became more popular. The rise of fast-paced fashion retailers began with  companies like Zara, H&M, and TopShop. Consumers used to be interested in purchasing clothes from designer labels, not only for the name but for the guaranteed quality. Today, consumers want similar designer styles for a fraction of the price, with less concern on quality. This shift in consumers’ standards gave cheaper fashion retailers an opportunity in the market."}, {"text": "But, these rapidly growing brands have been linked to approaches like sweatshop labor and environmentally detrimental clothing production. These so called advantages have repercussions."}, {"text": "Fast fashion is often called disposable fashion. The time it takes to produce fast fashion  is about the same time they lose their wearbility and are disposed of by the consumer, leading to a waste problem. Textile waste is a consequence of fast fashion because of the disinterest in buying and keeping long-lasting clothing in favor of fast produced must-have trendy items. Fast fashion is becoming a serious environmental issue."}, {"text": "The idea of fashion being reduced to a quick money making, environmentally deteriorating business is unfortunate. But the problem of fast fashion doesn’t stop at textile waste."}, {"text": "Many of the clothes we wear are often made by workers with terrible working conditions. Many fashion companies want to lower their cost of production, and to bring their brands to countries such as India and Bangladesh. The manufacturers often comply with below average working conditions because they are concerned about company profits."}, {"text": "Poor working conditions include everything from working with toxic substances, working 96 hours per week and insubstantial wages. These poor working conditions were seen in the collapse of the Rana Plaza in 2013, killing 1,134 garment workers in Dhaka, Bangladesh. Factory workers from the Rana Plaza had complained about sounds coming from the building, but they were forced to work regardless. Days later, the eight-story building collapsed trapping and killing many. The fast fashion industry may be a lifeline for money, but it comes at a cost."}, {"text": "Recently, e-commerce companies have been thriving off of women’s trendy fashion. Online stores like SheIn, Zaful, Romwe and more have grown in popularity. One of their main tactics is advertising through social media on apps like Instagram and Facebook. Though the websites look like reliable stores similar to H&M and Zara, they prove another negative side of fast fashion–untrustworthiness."}, {"text": "According to an investigation done by Observer, which covers the top stories of the latest trends in lifestyle, arts and celebrity news, e-commerce companies often fabricate shipping promises, falsely advertise clothing quality.  Interestingly, the Federal Trade Commission, a federal agency dedicated to protecting American consumers, has the companies on their radar for fraud."}, {"text": "However, despite these findings about fast fashion, there are strides being made to fix the problems at hand."}, {"text": "One solution is circular fashion. The idea was first introduced by Dr. Anna Brismar, Founder of Green Strategy, a sustainable green fashion consulting company in 2014. The idea of circular fashion is to shift aspects of style and make it more suitable for remake, reuse, or repair at the end of a garments cycle. Thrift shopping is a popular example of circular fashion–buying gently used garments, giving them another cycle of life, rather than disposing the item."}, {"text": "The idea of circular fashion is being adopted by retailers and consumers both. Data, gathered by the 2019 Resale Report from online thrift store thredUp, shows that consumers are becoming environmentally conscious, now shifting towards more affordable used items. Thrift stores like Plato’s Closet, Goodwill, and online store thredUp have risen in popularity, and prove consumers interest and shift towards circular fashion."}, {"text": "At the end of the day, many businesses will continue to only focus on profit and making the most money through otherwise flawed practices. However, consumers have the power to make change. If consumers choose to shift from detrimental fast fashion companies to generally safer companies for the environment and workers, other businesses are bound to accommodate. Businesses will strive to be part of the solution of a now harmful fashion industry, in order to keep up with consumers standards for a safe fashion industry."}, {"text": "Fast fashion is a problem. But, there are  a growing number of solutions that consumers can take part in. It’s up to consumers to become a part of solution and set new standards for an affordable fashion industry."}], "file_structural_elements": {"title": "Fast fashion may be cheap, but at what cost to quality, human rights, environment?", "date": "May 21, 2019", "writer": {"818DmKSTZB84ddo0ViFd": {"name": "Maanya Narain", "year": "2018"}}, "description": "     From runway to display, fast fashion is taking over the country. But what is fast fashion?\n     According to Merriam Webster, fast fashion is defined as an approach to the design, creation, and marketing of clothing fashions that emphasizes making fashion trends quickly and cheaply available to", "image": null}}