{"tree_elements": [{"text": "For the first time in over a year and a half, South’s band played a live concert. On May 17, South’s orchestra, jazz band and combined symphonic band and wind ensemble played a variety of pieces that had been continuously rehearsed for months. It took place  in North’s outdoor tent, where each group played a few songs for audience members who sat socially distanced."}, {"text": "For many, this concert was the first in-person event in the 2020-21 school year. For others, it was simply a relief to be playing again after such a long period of quarantine."}, {"text": "For seniors, it was their last performance as members of South’s esteemed music program."}, {"text": "“It felt as if for one moment I wasn’t thinking about college, graduation or the pandemic,” said senior trumpet player Jonathan Sauer “All I could think about was performing with the people around and enjoying the music for one last time.”."}, {"text": "Everyone playing was committed to putting on a concert on par with the performances of the past, even without the usual rehearsal and practice time."}, {"text": "South’s Orchestra nonet, a group of musicians handpicked from orchestra director Bob Peterson, played the beautiful three-movement piece “Brook Green Suite” by Gustav Holst and reminded the audience of the high standard of excellence set by the students here at South."}, {"text": "The jazz band, needing only a couple of in-person rehearsals, put on a funk-filled show consisting of “One More Once” by Jeff Coffin, “Buffalo Wings” by Mike Carubia, “Act Your Age” by Gordon Goodwin, “I Get a Kick Out of You” by Cole Porter and “Chameleon” by Herbie Hancock. Almost all of them featured grooving drum and basslines, exciting horn movements and solos from everyone involved."}, {"text": "To end the already exciting concert, symphonic band and wind ensemble teacher Jesse Argenziano presented each senior band member to the audience and then brought the symphonic band and wind ensemble as in-person “forces” to play the uplifting piece “Sedona” by Steven Reineke. It was a happy ending to an admittedly disappointing year for many."}, {"text": "A scaled-down band concert for the South community was a good start to what might be the end of the coronavirus pandemic."}], "file_structural_elements": {"title": "First Combined Band Concert since Pandemic", "date": "June 20, 2021", "writer": {"": {"name": "Leo \"Satch\" Berger", "year": ""}}, "description": "     For the first time in over a year and a half, South’s band played a live concert. On May 17, South’s orchestra, jazz band and combined symphonic band and wind ensemble played a variety of pieces that had been continuously rehearsed for months. It took place  in North’s outdoor tent, where each ", "image": null}}