{"tree_elements": [{"text": "Valentine’s Day is here once again–single and ready-to-mingle teenagers spend the most romantic day of the year on their couches with cheesy rom-coms and piles of homework. Below is a list of our five picks."}, {"text": "Twilight"}, {"text": "This fantasy Y2K series had every 13 year old girl in the country swooning over the actors Robert Pattinson and Taylor Lautner. But the overall premise of the movie had us all cringing. The usual dangerous, vampire boyfriend and the innocent, nerdy girlfriend combo is something we’ve seen enough of in Vampire Diaries. Bella Swan said, “Dying in the place of someone I love seems like a good way to go.” Not only is the dialogue cheesier than a Wisconsin school lunch but the scene filters are something that will haunt us forever."}, {"text": "Tall Girl"}, {"text": "With its highly charismatic cast, one would have thought that “Tall Girl” would’ve been one for the ages. But the method in which this film treats sensitive issues like bullying and body dysmorphia is infantile and ignorant. Sophomore Maya Patel said, “The plot was executed very poorly. It was illogical and I didn’t like how Jodi had to change her personality to fit his expectations.”"}, {"text": "To All the Boys I’ve Loved Before"}, {"text": "This movie definitely hits a little too close to home. The extent to which a person becomes obsessed with a crush is something many of us are probably too embarrassed to share. This movie, according to sophomore Mahek Upadhay, highlights “what should have happened” rather than “what did happen.”"}, {"text": "The DUFF"}, {"text": "In its rather successful attempt to reiterate social hierarchy in high school cliques, “The DUFF” shows how even the closest friendships can be ripped apart with the right amount of gossip. A“DUFF” is an acronym for being a “designated ugly fat friend.” This movie highlights the dark side of being “popular” and shows how it can take a strain on one’s mental health. Freshman Rachel Joseph said, “The term “DUFF” sets a bad image and makes one question themselves of being a “DUFF” and creates “unnecessary insecurities.”"}, {"text": "The Kissing Booth"}, {"text": "The 2018 blockbuster Netflix film series “The Kissing Booth” is something we’ve all secretly watched as a guilty pleasure. With its over 25-year-old cast playing adolescent teenage roles, this movie sets the bar really high for pubescent pirates. In the film, boys are so tall they can’t fit in a car and all the girls look like clones of Instagram models. It’s an unrealistic image for all boys to be taller than six feet and for every girl to wear makeup and high heels everyday. Sophomore Samar Rahmani agrees, “It’s so far off. They put so much effort into looking perfect and it made me feel pressured to put more effort in dressing up everyday.”"}], "file_structural_elements": {"title": "Five worst must-see Valentine’s rom-coms", "date": "February 14, 2022", "writer": {"arVyKy5gQKK0nVfft2Bk": {"name": "Deepa Srinidhi", "year": "2021"}}, "description": "Valentine’s Day is here once again–single and ready-to-mingle teenagers spend the most romantic day of the year on their couches with cheesy rom-coms and piles of homework. Below is a list of our five picks.\nTwilight\nThis fantasy Y2K series had every 13 year old girl in the country swooning over the", "image": null}}