{"tree_elements": [{"text": "Why are chocolates and flowers considered the go-to gift for Valentine’s Day, birthdays, graduations, thank you, or just because?"}, {"text": "It’s funny how cliché these presents become after getting these for other people or receiving them ourselves."}, {"text": "*link to='https://nrf.com/media-center/press-releases/nrf-says-consumers-will-spend-near-record-196-billion-valentines-day'*2 billion dollars on flowers and 1.8 billion dollars on candy*/link*"}, {"text": "A poll of South students showed that 47 percent of students would give both flowers and roses as a gift. When asked about their choice of flower to give, 50 percent of students preferred roses."}, {"text": "Flowers are great; chocolate is appreciated. But how much can a person receive before it becomes excessive?"}, {"text": "“I’m tired of flowers and gifts and chocolates,” said sophomore Chacrica Pagadala. “Presents are not going to make your relationship stronger, [they are] just going to be a waste of time, money and roses.”"}, {"text": "The saddest part is, both flowers and chocolate are cheaper when there isn’t a holiday. Prices spike suddenly around Valentine’s Day and Easter because of the high demand."}, {"text": "“It‘s just the nature of capitalism,” American Studies teacher Joseph Gilch said. Stores purposely place elaborate bouquets along with fancy chocolates in the front and in the aisles that customers walk through. This tempts customers to buy the products."}, {"text": "“The chocolates and roses oversimplify [holidays],” Mr. Gilch said. Rather than a day filled with connections and time to spend with others, we give roses and chocolates."}, {"text": "Everyone is busy. Time is limited. “The tough part is keeping things heartfelt,” Brian Levinson, World History and ESL teacher, said."}, {"text": "Pagadala said, “Valentine’s Day means nothing to me, it is just another day.”. Instead of taking the day off to spend quality time with loved ones and making meaningful moments last, people use Valentine’s Day and other holidays as a way of substituting love with gifts."}, {"text": "“We are trying to bring back meaning into holidays that are slowly losing their meaning,” Mr. Gilch said."}, {"text": "This is similar to sending a messenger to say something instead of talking face to face. If we truly love somebody, do we need to shower them with gifts to show them that?"}, {"text": "No. Love and care can be shown through so many other ways. There is the option of a nice dinner together or revisiting a place filled with happy memories."}, {"text": "However, it is true that gifts are a sign of someone working to maintain a strong relationship. “You can give and get a lot of chocolates from being close to your friends,” said sophomore Vaani Bhatnagar. But should our minds go directly to the stereotypical gifts of chocolates and flowers?"}, {"text": "The best way to pick a gift is to “figure out what the person is interested in, what their hobbies are and what they like to do,” freshman Dylan Gaillard suggested. “I would get them something associated with their personal interests.”"}, {"text": "“I would bring them something only we share,” Bhatnagar said. “It could be something related to the things we do together or something they found funny about me or vice versa.”"}, {"text": "“Creating a good relationship is not so much buying things for people,” Mr. Gilch said, “but it is constantly challenging a person and being challenged by them to think outside what you normally do and go against the norms that we usually think about.”"}, {"text": "So, what should we do on special days like Valentine’s Day or your friend’s next birthday? To me, these days are a day to sit back and enjoy spending time with the people I care about and the relationships that I value in my life. It is a day to take a leap of courage and tell these important people how much they mean to me as well as how much they help me on a daily basis. It is a day to rekindle old connections, or even start new, even more, beautiful ones."}, {"text": "Holidays and birthdays are days to create and maintain bonds with others. It should be symbolized with so much more than the same gifts–chocolate and flowers."}, {"text": "PHOTO COURTESY OF PIXABAY"}], "file_structural_elements": {"title": "Flowers and chocolates make for uninteresting special occasion gifts", "date": "April 1, 2019", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "    Why are chocolates and flowers considered the go-to gift for Valentine’s Day, birthdays, graduations, thank you, or just because?\n     It’s funny how cliché these presents become after getting these for other people or receiving them ourselves.  \n     According to a National Retail Federation su", "image": "https://thepirateseye.org/wp-content/uploads/2019/04/Screenshot-2019-04-02-at-1.05.09-PM.png"}}