{"tree_elements": [{"text": "The Coward House fire paved the way for the construction of South. “I remember the flame shooting out a mile high,” said Ms. Denise Bowker (‘80), who witnessed the burning in 1973."}, {"text": "The Coward House was one of the many farm houses in West Windsor, once a farming haven. “West Windsor was essentially a farming community since the first colonial settlement,” said Mr. Paul Ligeti, Vice President of the West Windsor Historical Society."}, {"text": "Ms. Kristine Javick (‘95), South counselor, said, “[South was] built on a former potato field, which is what most of West Windsor was. There used to be a lot of potato fields, a lot of farms.”"}, {"text": "This included the Cowards, who owned a barn, wagon shed and a house that was built in the mid 1700s — the same house that would be demolished to build South. The Cowards farmed wheat, potatoes, corn, and, eventually, tomatoes for the Campbell’s Soup Company, headquartered in Camden."}, {"text": "However, post World War II and the subsequent baby boom brought an influx of families, transforming the farming town into suburbia."}, {"text": "Princeton High School, which students in West Windsor formerly attended, became overcrowded."}, {"text": "“As a result, Princeton gave West Windsor until 1974 to build a new high school,” Ligeti said. This new high school would become South."}, {"text": "The chosen plot for South coincided with the old Coward house and property, which was already sold to the township. After deliberation, the township’s board decided to demolish the house."}, {"text": "Immediately, local efforts to save the house began. As the West Windsor Historical Society Archives notes, local residents spearheaded campaigns to save the house, and argued that community members could rehabilitate it or even turn it into a museum."}, {"text": "However, the efforts to save the house were ultimately in vain and as many saw the house as an “eyesore,” it was ultimately burned down, attracting spectators."}, {"text": "Many mourned the loss. “It was an example of a larger trend that people didn’t like to see that these old historical places that have been"}, {"text": "around forever, being torn down in place of suburban developments,”"}, {"text": "around forever, being torn down in Ligeti said. “It was a familiar icon for many people.”"}, {"text": "From a historical standpoint, this house also carries patriotic significance. “There were certain members of the Vorhees [ancestors of the Cowards] family who may have served in the American Revolution,” Ligeti said."}, {"text": "Ms. Bowker is more wary over the preservation of the house. “It was an old house that was definitely falling down,” she said. “I know people were saddened by that. But I’m not so sure it was salvageable.”"}, {"text": "Yet this represents a bit of West Windsor’s quickly vanishing history. “From my perspective, there ought to be a plaque talking about the history of the farm, and how the school developed,” Ligeti said. “This history is everyone’s history, regardless of whether or not they lived here for two days, or, for two hundred years. The people who lived in the past weren’t just footnotes, that they actually lived lives as nuanced and as important as ours.”"}], "file_structural_elements": {"title": "Forgotten History: South’s origins", "date": "November 17, 2022", "writer": {"mmPM0AAOdiQuDZH4MUVF": {"name": "Karen Yang", "year": "2022"}, "4O50QdSwGku17T0Iu4Mx": {"name": "Smiti Yadla", "year": "2022"}, "": {"name": "Sri Sowmya Tanguturi", "year": ""}}, "description": "A bird’s eye view of South, which was once Coward Farm. (Image by West Windsor Historical Society)\nSouth rests on where the Coward House once stood. (Image by West Windsor Historical Society)\nThe Coward House fire paved the way for the construction of South. “I remember the flame shooting out a mile", "image": "https://thepirateseye.org/wp-content/uploads/2022/11/Screen-Shot-2022-10-11-at-2.42.29-PM-900x600.png"}}