{"tree_elements": [{"text": "As a young boy with no ties in the acting industry, Ethan Levy found the fuel to spark his acting career at Grover. This interest ignited when Levy, recalled as middle schooler, “I built relationships with the directors through the crew. The following year, I was cast as the wizard for ‘The Wizard of Oz’ which was a really cool experience. That was the beginning of my journey.”"}, {"text": "Levy, a Pirate who graduated in 2009, has been pursuing an acting career ever since. From starring in “The Wizard of Oz” to claiming a notable and humorous role in HBO’s hit show “The Righteous Gemstones” as Mo Carlis, Levy has made his mark in Hollywood."}, {"text": "Levy has attained many accomplishments and unforgettable memories in the past years. “I always sought out every opportunity to work on my craft. I did school plays, community theater, student films, for many years.”"}, {"text": "Levy first realized his love and passion for acting at his sister’s performance in Grover. “I saw my sister in a production of ‘Peter Pan’, and it was absolutely amazing,” said Levy, “After seeing that, I knew I wanted to be on stage.”"}, {"text": "Naturally, since that day, he’s been an aspiring and avid fan of the film industry. “Nothing else ever came close to igniting my soul as much as acting,” he said.  And as he grew older, “that never went away.”"}, {"text": "Levy believed another highlight of being an actor at South was his opportunity to teach students at middle schools about social justice issues. He often put on shows alongside the Pirate Players, South’s school theater troupe. He said, “Working with the Pirate Players, the sole purpose is to perform plays in front of younger students, educating about bullying, suicide, gun violence, eating disorders.”"}, {"text": "“Being able to utilize your art to help better the world–that’s a gratifying experience,” said Levy."}, {"text": "Levy stressed the importance of focusing on improving his skill whenever he could. “I was consistently presented with roles that helped me assess my skills as an actor.”"}, {"text": "Levy said, “Nothing has thrilled me more than interpreting a script and discovering how I’m going to breathe life into a role. When you’re out there in the real world, there are constant distractions, and the hustle and bustle of life can get noisy, but when you’re on stage or on set you have to be present, there’s no other choice but to be present.”"}, {"text": "Levy has worked on many Hollywood projects. His most recent is  “The Righteous Gemstones,” which stars Danny McBride. “ Levy said, “Working alongside comedic legends you grew up admiring is a surreal experience.”"}, {"text": "Not only has Levy landed HBO roles, but also has had the opportunity to work with other accomplished actors and directors. “I’ve had many, many wonderful opportunities so far in my career. But, I’d say working with Ron Howard and McBride are there on the hierarchy of experiences,” he said."}, {"text": "While Levy has accomplished many roles and has been able to pursue his dreams, there were some challenges. “Eventually the many years of hustling hard paid off,” he said. “I was prepared for when that golden opportunity rolled around. Of course the road has been far from smooth but anything worth having takes time.”"}, {"text": "He was cast in  “Hillbilly Elegy”, a movie released Nov. 11, 2020 and directed by Ron Howard, but unfortunately got his scene cut. “That was a really cool experience. Unfortunately my scene didn’t make the final cut, but that happens. He [the director] was very generous, he actually wrote me a letter weeks before the movie was to be released.”"}, {"text": "For aspiring actors at South, Levy highlighted, “Pursue what ignites your soul, remain persistent, keep showing up, and be kind to yourself and others.”"}], "file_structural_elements": {"title": "Former Pirate now upcoming actor", "date": "March 28, 2022", "writer": {"71hhF0oQr1LLxWE03E35": {"name": "Sidd Shetty", "year": "2021"}, "0LTNH0YiaG7NWv8Ik0Uj": {"name": "Ishita Vinay", "year": "2021"}}, "description": "     As a young boy with no ties in the acting industry, Ethan Levy found the fuel to spark his acting career at Grover. This interest ignited when Levy, recalled as middle schooler, “I built relationships with the directors through the crew. The following year, I was cast as the wizard for ‘The Wiz", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/Actor-article-picture.png"}}