{"tree_elements": [{"text": "Traditionally, on the first day of high school, as freshmen walked into South they were greeted by their new classmates and teachers. While carrying their backpack nervously on one shoulder, they looked for their classes with schedules in hand through the crowded halls."}, {"text": "This typical first day of high school was not the case this year for incoming freshmen. Instead, most of the freshmen class experienced their first day of high school via Zoom while others experienced a half-day at South as part of a hybrid group. Because of the pandemic, sports are canceled and clubs are being conducted virtually, and the freshmen class is having an atypical year. As a result, the opportunities for making new friends and getting involved in new clubs and sports were reduced for freshmen, an experience that many were looking forward to."}, {"text": "Sports opportunities were one of the important ways freshmen could get to know other students."}, {"text": "“It’s not going really well as I was looking forward to basketball season and other sports, which I think we aren’t going to have,” freshman Vraj Patel said."}, {"text": "Moreover, transitioning to high school from middle school, in general, has been challenging for freshmen. However, with their in-person eighth-grade experience cut short, they were unable to experience eighth-grade graduation and some feel they never traditionally transitioned into being a high schooler."}, {"text": "“I feel like it is unfortunate, since my grade didn’t really get to celebrate getting out of eighth grade, and our experience is much different from the other grades above us,” said freshman Henna Sharma."}, {"text": "As the Class of 2024 President, Sharma wants her classmates to feel comfortable through the adjustments."}, {"text": "Although virtual students have adjusted to the Zoom format of classes, some find that socializing and communicating with teachers and peers can be a challenge."}, {"text": "“The ability to fortify previous friendships is hard when you don’t have a commonplace to see each other,” said freshman Naveen Enock. “It’s really hard to ask a teacher questions because not everyone feels comfortable asking on Zoom.”"}, {"text": "“It’s definitely not what I expected, and it has its ups and downs. I can do all my work at home while relaxed, but I’m also missing out on the fun parts of school,” said freshman Ranveer Chavan."}, {"text": "Despite the challenges the freshmen have faced in adjusting to high school, the freshmen continue to maintain a positive attitude by engaging in activities virtually such as dressing up on Zoom for Homecoming Spirit Week."}, {"text": "Homecoming is one of the highlights of high school and was highly anticipated by the freshmen class."}, {"text": "“I feel like Homecoming isn’t what we thought it was going to be but if we try our hardest to have fun and participate, we can still enjoy it,” said Sharma."}, {"text": "Now, it is December, and reflecting on Spirit Week the freshmen were glad they were able to participate in Homecoming, earning second place against all grades in Spirit Week participation."}, {"text": "“I thought it was fun to see our classmates participating,” said Sharma."}, {"text": "In addition to virtual participation, many freshmen contributed to Homecoming traditions. Freshman Grace Teng, who is taking the hybrid option, was able to participate by helping with the Homecoming decorations."}, {"text": "“Under the circumstances, I enjoyed being able to participate in some aspect of Homecoming by helping out with the decorations with my friends,” said Teng."}, {"text": "In order to encourage freshmen to socialize and meet new people at South, the Student Council has also created new traditions to ease the transition for freshmen. Students can participate in virtual school activities such as occasional Trivia Nights, in which South students and teachers come together to play games. Clubs have also continued to conduct meetings through a virtual format this year, giving freshmen a chance to meet new students."}, {"text": "“I am actually pretty satisfied with the clubs and volunteering activities because I think they are doing really well even virtually,” said Enock."}, {"text": "Many freshmen have opted for the hybrid option as a way to meet new people at South in person and adjust to the high school environment."}, {"text": "Teng said, “I decided to take hybrid because life is all about experiencing new things. If I stayed at home, I will probably never get a chance to experience going to school during a pandemic.”"}, {"text": "However, whether the freshmen are taking hybrid or virtual, they are excited and hopeful for their future at South."}, {"text": "Sharma said, “I’m excited to see what the future inside South holds to see how the school works and make new friends.”"}], "file_structural_elements": {"title": "Freshman year during COVID-19", "date": "December 22, 2020", "writer": {"l7VmOCUaYoPYE1PNDIbH": {"name": "Shivani Sadasivam", "year": "2020"}}, "description": "    Traditionally, on the first day of high school, as freshmen walked into South they were greeted by their new classmates and teachers. While carrying their backpack nervously on one shoulder, they looked for their classes with schedules in hand through the crowded halls. \n     This typical first ", "image": "https://thepirateseye.org/wp-content/uploads/2020/12/9A953097-C510-4535-8550-E202ECFA9D93-900x507.jpeg"}}