{"tree_elements": [{"text": "Not only does freshman Noah Hinsdale have Pirate pride but he has also performed on Broadway with one of the most notorious pirates: Captain Hook."}, {"text": "Hinsdale played the role of Michael Llewelyn Davies in “Finding Neverland.” which is about J.M Barrie’s journey to creating the much loved childhood classic “Peter Pan.” How did Hinsdale get to Broadway? His career started when he was just six years old with his first show “A Christmas Carol” at McCarter Theatre in Princeton."}, {"text": "“My mom picked up a newspaper one day and asked me if I wanted to audition,” Hinsdale remembered. Auditioning for “A Christmas Carol,” he said, was “the best decision of my life.”"}, {"text": "When he saw his first Broadway performance of “Wicked,” he knew that he wanted to take part in the  Broadway experience. Once he realized that, his mom took him to New York City to audition for an acting agency."}, {"text": "“Luckily,” Hinsdale said, “the first agent I tried out for accepted me and I started to get acting jobs from there.”  In 2015, Hinsdale secured a part in his first Broadway show in the cast of “Finding Neverland.”"}, {"text": "“Every time I went on stage, I thought of how lucky I was to be in that position and I enjoyed the thought of giving the audience the entertainment they paid for,” Hinsdale said."}, {"text": "Hinsdale has performed in other well-known shows such as “Nine” and “The Secret Garden,” as well as “Fun Home,” an off-Broadway production."}, {"text": "During his time on “Finding Neverland,” Hinsdale worked with professional actors. “They taught me much of what I know today,” said Hinsdale."}, {"text": "“I was in the show with six other boys, and there was this one incident where there was a french fry on stage while the show was going on.,” said Hinsdale. “We all were trying not to laugh, but it was impossible. We had a bad talk with the director after that show.”"}, {"text": "Hinsdale wouldn’t have had this opportunity to be on Broadway without his mom’s support. Hinsdale said his mom was always into musical theater and the arts. She provided him with vocal lessons to help him improve his singing voice. “She taught me to be my best, even when my voice was bad or I was sick.”"}, {"text": "As a Broadway actor, he gained social media attention through fan accounts and fanart as well as the request to sign playbills. But being a teenager, he felt that “it was a lot to handle.” Hinsdale decided that he wanted to focus more on school and spend less time on social media. Hinsdale performed his final show of “Finding Neverland” and stepped down from professional theater since 2016."}, {"text": "Hinsdale has a love for theater and so he still takes part in shows locally, including South’s production of “Bring It On.”"}], "file_structural_elements": {"title": "Freshman Noah Hinsdale performs on Broadway and McCarter Theater", "date": "March 28, 2019", "writer": {"BpJiyaRd5yUVxEfXfKmO": {"name": "Jaidyn Hines", "year": "2018"}}, "description": "     Not only does freshman Noah Hinsdale have Pirate pride but he has also performed on Broadway with one of the most notorious pirates: Captain Hook.  \n     Hinsdale played the role of Michael Llewelyn Davies in “Finding Neverland.” which is about J.M Barrie’s journey to creating the much loved ch", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/noah-hinsdale.jpg"}}