{"tree_elements": [{"text": "Google Docs, YouTube, Zoom, Flipgrid, Desmos and thousands of other websites and applications have helped students and teachers push through last year’s virtual/hybrid schooling in WWPRSD, as well as districts nationally and globally."}, {"text": "*link to='http://learnplatform.com/top40'*LearnPlatform*/link*"}, {"text": "This year in WWPRSD, with the transition back to in-person school, students are re-adjusting to the standard classroom with less technology."}, {"text": "Sophomore Quintis Crosland said, “It was really hard and challenging because virtual schooling made me very lazy. I was mostly in my bed during Zoom meetings. Now I have to come to school, walk around the halls, and put a lot more effort into all my work so it has made it a lot harder.”"}, {"text": "Some students are glad to get back to traditional paper and pencil learning. Sophomore Angelina Berrios said, “I prefer paper when it comes to physically reading and writing things because when reading things, online you can get confused where you are and you can’t properly annotate which is the only downside to online schooling.”"}, {"text": "In-person learning is necessary for activities such as science labs and engaging classroom discussions. Chemistry teacher Mr. Pitts said,"}, {"text": "“There’s a lot of things that we do that require actual equipment. You can have some simulations online, but I think that using lab equipment and learning how to do things responsibly in that setting is super important for any kind of technological field.”"}, {"text": "French teacher Szilvia Juhasz said, “I think the students need a little more time to get used to being in person again. Honestly I anticipated for the kids to be more nervous but they really weren’t. They were very flexible and they learned fast.”"}, {"text": "For students still transitioning to in-person learning, Pulido advises: “You just have to form a habit again.”"}], "file_structural_elements": {"title": "From all Cameras On to All Pencils Up!", "date": "November 9, 2021", "writer": {"441oJuAOMJ93mb04Urf2": {"name": "Jordan Blaise", "year": "2021"}}, "description": "Google Docs, YouTube, Zoom, Flipgrid, Desmos and thousands of other websites and applications have helped students and teachers push through last year’s virtual/hybrid schooling in WWPRSD, as well as districts nationally and globally.\nAccording to LearnPlatform, an organization that evaluates digita", "image": null}}