{"tree_elements": [{"text": "Happiness in America reached a record breaking low in 2019. According to the Harris Poll, one of the longest running U.S. public surveys, only about 30 percent of Americans are happy. The causes of unhappiness vary from personal, national, or global issues. Although there is no magical cure to make people happier, there is one concept that can help: gratitude."}, {"text": "The word gratitude comes from the Latin word “gratus,” which means pleasing or thankful. Gratitude is the state of being grateful and showing appreciation. The practice of recognizing what one is grateful for is proving to be a key factor in benefiting people’s mental health, happiness and overall quality of life.\n“Expressing gratitude always makes me feel good, even if it’s in a small way,” said senior Lea Martin."}, {"text": "One recent study performed by psychologists at the University of Miami showed that writing down what you’re grateful for greatly improves mental health and mood. After just ten weeks, the results showed that the participants felt more optimistic."}, {"text": "These positive feelings that arise after expressing gratitude is not just a coincidence. A person’s brain activity chemically changes when they express gratitude. The Greater Good Science Center at The University of California, Berkeley tested this by measuring brain activity with an fMRI scanner when subjects were engaged in small acts of gratitude. Their brain activity showed that felt happier and their mental health improved."}, {"text": "In addition, similar to mindfulness and meditation, gratitude proves to be an effective stress reliever."}, {"text": "Most students at South have practiced meditation in health classes, Unconferences, clubs or even on their own as an outlet to relieve stress. Gratitude has proven to be just as effective and is also practical for busy students. Meditation requires time taken out of your day to sit and be mindful, but expressing gratitude can be done in a matter of seconds, and is proven to be just as constructive."}, {"text": "It is very easy in today’s society to forget how to be grateful. Not only does social media have a direct link to people’s unhappiness, but social media also hurts people’s ability to express gratitude.\nSocial media users get wrapped up in looking at altered realities of other people’s lives since most of it only shows the parts of their lives they want the public to see. It is easy for people to get jealous and upset that their own life doesn’t live up to the ones they see on their screens. Jealousy causes people to become ungrateful about what they have in their own lives. This is why it’s more important to regularly practice gratitude now more than ever before."}, {"text": "Fitting gratitude into everyday life is simple. Everyone has time to take a minute and think about what they’re grateful for."}, {"text": "“I always try to take time out of my day to think of what I’m grateful for. It’s a good way to get perspective,” said senior Phoebe Elias."}, {"text": "Another method is taking a minute at the end of the day to write down things people are grateful for that day. This simple task of jotting down a few words and expressions of gratitude is a great way to practice mindfulness. Keeping a gratitude journal is an easy way for people to organize their thoughts and even look back on previous days and remind themselves of what they’re grateful for."}, {"text": "This is seen in Ms Hayden’s junior health classes, where her students write in gratitude journals every day. “So far (the gratitude journals) have been pretty helpful for me,” said junior Raagavi Venkatesh. “Sometimes it’s hard to think of things every day, but I have realized that even the smallest things count.”"}, {"text": "It’s important for people to start practicing gratitude now because it is the future source of our happiness. Gratitude is such a simple act that everyone can incorporate into their busy lives. With the holiday season in full swing, it’s a great time to put some thought into what you’re grateful for."}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Gratitude: the right attitude", "date": "December 20, 2019", "writer": {"": {"name": "Alyse Dunn", "year": ""}}, "description": "Happiness in America reached a record breaking low in 2019. According to the Harris Poll, one of the longest running U.S. public surveys, only about 30 percent of Americans are happy. The causes of unhappiness vary from personal, national, or global issues. Although there is no magical cure to make ", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/Book-Black-and-White-900x900.jpg"}}