{"tree_elements": [{"text": "“3 a.m. and I’m still awake,” sings Miss Americana, Taylor Swift, in the opening line of “I Bet You Think about Me.” South fans were “still awake” as midnight approached on last Nov. 12, in anticipation of the arrival of her long-awaited album “Red (Taylor’s Version).” Not only were we looking forward to the release of her new album, but we were also excited to see how Swift grew from a small-town girl from Reading, Pennsylvania, to Miss Americana, which is also the title of her 2020 Netflix documentary."}, {"text": "It’s hard to believe that Swift was around the age of most South students when she released her first album, “Taylor Swift,” in 2006."}, {"text": "Six years later, she composed a symphony of love, heartbreak, and revival in her album “Red.” Nearly a decade later, “Red (Taylor’s Version),” which is a re-recording of “Red,” was launched to prove to the world that all artists deserve the right to own their music."}, {"text": "According to an article in USA TODAY, “Taylor Swift Speaks Out,” by Charles Trepany, Swift had a contract with Big Machine Records, but when she decided to move on to a different label they sold all of her music to the owner of Ithaca Records, Scooter Braun. Braun is now accumulating all of the money from Swift’s music."}, {"text": "Swift re-recorded and coined “(Taylor’s Version)” to earn the credit she believes she deserves. “When something has ‘(Taylor’s Version)’ written next to it, that means I own it,” said Swift in her interview on “Late Night with Seth Meyers.”"}, {"text": "Some of our favorite songs on the album include “I Bet You Think About Me,” “22,” “Everything Has Changed,” and “All Too Well.” A romantic duet that captivates our attention is “Everything Has Changed.” It not only features Swift but also her best friend, Ed Sheeran."}, {"text": "This guitar ballad includes a folk-pop twist and captures the feeling of young love and finding one’s other half. Swift and Sheeran convey that all it takes is just one special person to light up one’s world and make them feel loved."}, {"text": "In contrast to the original version, we can identify transformations in Swift and Sheeran’s voices as well as their musical evolution as pop musicians."}, {"text": "Along with variations to songs on the original album, tracks from “Red” that were originally hidden from the public eye were locked and secured in Taylor Swift’s Vault, a reference to her previously unreleased songs."}, {"text": "“I Bet You Think About Me,” a melody that was once sealed in her Vault, left us awestruck because of its vengeful lyrics and jaw-dropping music video. “Gossip Girl” star, Blake Lively, directed this sensational project which marked her directorial debut."}, {"text": "When we analyzed Swift’s music video we thought the reason she unleashed her alter ego was so she could revisit her relationship with her former lover."}, {"text": "In her video, Swift attempts to disrupt his wedding which we believe was a way to heal from the trauma of the relationship."}, {"text": "Another theory is that Swift left an Easter egg in “I Bet You Think About Me” for her titular number, “Speak Now” because “Speak Now” also highlights Swift’s daring decision to ruin her former flame’s wedding."}, {"text": "Sophomore Eliza Azaro, a die-hard Swift fan, can’t stop playing “22” on repeat because of its uplifting message compared to Swift’s breakup anthem, “I Bet You Think About Me.” “I feel like ‘22’ is very focused on being with friends and having fun, whereas ‘I Bet You Think About Me’ is focused on this feeling of isolation with another person where you are so different you don’t work together.”"}, {"text": "Physical Education and Health teacher David Colon agreed: “I definitely like ‘22’ better because it is a more well known song and has a catchy tune.”"}, {"text": "“22” is truly a lively hit for its uplifting theme about embracing good vibes and sticking with those who matter most."}, {"text": "“My favorite song is ‘All Too Well’ because it’s ten minutes long so I don’t have to keep switching the song,” said freshman Mia Mankavil."}, {"text": "We enjoyed “All Too Well (Ten Minute Version)” because of its length which allowed Swift to fully express her feelings. The inspiration behind the song was from her past relationship with American actor who was in the Marvel Avengers fan-favorite, “Spiderman: Far from Home.”"}, {"text": "Following in the footsteps of the artist, Formerly Known as Prince, Taylor Swift also ingeniously re-recorded her albums to reclaim her autonomy as an artist, according to Melinda Newman in her article, “Inside Prince’s Career-Long Battle to Master His Artistic Destiny.”"}, {"text": "The launch of Swift’s album is just the beginning of her mission to own her music. On her Instagram post that was published last November, Swift said, “Red is about to be mine again, but it has always been ours. Red (my version) is out.”"}, {"text": "Images by DOMINIQUE HOOKS AND VIVIAN XIE"}], "file_structural_elements": {"title": "Green light on “Red (Taylor’s Version)”", "date": "January 18, 2022", "writer": {"Gxd1r1z0AAbCXQdmEWSS": {"name": "Kalyani Samudrla", "year": "2021"}, "TtzLeEsqVllY4uMU8Zl6": {"name": "Manika Niwas", "year": "2022"}, "ZSFFpdQWjszDdCIoro8x": {"name": "Sana Manchanda", "year": "2021"}}, "description": "“3 a.m. and I’m still awake,” sings Miss Americana, Taylor Swift, in the opening line of “I Bet You Think about Me.” South fans were “still awake” as midnight approached on last Nov. 12, in anticipation of the arrival of her long-awaited album “Red (Taylor’s Version).” Not only were we looking forwa", "image": "https://thepirateseye.org/wp-content/uploads/2022/01/Screenshot-2022-01-20-10.12.16-AM.png"}}