{"tree_elements": [{"text": "On the day the second draft of this article was due, I remember constantly switching internet tabs to try to find a way out of revising this article. I kept convincing myself that I would get it done sooner or later; that I could wait a bit more before coming up with a hook or making necessary revisions. I told myself I could watch one more video, or browse through my social media feed one more time, and procrastinating would not be as horrible as I had made it out to be."}, {"text": "Simply put, I told myself the exact opposite of what I am about to tell you right now."}, {"text": "Procrastination is a direct result of your desire to feel good in the short term, in spite of all of the harm and guilt it gives you in the long term. After all, we tend to opt for instant gratification rather than a reward in the near or distant future."}, {"text": "So what happens next, after we procrastinate? We rationalize our own procrastination, providing ourselves with downward counterfactuals — ideas and thoughts meant to rationalize our behavior. We still feel guilt for procrastinating, yes, but we rob ourselves of the chance to learn from our mistakes."}, {"text": "This sort of thing happens to the best of us. Take, for instance, junior Ishaan Ivaturi.  “I end up procrastinating despite my best efforts because I really get distracted when I’m trying to work,” he told me. “My mind wants that instant gratification of playing a game, of doing something fun, and I just keep putting off the work, telling myself that… I have more time. ‘I have all night if I need it.’ And then it gets late at night and I’m still playing video games, and I’m just like, ‘you know what, how much is this assignment worth? I’ll just turn it in late.’”"}, {"text": "The problem with this rationalization of our procrastination is that it encourages us to continue procrastinating. After all, it wasn’t that bad — or so we tell ourselves. This attitude extends to nearly everyone, from Leonardo Da Vinci, who reportedly took over four years to complete the Mona Lisa, to your favorite teacher, to me."}, {"text": "So how do we break this self-destructive loop and stop procrastinating? Well, one of the ways you can do so is through a chain of events; here, each step is meant to target your weaknesses to force you to stay on task. As freshman Aaravsinh Solanki states, “You need to make a schedule and follow that schedule no matter what.”"}, {"text": "We can begin by choosing only one task to focus on: look at what you have to do for the day, and choose the most important task. This helps you to focus, and you will make progress in your daunting to-do list by doing things one-by one."}, {"text": "Now, we move on to optimizing our workspace in order to avoid distractions. This can mean clearing your desk, and, if you are working on a laptop, closing tabs that are unrelated to your work."}, {"text": "Essentially, you want to set up your work environment so that watching YouTube videos, or playing video games, or whatever you need to stop doing, feels too difficult to be worth doing, and too untimely for your current situation. On the other hand, doing the one thing that you need to do will be the most convenient and least out-of-reach. This could be studying for tomorrow’s test, practicing a presentation, or writing an article on how to stop procrastinating."}, {"text": ""}, {"text": "You also need to make sure that any distractions and “procrastination tools” are out of reach, and will take at least twenty seconds to get to. A good rule of thumb would be the twenty second rule, as detailed in the book The Happiness Advantage by Shawn Achor. Removing distractions helps to keep you focused on the one task that you need to get done, and lessens the motivation you have to procrastinate in the first place."}, {"text": "Now you have optimized your workspace. We have chosen one, singular task to focus on. The problem is, our project isn’t just one, singular to-do that we can just check off. It is a huge monstrosity that you don’t even know how, or where, to start. It could be an essay, but it could also be the poster we need to design, or the test we have to study for. What now?"}, {"text": "Simply taking the first step — even if it is the smallest possible action you could take — is a big way you can motivate yourself to keep going. A great way to make our project far more tangible and achievable is by breaking your task into smaller sub-tasks. For example, break the essay due next Wednesday into a researching phase, a writing phase and an editing phase. Then, give each of the sub-tasks specific deadlines."}, {"text": "I want to stress one more thing to those of you who have managed to get this far: there will never be a perfect time to study. Maybe you are caught in a position where there no is no way to get rid of a distraction, or you are otherwise waiting for a better time to study. The moment is imperfect, yes, but passable. Passable enough, at least, to do the work that you need to get done right now."}, {"text": ""}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Guide to studying effectively: overcoming procrastination", "date": "January 25, 2019", "writer": {"": {"name": "Andrew Xu", "year": ""}}, "description": "     On the day the second draft of this article was due, I remember constantly switching internet tabs to try to find a way out of revising this article. I kept convincing myself that I would get it done sooner or later; that I could wait a bit more before coming up with a hook or making necessary ", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/books.jpg"}}