{"tree_elements": [{"text": "The Indian holiday of Diwali or Deepawali, commonly known as the festival of lights, celebrates the triumph of good over evil and is the biggest and most important holiday in South Asian communities worldwide. This year, the holiday falls on Saturday, Nov. 14."}, {"text": "Various stories are associated with the holiday, depending on which region of India you’re from. In the North, the holiday celebrates King Rama’s triumph over the ten-headed demon Ravana in what is today known as Sri Lanka. Diya’s, or clay oil lamps, are lit to light Rama and his wife Sita’s return home to his kingdom in Ayodhya. In the South, the day celebrates Lord Krishna’s defeat of the demon Narakasura. In western India, the day marks Lord Vishnu’s vanquishment of the demon Bali to the underworld."}, {"text": "As you can see, the common theme is the triumph of good over evil. Diwali is a time of hope, warmth and family. The Pirate’s Eye Staff shares some of our favorite Diwali traditions."}, {"text": ""}, {"text": "On the day before Deepavali, my Mom and I clean the entire house together while my Dad and brother hang up lights outside and inside the house. I also help my mom make a bunch of sweets and food to present to God. On the day of Deepavali, my Mom wakes up early in the morning to make rangoli and wash all of the mandir items.\nDiwali is my favorite Indian holiday because it is filled with so much color and is a day to celebrate and spend more time with family and friends. We also call all of our relatives and wish them good health, prosperity, and peace. On this day I feel more connected to my culture and it puts a smile on my face.\nUsually during Deepavali my family invites many family friends to celebrate. Obviously, due to the coronavirus pandemic, many things have changed. But a few of my family friends and I will get together and light firecrackers in our neighborhood to celebrate the festival of lights."}, {"text": "The day before Diwali, my mom spends hours making a variety of sweets and foods. For as long as I can remember, ever since I was a little kid, as my mom would place one sweet after another on a dish, I would pick one up and stuff it in my mouth, hoping she wouldn’t notice. While I was busy eating up sweets made for guests, my dad and sister would put up colorful fairy lights all around the house, lighting up the whole place.\nA couple of hours before our guests arrived, we’d make designs made of a white paste called rangoli around the house. We would place two diyas on either side of every door in the house. All the candles around the house make me feel safe and warm.  Diwali brings me closer to my family. \n     Due to the coronavirus pandemic, Diwali won’t be the same. On this special day, we usually welcome many guests as a way to show our appreciation and love, but this year, we are only able to invite a couple of people over. This day is a day for positivity, so it is important to cherish and be thankful for the people we are able to spend time with."}, {"text": "My cousin sister and I usually spend the day of Diwali decorating our house. We don’t have much artistic vision, but we end up finding quirky hacks that help us through the way! It’s a pain every year keeping our brothers from messing up our rangoli."}, {"text": "Every summer, my grandparents come from India to visit our family. So during the Diwali festivities, my siblings and I gather around and our grandparents tell us about some funny things we or our parents did as children. Sometimes, they even talk about how they used to celebrate Diwali back when there no computers and cell phones."}, {"text": "Because of the pandemic, my grandparents couldn’t visit this summer.  Although I’ll miss my grandmother’s comments about how we should not be on our phones on such an auspicious day, I’m glad we will still be able to hear and relive some of those stories virtually!"}, {"text": "Diwali is special to me because it’s a time of the year when my family comes together to laugh, eat delicious food, put up lights around the house and have fun! My brother and I like to bake a chocolate cake during Diwali and light it up with candles. This year, we’re planning on celebrating by making little decorations that symbolize our culture."}, {"text": "Diwali will definitely be a little bit different this year because we cannot invite other family over. However, we are still going to FaceTime with them and share stories. Technology makes communication during this special day possible and we’re grateful for that."}, {"text": "Diwali for me and my family means spending a lot of time with each other while eating great food that my mom makes. We light a lot of diyas around the house to brighten up the place. It is the ‘Festival of Lights’ after all. We usually meet friends and family and give our wishes and gifts to each other. It is one of the best times during the year."}, {"text": "The pandemic will bring challenges to how we celebrate the festival. We won’t be able to celebrate it with my grandma or meet up with friends and family to exchange wishes. But, technology comes to the rescue. My parents will probably video chat with relatives. It will be a long but  happy day with a lot of video chatting, and I’m grateful for that."}, {"text": "My family and I enjoy making food together and I usually like to take charge of making sweets. I also like to decorate my house with lights, both indoors and outside, to create a festive environment."}, {"text": "One of my favorite Diwali traditions has always been distributing sweets to my neighbors and family, which unfortunately won’t be possible this year. However, I am looking forward to having a virtual get-together with some of my relatives!"}, {"text": "One of my family’s most cherished traditions during Diwali is making holiday foods together. I will always associate the warmth of a cozy kitchen with Diwali and I’ll never forget all my favorite savory snacks and mithais that we’ve made over the years (just like the besan burfi recipe below)!"}, {"text": "During the coronavirus pandemic, my family hasn’t been able to invite my cousins from out of state or family friends for an informal celebration, but even the pandemic hasn’t stopped my dad from hanging up lights everywhere!"}, {"text": "INGREDIENTS"}, {"text": "INSTRUCTIONS"}, {"text": "Recipe by Vivek Jadon."}, {"text": "During Diwali, my family and I enjoy going to the temple and wearing festive Indian clothes. We put candles and Christmas lights around the house and call relatives and wish them a happy Diwali."}, {"text": "Unfortunately this year we can’t go out, but we are still decorating our house with lights. My mom is planning on making some of my favorite sweets and dishes to keep our moods up during the pandemic."}, {"text": ""}, {"text": "Image by Ishita Jadon."}], "file_structural_elements": {"title": "Happy Diwali from The Pirate’s Eye Staff!", "date": "November 13, 2020", "writer": null, "description": "    The Indian holiday of Diwali or Deepawali, commonly known as the festival of lights, celebrates the triumph of good over evil and is the biggest and most important holiday in South Asian communities worldwide. This year, the holiday falls on Saturday, Nov. 14. \n     Various stories are associate", "image": "https://thepirateseye.org/wp-content/uploads/2020/11/Diwali-final-final-black-900x666.jpg"}}