{"tree_elements": [{"text": "Harvard University is being sued by Students for Fair Admissions, a nonprofit group that believes racial classifications in college admissions are unfair and claims that the admission process discriminates against Asian-Americans."}, {"text": "The Students for Fair Admissions mission statement is to “support and participate in litigation that will restore the original principles of our nation’s civil rights movement: A student’s race and ethnicity should not be factors that either harm or help that student to gain admission to a competitive university.” The organization was founded by Edward Blum, a conservative activist who is against race-based laws."}, {"text": "As many South students are applying to the university, the question has to be asked: Has Harvard’s admissions policy disadvantaged Asian students who have applied from South?"}, {"text": "The lawsuit accuses Harvard of discriminating against Asian-Americans by giving them a personal rating based on what they see in their application. According to the New York Times, Harvard consistently rates Asian American applicants lower on traits such as likability, kindness, courage etc. The prosecutors argue that this allows the university to hold Asian-Americans to a higher standard without it seeming like bias. Furthermore, this personal rating is one of the biggest factors that Harvard considers during admissions decisions."}, {"text": "Senior Ayesha Gupta said, “While Harvard is trying to create a diverse campus, they shouldn’t automatically consider traits such as personality lower for Asian Americans.”"}, {"text": "Title VI of the 1964 Civil Rights Act bars discrimination at private institutions that receive federal funds and this is what the prosecuting group is resting its case on."}, {"text": "The judge presiding over this case is Judge Allison D. Burroughs, who was nominated by President Barack Obama and confirmed to the federal bench in 2014."}, {"text": "While this lawsuit has been in the making since 2014, Harvard has been using racial quotas for a long time. In fact, the Education Department looked into this same matter in 1988 but cleared Harvard."}, {"text": "Looking even further back, during the 1920’s, Harvard tried to restrict the number of Jewish students admitted to Harvard. The president of the university at the time said, “We must take as many as we can benefit, but if we take more, we shall not benefit them and shall ruin the college.” Using quotas is nothing new for Harvard."}, {"text": "The plaintiffs in the lawsuit have been using this history of quotas in their argument but Judge Burroughs has expressed scepticism over whether it is entirely relevant to the matter at hand; however, she has allowed limited testimony on the matter."}, {"text": "According to CNN, Harvard Dean of Admissions, William Fitzsimmons, revealed under oath that he sends out recruitment letters to high school students and will only send out those letters to Asian Americans if they have an SAT score 200 points higher than Black and Hispanic students."}, {"text": "Harvard argued that they do not discriminate but seek to have a diverse class."}, {"text": "While affirmative action is not under debate in this lawsuit, the case has prompted a series of questions all over America over the use of race-based admissions."}, {"text": "Affirmative action has been in effect since the landmark Supreme Court case of 1978 – Regents of the University of California v. Bakke. The Supreme Court ruled that universities were not allowed to set race-based quotas but could use affirmative action to increase the number of minority students at their school. Affirmative action is a government based action to reduce discrimination and increase diversity which encourages having goals. Race based quotas are specific numbers that universities must hit which separates applicants into their ethnic group."}, {"text": "The Trump Administration is siding with the Students for Fair Action. The Justice Department confirms that Harvard has failed to prove that they preserve Asian-Americans interests."}, {"text": "To understand how affirmative action became something to be considered during the college admissions process, we must understand what was happening during President Kennedy’s time. He first implemented this law as a way to address the persistent discrimination that had occurred even after the long history of the Civil Rights Movement. However, they were not enforced strictly during his time and so the laws were really only to show that progress was occurring even if in practice it wasn’t."}, {"text": "But President Lyndon B. Johnson enforced affirmative action. He said, “We seek… not just equality as a right and a theory, but equality as a fact and as a result.”"}, {"text": "This was a push for equal rights. In the years that followed certain minority groups were found to receive a “boost” in the admissions process. This enraged many conservatives in the early 1970’s because they believed in working for their goals and not receiving any help. But is this possible when minority groups face so much unseen discrimination?"}, {"text": "Senior Anne-Charlotte Frotte said, “I believe affirmative action should not be used because it was created to make sure that all people were treated the same regardless of race or gender; however, that is not what is being done currently.”\n     Harvard’s affirmative action policy was first used to boost minority groups up such as African-Americans and Hispanics but many claim that it is now pulling another minority group down."}, {"text": "Whichever side you favor, this case can and will affect university decisions for a long time. The Supreme Court could either hand down a decision only affecting Harvard or give out a decision affecting all universities, which could eliminate affirmative action all over America."}, {"text": "The results of this case will affect students for years to come as we get a closer look at Harvard’s admission process."}, {"text": ""}], "file_structural_elements": {"title": "Harvard lawsuit on alleged anti-Asian American admissions", "date": "November 14, 2018", "writer": {"BEBL4ArsEm9smMlIITfG": {"name": "Namitha Sethuraman", "year": "2018"}}, "description": "     Harvard University is being sued by Students for Fair Admissions, a nonprofit group that believes racial classifications in college admissions are unfair and claims that the admission process discriminates against Asian-Americans.\n     The Students for Fair Admissions mission statement is to “s", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/harvard-654x900.jpg"}}