{"tree_elements": [{"text": ""}, {"text": "Sophia Kravets (sophomore)"}, {"text": "“We celebrate Christmas by putting up a tree and exchanging gifts. We actually celebrate it on New Year’s: that’s when the Eastern Orthodox Church does it, so that’s when my family celebrates it. Sometimes we’ll travel but we haven’t in the past couple years because of COVID-19. Now I get a lot more quality time with my family and we actually decorate the house and do stuff together. I love watching holiday movies as a family or with my friends. My favorites are ‘Home Alone’ and ‘Elf,’ they’re classics. My mom and I always make a ton of Christmas cookies every year and we give them out to all of our friends and family.”"}, {"text": ""}, {"text": "Orthodox Christmas is usually celebrated on Jan. 7 because Orthodox Christians use the Julian calendar, rather than the Gregorian calendar used by the majority of Christians, according to National Geographic. Both Orthodox and nonOrthodox Christians celebrate Christmas to remember the birth of Jesus Christ as stated by timeanddate.com. Orthodox Christians visit a church and pray or reflect before Christmas Day."}, {"text": ""}, {"text": "Connor Katz (freshman)"}, {"text": "“I celebrate Christmas and Hanukkah. I go to Georgia every year to visit my relatives. For Hanukkah we eat babka. It’s eight days and it’s similar to Christmas because you receive gifts, but you don’t get very big gifts every day. Also, you say a prayer and light a menorah. My family sees a light show every year and they play Christmas games, like everybody gets a present for somebody else. Then you just get to keep one and then you just keep going around, like a cakewalk. My favorite gift is a speaker that I got last year.”"}, {"text": ""}, {"text": "This year, Hanukkah began on Nov. 28 and ended on Dec. 6, according to USA Today. A menorah has nine candles, one for each night, to celebrate and  honor reclaiming the Second Temple. As stated by chabad.org, Hanukkah is known as the “festival of lights” and is celebrated by having a nightly menorah lighting, prayers and fried food. According to tasteofhome.com, latkes, which are fried potatoes, are a traditional Hanukkah food, and babka is a dessert made with sweet dough and chocolate."}, {"text": ""}, {"text": ""}, {"text": "Juanita Florez (senior)"}, {"text": "“I’m from Colombia, so we have a holiday there where people put candles outside to say thank you to God. That happens on Dec. 7th. I would say that’s my preferred holiday. Even though we don’t celebrate it here, it’s something that I grew up with. Maybe it’s a Colombian thing, but we focus mostly on snacks and sweets during Christmas. Nine days before Christmas we all come together to pray every night because we’re expecting the birth of Jesus. That’s what they do in Colombia and all of my family does it. This takes place on the 16th of December because Christmas for us is on the 24th, not the 25th because Jesus was born on the 24th.”"}, {"text": ""}, {"text": "Novenas is a Colombian holiday celebrated nine days before Christmas, as stated by Uncover Colombia. La Noche de las Velitas, meaning “Night of the Candles,” is celebrated on Dec. 7th."}, {"text": ""}, {"text": "Harshita Ramesh (freshman)"}, {"text": "“I celebrate Christmas but not religiously. I normally do something with my friends like Secret Santa and give and receive presents from my family. We used to make cookies for Santa so he wouldn’t get hungry at night. I love spending time with my family and friends over the holidays and just enjoying the break we get.”"}, {"text": ""}, {"text": "Christians and nonChristians alike recognize Dec. 25 as a holiday. Christmas is a time for celebration, thanks, reflection and presents for everyone"}], "file_structural_elements": {"title": "Holiday Traditions", "date": "December 22, 2021", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}, "ZSFFpdQWjszDdCIoro8x": {"name": "Sana Manchanda", "year": "2021"}}, "description": "\nSophia Kravets (sophomore)\n“We celebrate Christmas by putting up a tree and exchanging gifts. We actually celebrate it on New Year’s: that’s when the Eastern Orthodox Church does it, so that’s when my family celebrates it. Sometimes we’ll travel but we haven’t in the past couple years because of CO", "image": "https://thepirateseye.org/wp-content/uploads/2021/12/image3.jpg"}}