{"tree_elements": [{"text": "Pirate pride, bright ideas, and hot competition are what Homecoming week is all about."}, {"text": "Spirit week kicks off Homecoming as the first level of competition between classes every year in the fall season. Students dress up in fun, spirited garb according to different daily themes. But the real creativity of each class comes through during Hoco Deco, when each class goes all out to have the best homecoming decorations festoon and cover the commons and hallways."}, {"text": "Each year, there is a different assigned theme.  This year’s theme was modified from Romantic Getaway to Destination Getaway. Ronak Ramachandran, president of the class of 2019, explained, “There’s been some confusion with the Administration because first, they said they approved Romantic Getaways as the theme this June, but then they said it was meant to be Destination Getaways.”"}, {"text": "Decorations also had to be done in correspondence to the different assigned colors given to each class. Every year the colors are the same: white for freshmen, yellow for sophomores, green for juniors, and black for seniors. This year, the theme also included sub-categories for each grade based on their color. The assigned colors are the school colors, just to amp up the school pride even more."}, {"text": "Yet why is this tradition important to South culture? Why should all students participate? Jessica Turner, the class advisor of 2022, said, “Well… school spirit! Even though each grade is different based on color, it unifies us all as Pirates.”"}, {"text": "So what did the classes do this year? Each grade was asked about their ideas. The freshmen did the subcategory of ‘Winter Wonderland,’ and chose to put lots of snowflakes around the commons."}, {"text": "Sophomore, Vanni Bhatnagar, who was on the decoration committee, explained what their ideas were.  “Our color probably gives us a little advantage because we got destination getaways to the beach, which does have a lot of yellow in it.”"}, {"text": "The juniors, however, had lots of confidence that they are the best. When asked who is going to win, Kaylin Ku said, “Obviously the juniors, we’re the best.” Ku is the historian for the class of 2020. She also said, “We want our space to look like a tropical rainforest that you’d want to travel to, so not just on a romantic getaway, but somewhere you’d go to for a getaway in general.”"}, {"text": "The juniors also believed that their color gave them an advantage over others. “Since green is one of our school’s main colors, I think a lot of people already own green clothes, so we can have a lot of participation in the class color day,” Ku said."}, {"text": "The seniors believed they had a great subcategory. Ramachandran said, “This year, with the senior color of black, we were naturally given the subcategory of ‘nighttime.’ I think this does give our class a small advantage, but I know the other classes are full of artists and builders just as talented as ours. I believe it’s a fair contest, and we seniors look forward to winning it.”"}, {"text": "Ramachandran also said, “Within each of our locker sections, we’re planning to show off various cities like Paris, New York, Kyoto, and Dubai. Hopefully, as people walk down our hallway, they’ll feel transported around the world. We also have a number of photo opportunities planned, like a drive-in theatre and a gondola from Venice.”"}, {"text": "All the classes had great ideas and creativity, but there can only be one winner. During the annual pep rally on Oct. 19, the results were announced. The seniors came in first place, the juniors in second, the sophomores at third and the freshmen were last."}, {"text": "The important part of Spirit Week and Hoco Deco is that it brings the school together for a friendly competition among grades. Pirate pride unites the school and makes South stronger."}], "file_structural_elements": {"title": "Homecoming decorations brings pirates together", "date": "November 14, 2018", "writer": {"2BVxRm99ZAeduOEgV6U9": {"name": "Adya Dutt", "year": "2018"}}, "description": "     Pirate pride, bright ideas, and hot competition are what Homecoming week is all about.\n     Spirit week kicks off Homecoming as the first level of competition between classes every year in the fall season. Students dress up in fun, spirited garb according to different daily themes. But the real", "image": null}}