{"tree_elements": [{"text": "Before winter recess, I interviewed South’s new staff about their holiday traditions and what they do to celebrate the most magical time of the year."}, {"text": ""}, {"text": ""}, {"text": "Mr. Sean Feddema"}, {"text": "Subject: American Studies"}, {"text": "“Definitely Christmas. I like being with family and everything. The commercialism of it doesn’t interest me. I like the togetherness of being with family and friends.”"}, {"text": ""}, {"text": "Mr. Dan Kim"}, {"text": "Subject: American History"}, {"text": "“We celebrate with family, food, and Christmas movies. There are three movies we watch no matter what: Home Alone, Home Alone 2, and Elf.”"}, {"text": ""}, {"text": "Mr. Bryan Manolakos"}, {"text": "Subject: Mathematics"}, {"text": "“I love Christmas carols. I love when radio stations transition into Christmas carols. I just love having that music on in the background, whether they are Rudolph-type carols or traditional religious carols.”"}, {"text": ""}, {"text": "Mr. Lucas Beesley"}, {"text": "Subject: Gym"}, {"text": "“When we were kids, my brothers and I would try to open a present on Christmas Eve and my dad would get mad at me. That’s our tradition!”"}, {"text": ""}, {"text": "Mr. Dave Miller returned to South after dividing his time between South and North"}, {"text": "Subject: Computer Science"}, {"text": "“Filet mignon, that really expensive and tasty beef. We love to eat that for Christmas dinner.”"}, {"text": ""}, {"text": "Ms. Hui Ma"}, {"text": "Subject: Spanish"}, {"text": "“There will be a lavish dinner at the end of the old year according to Chinese traditional calendar, and it’s a family reunion.”"}, {"text": ""}, {"text": "Ms. Andrea Kempler"}, {"text": "Subject: Child Development"}, {"text": "“My family is interfaith. I am Protestant, and my husband is Jewish, so we celebrate everything. We call it ‘Christmikkah’–we combine Christmas and Hanukkah.”"}, {"text": ""}, {"text": "Ms. Jume Shen, who has returned to South from GMS and Maurice Hawk"}, {"text": "Subject: Chinese"}, {"text": "“As a family, we always prepare for Christmas by purchasing presents for my kids and family, so it’s fun to shop. You have something in your mind and get it wrapped and put it under the tree, and they don’t know it. It’s a little surprise.”"}, {"text": ""}, {"text": "Ms. Samirah Akhlaq"}, {"text": "Subject: Art"}, {"text": "“My family belongs to different cultures, so when we come together to celebrate we bring the most famous dish from each culture.”"}], "file_structural_elements": {"title": "How new teachers spent the holidays", "date": "January 27, 2022", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "Before winter recess, I interviewed South’s new staff about their holiday traditions and what they do to celebrate the most magical time of the year.\n \n\nMr. Sean Feddema\nSubject: American Studies\n“Definitely Christmas. I like being with family and everything. The commercialism of it doesn’t interest", "image": null}}