{"tree_elements": [{"text": "“Overall my college application experience definitely could have been better,” said senior Heather Butler. With the outbreak of the coronavirus pandemic, South’s seniors have had to quarantine during one of the most important times of their high school careers: completing college applications."}, {"text": "During this unprecedented time, seniors have faced many struggles throughout their college application process. Standardized tests, extracurriculars, and college essays, all essential parts of a college application, were switched to virtual meetings or entirely canceled. This made the college application process even more difficult for South’s seniors."}, {"text": "A lot of colleges ask students to send in their Scholastic Aptitude Test (SAT) or American College Testing (ACT) scores. Butler had trouble scheduling her SAT."}, {"text": "“I first planned on taking it in March of 2020, but it got canceled,” Butler said.  “I continued to sign up for tests but they all got canceled. I signed up for the following tests: March, May, June, August, September and October. Now, I am scheduled to take the November and December test.”"}, {"text": "Although there were many cases like Butlers, other seniors from South were able to take theirs without much trouble."}, {"text": "Senior Andrew Ji was able to take his ACT before the pandemic. He said, in retrospect, “I’m very glad to have gotten it out of the way beforehand. Some people I know have had to drive an hour into Pennsylvania to take the test.”"}, {"text": "In addition to standardized test scores, many colleges also look at each student’s extracurriculars in order to learn more about them. During quarantine, however, many extracurriculars were canceled or moved to a virtual format."}, {"text": "Senior Alex Qin said, My fencing tournaments were canceled, including summer nationals. My financial class with Wall Street was also forced into the virtual format with Zoom. Other seniors had similar experiences."}, {"text": "Butler said, “Due to quarantine, I am unable to play school field hockey and participate physically in clubs. In terms of my clubs, all of them are still on, however, they are done completely on Zoom/online.”"}, {"text": "Along with extracurriculars and standardized tests, colleges will also look at college essays. College essays greatly contribute to a college’s decision if they should accept a student or not."}, {"text": "During college application season, seniors will write their college essays. Having to pick from a selection of essay prompts and follow a certain word count, students must combine creativity, individuality, and focus in crafting an effective college essay. But with quarantine going on, it is difficult to determine if writing college essays have become more difficult, easier or stayed the same."}, {"text": "“I would pick more difficult, since extracurriculars that would have shaped parts of your essay are now much harder to immerse yourself in and identify with,” said Ji. “Even though quarantine means that we have more time to work on them, time spent doesn’t equate to quality of writing – I find that to write effectively, I need to get ‘in the zone’, which is more difficult with constant zoom meetings and online distractions.”"}, {"text": "Other seniors had a different view."}, {"text": "“Quarantine didn’t really affect my essays,” said Qin. “Most of my essay topics were about events or ideas I had developed over the years. So actually the impact is quite minimal on essays as far as college goes.”"}, {"text": "Despite the difficulties the coronavirus pandemic has presented, the South seniors continue to stay positive. Butler said, “Even though there are many challenges that I’ve had to face during my college applications, I’m optimistic about the future and I look forward to the rest of my senior year.”"}, {"text": "Image by Edward Kim"}], "file_structural_elements": {"title": "How is the coronavirus pandemic affecting college applications?", "date": "December 7, 2020", "writer": {"QRo3uk5mtYwXdbxUvUF1": {"name": "Edward Kim", "year": "2021"}}, "description": "     “Overall my college application experience definitely could have been better,” said senior Heather Butler. With the outbreak of the coronavirus pandemic, South’s seniors have had to quarantine during one of the most important times of their high school careers: completing college applications. ", "image": "https://thepirateseye.org/wp-content/uploads/2020/12/Screen_Shot_2020-11-19_at_6.54.32_PM-900x555.png"}}