{"tree_elements": [{"text": "Moments before the show, performers were jittery with anticipation for the big moment. I, too, was uneasy, as I watched more and more people file into the theater. I tapped my fingers on my knees, reciting the Chopin piano piece in my head. I anxiously flipped through my music book, making sure that I remembered all the notes. Then, suddenly, the theater became silent, as the spotlights gradually lit the stage."}, {"text": "Illuminations is an annual talent show that has long been part of South tradition. This year, it was presented on Feb. 28, with performances by a teacher, freshmen, sophomores and juniors."}, {"text": "“This is a project that our administrators have given to the junior classes,” said Christopher Trefz. He and Danielle Buggé are faculty advisors for the class of 2021."}, {"text": "The juniors ran the stage crew. In return for their work organizing and running the show, their class received all the money raised."}, {"text": "“The junior class officers actually ran it. We were there to help advise them,” Mr. Trefz said."}, {"text": "“Not only does the event serve as an important fundraiser for the junior class,” Vinayak Nair wrote in an email, “but it is also a longstanding tradition that has allowed kids to express themselves through their passions and entertain our local community.” He is a junior student council member and MC of the show."}, {"text": "Earlier in the week, as we rehearsed our acts onstage, I could see everyone’s enthusiasm, whether they were singing, playing the guitar or the piano. Each person had a desire to perform, and the talent show allowed us to share our skills with our peers."}, {"text": "I was excited to take part in this school tradition as a freshman. For my act, I played the piano piece “Aeolian Harp” by Polish composer Frédéric Chopin because it was the right length at three minutes and had a beautiful melody. Although I have been in other piano performances, I was excited to play for a school audience."}, {"text": "One student performer, junior Jackson Lemmond, played a Spanish guitar song dedicated to his class."}, {"text": "“To have your friends come in and cheer you on is what makes Illuminations special to me,” Lemmond said."}, {"text": "Nair sang a parody of a song sung by a merchant in Disney’s Aladdin that was re-written specially for Illuminations."}, {"text": "Jyotika “Jo” Aggarwal, a freshman, sang “Skyscraper” by Demi Lovato."}, {"text": "“Stagefright is real,” she wrote in an email.  This is especially true, she added, “when the performance is something as raw and exposed as singing for a crowd of mostly strangers.” But she was not the only person who was nervous that night."}, {"text": "Lemmond said, “I was very nervous before my performance but once I started playing and getting into the groove of the song, especially since my friends were there, I started having fun.”"}, {"text": "Unlike the stifling silence of other competitions, the Illuminations audience was clapping and laughing along during the acts, easing the performers’ pressure."}, {"text": "But I was still anxious."}, {"text": "Afterwards, the judges asked the performers questions and a winner was picked at the end. For my performance, they asked what I would aspire for my piano playing to become in the future."}, {"text": "We all waited in anticipation as the judges made their decision."}, {"text": "To my surprise, I was chosen as the winner of the talent show. I had planned on writing this article as a participant in Illuminations. I never expected to be voted the winner of the talent show."}, {"text": "Illuminations is not simply about performing an act and getting votes; it is an opportunity to showcase one’s passion."}, {"text": ""}], "file_structural_elements": {"title": "Illuminations: Shining Light on South’s Talents", "date": "May 18, 2020", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     Moments before the show, performers were jittery with anticipation for the big moment. I, too, was uneasy, as I watched more and more people file into the theater. I tapped my fingers on my knees, reciting the Chopin piano piece in my head. I anxiously flipped through my music book, making sure", "image": "https://thepirateseye.org/wp-content/uploads/2020/05/Screenshot-43.png"}}