{"tree_elements": [{"text": "The IOS 12 update was released by Apple on Sept. 17 and was one of the most effective software updates for iPhones."}, {"text": "IOS 12 is now installed on more than 50% of active Apple devices,  according to Mixpanel, a product analysis company. With the new update, your old iPhone five or six will have the same attributes as the new iPhone X."}, {"text": "IOS 12 contains new features such as Screen Time, the measuring app and the long awaited group facetime. Some bug fixes such as the redesign Photos and messages layout to improve the previous updates layout."}, {"text": "One of the main features that has people talking  is Screen Time. This is an app that allows users to look at how long they have been on a specific platform and their phone in general."}, {"text": "Teenagers believe it to be unhelpful and a collector of their personal data. Parents like it, too.  They find it useful for watching what their children do on their devices and check that they are not spending exorbitant amounts of time on social media."}, {"text": "Some teenage iPhone users, on the other hand, have found screen time very helpful with knowing how long they’re on their phones every week. Freshman, Mary Nielsen said, “A lot of people spend way too much time on their phones and Screen Time is a good way to control that.”"}, {"text": "Another update added to the software is the long awaited group facetime.  This allows you to facetime up to 30 people at once. Even though group facetime came out in IOS 12.1, Apple had to make some fixes before releasing this update.  This feature is a great way to talk to all your friends without having to facetime separately."}, {"text": "However, the only way users can group facetime is if they make a group chat; adding people to the facetime is not possible. Plus, it is still not possible to facetime other devices such as Androids and Google phones."}, {"text": "The IOS 12 has changed the whole set up of Photos. Apple has added more categories and separated everything such as portrait mode pictures and burst pictures. Pictures are easier yet difficult to locate in Photos especially to users that are used to the old layout because of the different categories that was added."}, {"text": "As well as the new layout of Photos, IOS 12 has added the “For You” tab. According to Luke Filipowicz from imore.com, the “For You” tab will help you share photos or videos to family, friends and social media. The “For You” tab helps with sharing by putting the photos you want to  share into a huge folder so it can be easily transported to the person you want to share the photos with."}, {"text": "IOS 12 is a great update to get even though some of the new qualities aren’t that useful. But this update will show the future of this generation of iPhones."}, {"text": "Will you download this update?  I will."}], "file_structural_elements": {"title": "IOS 12: New updates, new iPhones", "date": "November 14, 2018", "writer": {"BpJiyaRd5yUVxEfXfKmO": {"name": "Jaidyn Hines", "year": "2018"}}, "description": "     The IOS 12 update was released by Apple on Sept. 17 and was one of the most effective software updates for iPhones.     \n     IOS 12 is now installed on more than 50% of active Apple devices,  according to Mixpanel, a product analysis company. With the new update, your old iPhone five or six wi", "image": null}}