{"tree_elements": [{"text": "Many people think that meat is delicious. It’s savory, tender and adds flavor to basic dishes such as pizza or salads. Dairy products, such as cheese and butter, add a nutty taste and creamy texture that makes almost anyone drool. So, it’s common for people to ask, “Why should one go on a diet as extreme and expensive as veganism?”"}, {"text": "The term “veganism” was coined in 1944 by Donald Watson, a British animal rights activist who founded the American Vegan Society. Veganism is a form of vegetarianism. In addition to a vegetarian diet, vegans do not eat animal products. Today, celebrities like Benedict Cumberbatch, Ariana Grande, Liam Hemsworth and Natalie Portman advocate for this type of diet. Although some people follow this diet due to health conditions, like food allergies to meat and dairy, the most common reason behind veganism’s popularity is taking a stance against animal abuse."}, {"text": "According to the 2020 U.S. Animal Kill Clock, a database that presents data about animal abuse, approximately 5 billion animals have been killed for food production this year. Many of these animals are stuffed into small cages, neglected and abused until they die."}, {"text": "Veal is an example of this type of mistreatment. According to an exposé by the animal rights organization Mercy for Animals explains how male calves are taken from their mother, so the animal farmers can obtain milk from the female cows."}, {"text": "The male calves are then rammed into tiny cages in a stable because they are not seen as profitable. This restricts the calves’ movement and impedes the development of their muscles, which is why veal is much more tender than normal beef."}, {"text": "After stumbling upon truths like this about how animals pay the cost for our pleasure, many people stopped eating meat. One example is French teacher Patrick Hartmann, who started out as a vegetarian and turned vegan 15 years ago."}, {"text": "“I went vegetarian after I was driving home with my family from Mississippi,” said Mr. Hartmann. “We were on the highway and I passed a truck full of baby pigs and I was just like ‘Where are they going? What are they doing?’ and I looked at the truck guy’s license plate and it said ‘eat meat’.” The bumper sticker said it all."}, {"text": "“I wanted to be more ethically sound and more responsible and I didn’t think being vegetarian was enough,” Mr.Hartman said. “The reason why I am an ethical vegan is because I’ve done my research: I have watched videos and I know how the animals are treated.”"}, {"text": "I, too, was shocked when I watched these exposés. I experimented with going vegan. This meant no cheese, butter, meat, milk or honey for a week."}, {"text": "As a person who has never lived without dairy products, I could not leave them out of my diet entirely. So I bought the Kite Hill almond milk cream cheese spread for $6.49 to put on my bagels."}, {"text": "I was not a big fan of it. The taste resembled cream cheese, but the texture was off-putting: it felt like rubber in my mouth and despite the interesting nutty flavor. I gave up on trying to find substitutes and instead focused on what I could eat a lot of: fruits and vegetables."}, {"text": "Usually, I snack on a lot of cookies and brownies, but during my week of going vegan, I cut down on snacking altogether ."}, {"text": "Due to this change, I felt fatigued at the start of the week. But as time progressed, I got used to my new healthier diet and my energy level got better."}, {"text": "A common misconception about the vegan diet is that vegans don’t get the same amount of nutrition as diets that include meat or dairy products."}, {"text": "“I mean if someone wants to [go vegan] they could,” said sophomore Jui Khatel. “But a diet should be balanced; it can’t just have plants. You aren’t getting all the nutrients and it’s just very inconvenient.”\nContrary to this common belief, a vegan diet can provide adequate nutrients. According to familydoctor.org, run by the American Academy of Family Physicians, this diet provides a surplus of protein, omega-3 fatty acids and vitamin B12–three nutrients that are commonly believed to not be provided by a vegan diet. Flaxseed meal and oil are two sources of omega-3 fatty acids. Whereas soymilk, some cereals, nuts and legumes contain protein and vitamin B12."}, {"text": "Furthermore, following a vegan diet may be better for one’s health, since long-term vegans have lower cholesterol levels and blood pressure, decreased risk of type II diabetes, heart disease and certain cancers. They also have a healthier body weight."}, {"text": "“If [veganism] is going to get popular, that’s great, “ Mr. Hartmann said, “but it’s got to get beyond the food or the personal choices; it’s got to be everything else you do.” Going vegan is a lifestyle choice."}], "file_structural_elements": {"title": "Is going vegan worth it?", "date": "February 13, 2020", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "Many people think that meat is delicious. It’s savory, tender and adds flavor to basic dishes such as pizza or salads. Dairy products, such as cheese and butter, add a nutty taste and creamy texture that makes almost anyone drool. So, it’s common for people to ask, “Why should one go on a diet as ex", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/vegetable-part-2-900x675.jpg"}}