{"tree_elements": [{"text": "Students are obsessed with success in academics, sports, extracurriculars.   Many would say that mental health contributes  the most to every success. In recent years this has become a much more prominent topic not just in high schools but also in the world."}, {"text": "According to The CDC “Mental health includes our emotional, psychological, and social well-being. It affects how we think, feel, and act. It also helps determine how we handle stress, relate to others, and make healthy choices.” This is increasingly important in high school as students are under pressure from class, family, and sometimes other students. Across the country teenage mental health has reportedly gotten worse."}, {"text": "A big reason behind this is due to the lockdown caused by the COVID-19 pandemic. The isolation has had lasting effects where students find it difficult to interact with others again or have become more reserved in their day to day activities."}, {"text": "When asked about the major effects of the pandemic on mental health, guidance counselor Ms. Antonella Facchini said, “I think people went through a period of isolation, and everyone as a population has had to shift how they communicate with people.” During quarantine, numerous people lost basic socialization skills. Those interactions, especially with friends, are important to  maintaining a balanced  mindset."}, {"text": "This time of being alone had a negative effect on everyone but especially high schoolers. According to a CDC study, 37% of high schoolers had their mental health worsen during isolation which could then affect their performance in school even now and their ability to socialize with others. “Students had to almost rekindle and reestablish not just with their peers, but also with their teachers,” Ms. Facchini said."}, {"text": "The increase in negative mental health should be a more well known topic among students because being aware is an important part of helping others with their struggles. This could lead to some students not wanting to talk about their mental health because they are uncomfortable about opening up even though it should be a subject people are not afraid to talk about."}, {"text": "“Even though we’re a pretty open school in the sense that we have resources to help kids, I don’t think that kids go and utilize these resources,” Anantaa Banerjee (‘24) said."}, {"text": "Counselors know better than most people that mental health is an important issue for most people and therefore try their best to make sure anyone is able to reach out."}, {"text": "“I think we’re in a very supportive and nurturing environment here where people notice and that notice goes a long way,” Facchini said."}, {"text": "“There is more of a limelight on mental health and on how to improve your mental health and that’s a good thing,” Shyam Kumar (‘23) said. The more people are aware means the more people are going to be willing to help others on this subject."}, {"text": "Students need to remember that anyone can experience mental health issues. Remember, there are people ready to help and there are ways to benefit yourself by making time to do things you enjoy and by spending time with people whose company you enjoy."}, {"text": ""}], "file_structural_elements": {"title": "Isolation’s lasting effects on teens", "date": "January 5, 2023", "writer": {"DQxuMRIBHUmdxqFGbMS4": {"name": "Connor Florendo", "year": "2022"}}, "description": "     Students are obsessed with success in academics, sports, extracurriculars.   Many would say that mental health contributes  the most to every success. In recent years this has become a much more prominent topic not just in high schools but also in the world. \n     According to The CDC “Mental h", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/37__of_students_experienced_struggling_mental_health_during_isolation__3_-removebg-preview.png"}}