{"tree_elements": [{"text": "The Jonas Brothers are back and better than ever. In March of this year, the band released music for the first time since their split in 2013. Their new single “Sucker” broke streaming records and remained #8 on Billboard five weeks after its release."}, {"text": "For a lot of millennials and generation z’ers, the Jonas Brothers are a big part of their childhood."}, {"text": "“I always listened to the Jonas Brothers growing up,” junior Meghan Krabbe said. Now, four albums, 15 chart topping singles and one hiatus later, the brothers are back in full force."}, {"text": "The Jonas Brothers got their big break when they signed a contract with Disney in 2007. Even though Disney was responsible for their illustrious career- giving the brothers’ main roles in popular Disney original movies and even their own show-the brothers have expressed their conflicts with the worldwide worldwide company."}, {"text": "In a 2013 essay written for New York Magazine, Joe Jonas claimed that under Disney’s control, the brothers struggled to find their own voice. A lot of their lyrics were shut down because they were deemed not appropriate for Disney’s image. Jonas even claimed sometimes their “creative process was blocked.” However, the brothers did not let that stop them."}, {"text": "After the brothers’ first hit album, their career skyrocketed. The New York Times labeled the summer of 2008 as “Summer of Jonas.” That same year, the brothers landed roles in the popular original Disney movie “Camp Rock” and even got their own TV show, “J.O.N.A.S.”"}, {"text": "Throughout all their fame, the Jonas Brothers stayed true to their roots. In the beginning stages of their career, they would travel to shows as a family. Their parents concentrated on making sure the fame didn’t get to them. In an interview with the New York Times, their dad and co-manager said, “They’re a group and they want to do things in a group.”"}, {"text": "Despite the many magazines that labeled the brothers as a “boy band,” the three brothers have always made it clear this was never the case. “We are not a boy band in the traditional sense,” bandmate Kevin said in a 2008 New York Times interview. “We don’t dance or have synchronized moves. We are a pop-rock band.”"}, {"text": "The band went through a hiatus in 2013 when they came across some musical differences. Joe Jonas opened up about the split in his 2013 essay, saying they had broken up because of a fight which resulted in a decision to part ways for a couple of years."}, {"text": "In his New York Magazine essay, Joe Jonas revealed the hardships the band had faced looking back. He talked about how hard it was for the brothers to accept the lack of privacy that came with fame, as well as how degrading it was being constantly controlled by Disney."}, {"text": "With all of that behind them, the brothers are ready to come back into the spotlight. In a recent March interview with James Corden, Nick Jonas revealed that even though the brothers have “separate lives” now, they decided it was time to reconnect. “We started playing music together and realized right away that this is where we are meant to be in our lives at this moment,” Jonas said."}, {"text": "Now, the brothers look forward to continuing their career. It seems like good times are ahead for Jonas Brothers’ fans. The band has officially confirmed a new album titled “Happiness Begins,” which will be released on June 7 followed by a North American tour in August. Tickets go on sale May 10."}, {"text": "“I’m so excited for their new music because I was a huge fan when I was a kid. It’s cool to see them making a come back,” junior Phoebe Elias said."}, {"text": "Meanwhile, their latest single “Cool” hit the radio on April 5 at full speed, showing that fans should expect to experience a revived “Summer of Jonas” this year."}], "file_structural_elements": {"title": "Jonas Brothers restore happiness in former fans with new music", "date": "May 21, 2019", "writer": {"": {"name": "Alyse Dunn", "year": ""}}, "description": " The Jonas Brothers are back and better than ever. In March of this year, the band released music for the first time since their split in 2013. Their new single “Sucker” broke streaming records and remained #8 on Billboard five weeks after its release. \n     For a lot of millennials and generation z", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/Jonas-Brothers-2-900x600.jpg"}}