{"tree_elements": [{"text": "What are the top five national holidays for you? Christmas? Thanksgiving? Memorial Day?"}, {"text": "The chances of Juneteenth National Independence Day crossing people’s minds when thinking of the top five national holidays are quite slim. But, I don’t think this should be the case. Juneteenth should be on everyone’s top five list of national holidays."}, {"text": "Since June, 2021 when President Joe Biden signed the Juneteenth National Independence Day Act into law, Juneteenth has become a national holiday celebrated on June 19."}, {"text": "The holiday can be traced back to 1865 when about 2,000 Union soldiers arrived in Galveston, Texas and freed over a quarter-million slaves. A common misconception is that the President Abraham Lincoln’s 1863 Emancipation Proclamation freed all slaves in America, but actually the decree freed only some because it wasn’t enforced for all slaves until two years after the Proclamation on June 19."}, {"text": "Some call the Juneteenth holiday Emancipation Day, Freedom Day, or even Second Independence Day."}, {"text": "Michelle Obama, former first lady of America, said on social media, “What I love about Juneteenth is that even in that extended wait, we still find something to celebrate. Even though the story has never been tidy, and Black folks have had to march and fight for every inch of our freedom, our story is nonetheless one of progress.”"}, {"text": "Despite the historical importance of this day, the holiday hasn’t traditionally been widely celebrated. Mr. Joseph Porter, American Studies teacher, said, “Historically, like many others, I didn’t celebrate Juneteenth in part because there was no day off for it.”"}, {"text": "With President Biden’s recognition of this milestone in American history as a national holiday, Juneteenth will be more widely celebrated by all Americans."}], "file_structural_elements": {"title": "Juneteenth", "date": "June 22, 2022", "writer": {"441oJuAOMJ93mb04Urf2": {"name": "Jordan Blaise", "year": "2021"}}, "description": "What are the top five national holidays for you? Christmas? Thanksgiving? Memorial Day?\nThe chances of Juneteenth National Independence Day crossing people’s minds when thinking of the top five national holidays are quite slim. But, I don’t think this should be the case. Juneteenth should be on ever", "image": null}}