{"tree_elements": [{"text": "The guests are well fed, their children hoarding gelt, the sounds of blessings are still ringing in the room and there is a warmth like no other–Hanukkah has finally begun."}, {"text": "This year, the Jewish holiday Hanukkah took place on the nights spanning from Dec. 2-10. The holiday includes festive traditions like playing dreidel, a game with a spinning top, eating traditional food and lighting the candles on the menorah – a special candelabra, designed for each of the eight nights of celebration."}, {"text": "Hanukkah is more than a holiday for gift giving and good food, but a reminder of faith and miracles."}, {"text": "Hanukkah is based on the miraculous story of a group of Jewish brothers nicknamed the Maccabees. According to the well-known story, in 164 B.C. the holy city of Jerusalem was taken over by Romans who forced the city’s Jewish population to convert to paganism."}, {"text": "The Maccabees reclaimed the city, but when they arrived at the city temple, they only found one jug of purified oil to use as fuel for lighting the temple flame. Miraculously, the oil lasted eight nights which was long enough to purify a new batch of oil and keep the flame burning."}, {"text": "“It’s as though your phone only had a 2 percent charge and it lasted for 10 days,” said Dara Sheller, Advanced Placement Literature teacher at South."}, {"text": "The miracle of the oil lasting eight nights and the Maccabees’ dedication is celebrated during the holiday of Hanukkah, a celebration that many of our South community shares."}, {"text": "Sophomore Rachel Seasonwein believes Hanukkah represents optimism. “No matter what happens, there is something good that comes out of it,” she commented about the origin of Hanukkah. She added that her favorite Hanukkah tradition is a more modern one, gift-giving."}, {"text": "Senior Louis Josephson agreed. However, he said that the greater lesson Hanukkah has to teach is about appreciation. “Of course young children love getting gifts… but realizing that there is so much more to Hannukah [like] appreciation [is the bigger picture],” Josephson said."}, {"text": "For Sheller the bigger picture was making her kids happy. “When my kids were smaller, I used to really like fulfilling [their] wish lists, [Hanukkah] was a way for me to make my kids not feel like they had their noses pressed up against the window at Christmas.”"}, {"text": "Sheller also listed traditional foods like latkes (flat potato cakes) or sufganiyot (jelly-filled donuts) as some of her most distinctive memories. “I grew up in Manhattan and my dad used to bring home jelly donuts from Brooklyn… They were incredible,” she remembered."}, {"text": "Even the food is representative of the Maccabees faith. The food during Hanukkah is usually fried, to represent the oil that was used to keep the temple’s flame lit and the house of God warm."}, {"text": "Josephson said his favorite are latkes."}, {"text": "For Brian Levinson, World History teacher at South, what he likes best about Hanukkah has nothing to do with the holiday at all. “As I’m not a very religious person, the most important thing for me about these holidays is that they bring family together,” Levinson said."}, {"text": "For him, Hanukkah is about who you celebrate with, like his almost two-year-old son Henry who spent this Hanukkah learning to say “Hanukkah candle” and “the shamash is on top.”"}, {"text": "Sophomore Rachel Trokenheim agreed that Hanukkah is about more than presents and food. “The most important part is the story behind it” she said."}, {"text": "“There were so few Maccabees and they beat the Romans. They inspire me to keep going and to stand up for what I believe in,” said Trokenheim."}, {"text": "Trokenheim smiled and added “They remind me that you can accomplish anything.”"}, {"text": ""}, {"text": "IMAGE COURTESY OF RACHEL TROKENHEIM"}], "file_structural_elements": {"title": "Lights, latkes, laughter: celebrating Hanukkah", "date": "January 23, 2019", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "     The guests are well fed, their children hoarding gelt, the sounds of blessings are still ringing in the room and there is a warmth like no other–Hanukkah has finally begun.\n     This year, the Jewish holiday Hanukkah took place on the nights spanning from Dec. 2-10. The holiday includes festive", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/hannukah-900x425.jpg"}}