{"tree_elements": [{"text": "The bright lights of a grand music hall in Salzburg, Austria dimmed as Louis Josephson took the podium. With a swift motion, Josephson signaled the ensemble to begin."}, {"text": "Josephson, a critically acclaimed and nationally recognized composer, is a South senior and the winner of the National Association for Music Education and the finalist for the Maurice Ravel International Composition Competition. At 18, Josephson is making an impact on the music industry, and he is also part of  the South music community."}, {"text": "Josephson applies his musical talent and experience by composing pieces for South’s band, orchestra, chamber ensemble and choir. In addition, Josephson plays percussion in the Wind Ensemble, piano in Jazz Ensemble, drums and percussion in the pit orchestra and directs and sings in South’s acapella group, “Noteworthy.”"}, {"text": "That Josephson is attending the The Juilliard School next year comes as no surprise. In addition to composing, Josephson is involved in other musical activities. Josephson said, “Mainly I play the piano and percussion. I liked to play anything I can get my hands on because I feel like it helps me work on my composition skills and my overall craft.”"}, {"text": "Music has played a crucial role in Josephson’s life. “I have always been involved with music. I have pictures of me from when I was two years old playing the piano or banging on drums.” Josephson said, “My parents told me that I was singing before I was speaking. I learned how to talk through music.”"}, {"text": "Music is part of his identity. “It is who I am and it is how I express myself,” he said."}, {"text": "Josephson has taken his passion for composition and music and has gained success. Among his list of accomplishments, Josephson has garnered national recognition through winning prestigious competitions such as the Make Music Young Composer contest, The Association of Concert Bands Young Composer Competition and the Metropolitan Youth Orchestra of New York Emerging Composers Competition."}, {"text": "In addition, the Music Teacher National Association has praised Josephson’s compositions. A judge from the association said that his music “felt like it came from the heart — it had a kind of originality to it. It felt like it had something to say.”"}, {"text": "Among these commendable achievements, Josephson finds that the achievement he is most proud of is his acceptance into The Juilliard School for composition."}, {"text": "Josephson said, “I’m pretty excited about [the acceptance] and [Juilliard] has always been my dream school. Ever since I knew what a college was, I said I wanted to go to Julliard. Even before I actually knew stuff about the program I just knew that it was where I wanted to be in New York City with like-minded people.”"}, {"text": "Josephson  has made his mark on South’s music community. This year, Josephson created several compositions to contribute and make South’s music performances even better."}, {"text": "Josephson said, “I am going to have a piece played by the Wind Ensemble this spring that I will conduct myself and then next winter the choir will be premiering a piece that I wrote. I do whatever I can because the music department is why I love South.”"}, {"text": "Last year, Josephson composed a piece called “Electricity” that the South band and orchestra performed at Salzburg. “Electricity” is a significant piece as it is the first work for which Josephson published and won an award."}, {"text": "Josephson said, “[Electricity] really shows who I am as a composer. It’s a very simple, hummable, memorable melody that is supported by rich harmonies.” He described it as a traditional piece and added that the simplicity of the piece was what brought out the meaning for him."}, {"text": "Josephson sets an example for other students."}, {"text": "South’s band teacher Mr. Argenziano said, “Louis is one of a few music students whom I’ve seen go beyond the learning of an instrument and really venture into composition and with much success, as he is already a published composer before graduating high school. He is what our society and culture are trying to guide young students to be: self-directed.”"}, {"text": "Josephson not only impacts his peers, but he also makes an impact on South’s music faculty."}, {"text": "“[Josephson] gives nothing less than 100 percent here,” said Mr. Argenziano, “and that is because he loves it. He wants to be his best for himself, his fellow musicians and his ensemble.” Mr. Argenziano added, “Louis’ musical ability motivated and challenged me to be a better musician and teacher, and for that, I am thankful.”"}, {"text": "Josephson has made great strides at South, and his journey is just beginning. “I would like to make an impact as a musician on the world whatever that ends up being,” Josephson said. “Music is what I have been doing my whole life.”"}, {"text": ""}], "file_structural_elements": {"title": "Louis Josephson: passionate musician, composer off to Juilliard", "date": "May 21, 2019", "writer": {"": {"name": "Cathy Xiang", "year": ""}}, "description": "     The bright lights of a grand music hall in Salzburg, Austria dimmed as Louis Josephson took the podium. With a swift motion, Josephson signaled the ensemble to begin. \n     Josephson, a critically acclaimed and nationally recognized composer, is a South senior and the winner of the National Ass", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/Juilliard-your-mom-900x629.jpg"}}