{"tree_elements": [{"text": "Love is stronger and more powerful than any of the other forces students learn in their science classes. Neither ionic, covalent, nor metallic bonds can explain this hard to define force. Love isn’t something that is given or taken — it is something that is shared between two individuals."}, {"text": "“Without love, we feel empty and lack a purpose,” said junior Supriya Mamidi."}, {"text": "Valentine’s day is an opportunity to develop these connections and create healthy relationships. In fact, having a healthy relationship is proven to boost morale, happiness and kindness towards others.\nLove blossoms differently for different people. Two people may make eye contact and feel an instant connection. For others, romance flourishes after years of friendship."}, {"text": "“Love is something that takes time,” said sophomore Melissa Liu. “We shouldn’t rush it. A connection will develop over time. When I first met my significant other, we were just friends in the same friend group. Over time, we talked more and formed a deeper connection. Starting the relationship was easy. It wasn’t forced.”"}, {"text": "Mary-Kate Harty, South’s UBHC (University Behavioral Health Care) Mental Health Clinician and adolescent therapist, had a similar relationship with her significant other. “My husband is my best friend. We were best friends before we started dating.”"}, {"text": "A healthy relationship develops smoothly and feels natural."}, {"text": "According to Ms. Harty, meeting someone and feeling natural around them are two of the first signs of falling in love."}, {"text": "“You have to spend a lot of time with the person, get to know that person, find out what connects you with that person and develop that connection,” said Mamidi."}, {"text": "Sophomore Aryan Panda had similar ideas about building a healthy relationship. “It just happens; it’s like a natural progression.”"}, {"text": "Ms. Harty said, “Love or a connection, especially when you’re a teenager, is so intense. You meet this person and feel like you are completely understood in a way like never before. At the moment, this is the person that you feel like will validate you.”"}, {"text": "A biological response is associated with this feeling. According to Healthline, oxytocin “can help promote trust, empathy, and bonding in relationships and oxytocin levels generally increase with physical affection.”"}, {"text": "Trust, empathy and bonding are all important for building and maintaining strong relationships.\nThe more the couple communicates and enjoys spending time with each other, the more the relationship blossoms into something more meaningful!"}, {"text": "“Having that connection is so important,” Ms. Harty said."}, {"text": "“Being in a relationship gives you a support network, a sense of validation, companionship in a world where technology is constantly advancing and we are so connected but still so far apart from each other because we’re not spending as much time together.”"}], "file_structural_elements": {"title": "Love: the strongest force", "date": "February 13, 2020", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "Love is stronger and more powerful than any of the other forces students learn in their science classes. Neither ionic, covalent, nor metallic bonds can explain this hard to define force. Love isn’t something that is given or taken — it is something that is shared between two individuals.\n“Without l", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/HEART-900x876.jpg"}}