{"tree_elements": [{"text": "Walking into South’s brightly lit remodeled media center, students can find an expressive collection of masks made by South’s art department. These masks, part of an assignment from the Sculpture and Ceramics class, now adorn the tops of bookshelves."}, {"text": "Assigned by art teachers Ms. Samirah Aklaq and Mr. Nathan Leventhal, the project asked students to “create a mask of protection or power.” Masks – because of their duality – prompted interesting conversations in class where students tried to explore and identify their own invisible masks."}, {"text": "“The process is a lot of fun,” described Ms. Akhlaq. “You get to think; you get to have conversations with students. It’s lovely to see people open up.”"}, {"text": "Sophomore Michelle Chao, when making the project, wanted to include how she felt in her mask. “At that time, I felt very stressed, and I didn’t know what to do, so I just felt like floating on water.” She expressed this idea of floating through black ink on a white surface, which portrayed the “wild and empty” nature of her own invisible mask."}, {"text": "The process of making the mask helped students channel their emotions in a creative way. “I could feel my pressures lighten because the project displayed my pressures,” said Chao."}, {"text": "The assignment also allowed students to cast their own faces. “You build the shape of your face,” said Ms. Akhlaq."}, {"text": "Students had the opportunity to be creative in any way they wanted to and use any technique they wished. Ms. Akhlaq recalls some students “used the technique of throwing it, breaking it and putting it back together, because that’s what their mask was.”"}, {"text": "Along with the masks, students also wrote an artistic statement that explained their process in creating their mask. “It is a little bit of an insight of where the artist got inspired from,” explained Ms. Akhlaq."}, {"text": "The masks exhibition received a warm reception by South students. Junior Thara Ellsworth said, “I think it is very creative, and it very nice to look at when you are at the library.”"}, {"text": "Sophomore Vanessa Zhang agreed, “It’s interesting to see how people view themselves and the perspective they see themselves in.”"}, {"text": ""}, {"text": "PHOTOS BY RENEE PUJARA"}], "file_structural_elements": {"title": "Masks of Protection and Empowerment: Art Department’s new project unveiled", "date": "March 23, 2022", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "    Walking into South’s brightly lit remodeled media center, students can find an expressive collection of masks made by South’s art department. These masks, part of an assignment from the Sculpture and Ceramics class, now adorn the tops of bookshelves.\n     Assigned by art teachers Ms. Samirah Akl", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/IMG-4648-900x675.jpg"}}