{"tree_elements": [{"text": "“Music is universal and performing is a tangible way of feeling change in the emotions of others,” said sophomore Max Wang, a critically acclaimed pianist."}, {"text": "Wang was the recipient of the Jack Kent Cooke Young Artist Award, a prestigious scholarship awarded to musically talented youth. Wang has also won the Steinway Junior Competition in Philadelphia, placed as a finalist at the Albert M. Greenfield Concerto Competition, and was named as the Harmony for Peace Junior Peace Ambassador in 2017."}, {"text": "Recently, Wang was featured on the National  Public Radio Show (NPR) “From the Top” for his outstanding achievements in music. From the Top is a national platform that shares stories of classically trained musicians and features the potential of young musicians. At 15, Wang has already made a considerable impact in the music industry and actively participates as an oboist in the South band program."}, {"text": "The musical talent that Wang has was always present in Wang’s life, even during his childhood."}, {"text": "Wang said, “I’ve always had a natural inclination towards music. I remember collecting books about music. If I liked anything on the radio, I would write it down and make sure to mimic the composition of the song because I liked it so much.”"}, {"text": "Not only does Wang have a natural passion for music, but his mother also helped nurture this love ."}, {"text": "“My start in music mostly began with my mom. When she was younger, she didn’t have the privilege to learn how to make music,” Wang said. “She wanted to be able to give me the opportunity that she didn’t have.”"}, {"text": "Learning to play the piano was difficult at first. “As I grew to love piano,” Wang said, “I began to understand how it was my own way of having an outlet and expressing myself. It’s a very rewarding activity because although I have to deal with delayed gratification all the time, the awareness and discipline I build is invaluable.”"}, {"text": "After starting piano at the age of 6, Wang made his Carnegie Hall debut at the age of 8 and made his concert debut with the Bravura Philharmonic at 11. Carnegie Hall is one of the most prestigious concert halls in the United States and the Bravura Philharmonic Orchestra is a renowned local orchestra based in West Windsor."}, {"text": "Through the nine years Wang has performed, he has enjoyed making connections with his audience . “It’s hard to put this feeling to words, but performing is such a heart-to-heart experience,” Wang said."}, {"text": "For a seasoned performer like Wang, performing remains a learning experience."}, {"text": "“Even if it’s not my best performance, the mistakes push me to practice more. I have this sense of duty to excel and this sense of responsibility so when my hard work pays off, it’s the best feeling.”"}, {"text": "Wang’s musical talent and passion for piano is recognized by the  Jack Kent Cooke Young Artist Scholarship, the accomplishment Wang is most proud of."}, {"text": "“For a while, I had no support to give to help out my parents in terms of money. I did feel guilt especially since learning classical music at a high level is prohibitively expensive,” Wang said. “This award really showed me that there were people that believed in me enough to allow me to continue to develop as a musician.”"}, {"text": "In addition to receiving a scholarship, the Jack Kent Cooke Young Artist Award allows musicians to feature their story and performance on the NPR show “From the Top”."}, {"text": "Wang said, “It was a very validating feeling. Alongside getting to showcase what you have done over the past few years, you also have a chance to share your story. The show helped give me a voice.”"}, {"text": "Wang is also able to spend time giving back to the community by participating in the nonprofit organization Harmony for Peace. Wang helps put together music concerts in schools or concert halls and the proceeds of Wang’s performance go to organizations such as the World Health Organization (WHO) or The United Nations Children’s Fund (UNICEF)."}, {"text": "“Harmony for Peace is a way I have created for greater accessibility to music in my community. Performing a world premiere at the Kimmel Center is one notable memory I have and that was because of the opportunities I was given at Harmony for Peace,” Wang said."}, {"text": "Wang hopes to carry his love for music and service to South. Next year, Max is planning to introduce a music education initiative to aspiring musicians."}, {"text": "Despite performing at the national stage, Wang stays humble and reflects on the obstacles he has faced in becoming a better musician."}, {"text": "“I’ve been through the toxic mindset of comparing myself to people who I thought were better than me,” Wang said. “But it is important to be persistent at working hard if I want to evaporate any sense of insecurity.”"}, {"text": "Wang’s future as a musician is just beginning. “I want to eventually get to a point in piano where the music I play feels like myself,” Wang said. “But for now, I have learned to follow my heart and follow what I want.”"}, {"text": "PHOTO COURTESY OF FROM THE TOP"}], "file_structural_elements": {"title": "Max Wang combines musical talent and discipline in harmony", "date": "June 15, 2020", "writer": {"": {"name": "Cathy Xiang", "year": ""}}, "description": "“Music is universal and performing is a tangible way of feeling change in the emotions of others,” said sophomore Max Wang, a critically acclaimed pianist.\nWang was the recipient of the Jack Kent Cooke Young Artist Award, a prestigious scholarship awarded to musically talented youth. Wang has also w", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/Screen-Shot-2020-06-15-at-11.20.27-AM-900x604.png"}}