{"tree_elements": [{"text": "Emily Creveling is South’s new assistant principal. Though Ms. Creveling has been at South for less than 6 months, she has already become an invaluable part of the school."}, {"text": "Before arriving at South, Ms. Creveling was an English teacher at Green Brooks Academy in New Jersey, where she taught for four years."}, {"text": "After attending graduate school at New York University, she co-founded a small school in Brooklyn. “I was working in New York at an organization called Urban Assembly, which supported about 25 middle and high schools in Manhattan, the Bronx and Brooklyn.”"}, {"text": "Ms. Creveling said she loved being around students. “When you have a school position, you are really getting the opportunity to be around young people. That’s one of the reasons why I went into education,” said Ms. Creveling. “I just love working with young people, I love working with kids, I love being a teacher and I find it really energizing, so I’m really excited to be here.”"}, {"text": "Being assistant principal at South involves answering emails, attending district meetings pertaining to curriculum and equity matters, managing student conflicts, organizing extracurricular activities, scheduling repairs, attending students’ classes and observing teachers."}, {"text": "Although much of an assistant principal’s job is about logistics and formal matters regarding the running of the school, the job is also about catering to the needs of South’s community. “It really can change at any minute depending on the needs of our teachers and of our students and parents,” said co-assistant principal Paul Hamnett, who has been at South for over 20 years."}, {"text": "Ms. Creveling’s breadth of experience in schools across the tri-state area has brought a fresh point of view to South. “I don’t have the perspective she does in terms of the way things are done elsewhere,” said Mr. Hamnett. “So she’s been bringing a lot of that to me and to our supervisors.”"}, {"text": "When asked what her first impressions of South are, Ms. Creveling said, “One thing that just really stuck out to me is that it just felt like a warm, welcoming and caring environment.”"}, {"text": "Despite the pandemic, Ms. Creveling has been making South a better place from her first day, from adding to South’s positive atmosphere by greeting students as they enter the school to bringing new perspectives on the ways a school can be run."}], "file_structural_elements": {"title": "Meeting the new assistant principal of South", "date": "June 3, 2021", "writer": {"q6Q38H1MOB4iX1yvzBi4": {"name": "Dahria Charadnichenka", "year": "2020"}}, "description": "     Emily Creveling is South’s new assistant principal. Though Ms. Creveling has been at South for less than 6 months, she has already become an invaluable part of the school. \n     Before arriving at South, Ms. Creveling was an English teacher at Green Brooks Academy in New Jersey, where she taugh", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/3A155942-E504-40DA-AD70-017DE83C31C0.jpeg"}}