{"tree_elements": [{"text": "A year inside our homes has inevitably impacted all of our mental wellness: we haven’t seen our friends and extended family in person, big yearly events were cancelled and many exciting activities for South students were postponed."}, {"text": "With all the changes due to COVID-19, see how the South community has adjusted to these unprecedented times."}, {"text": ""}, {"text": "Have you been taking care of your mental health and well-being in 2021?"}, {"text": ""}, {"text": "Dr. Meenakshi Bhattacharya: I try to take a walk everyday and go outside, taking in the fresh air and enjoying the scenery."}, {"text": ""}, {"text": "Eric Yee (Class of 2021): Yes, I have. I’ve been trying to keep busy with more fun activities while taking it easy on my school workload. I try to talk with my friends as much as I can, and connect with them online."}, {"text": ""}, {"text": "Aadit Manyem (Class of 2022): Despite the stress that comes with the dreaded junior year, I always find time to take care of my emotional well-being. Mental health is my number one priority!"}, {"text": ""}, {"text": "Ms. Alexa Swartz: Yes. As a teacher, I prioritize the needs of my students above the needs of myself, which is not ideal. But to be honest, this makes me feel better. Just like many individuals, I sometimes don’t treat my mental health as good as I could be."}, {"text": ""}, {"text": "How did quarantine impact your mental health?"}, {"text": ""}, {"text": "Aadit Manyem (Class of 2022): Having my spring track season cancelled and not seeing my friends definitely took a toll on my mental health. Many events I was looking forward to were cancelled, and I spent long hours imagining life without quarantine. However, I think South took the correct steps to mitigate the students’ stress in these tumultuous times."}, {"text": ""}, {"text": "Ms. Alexa Swartz: I would say that quarantine both had positives and negatives in relation to my mental health. The negatives came from the isolation, and the lack of community and conversations. However, the positives stemmed from the amount of time I had to reflect about what is currently serving me and what is not serving me as an individual at the current time of my life."}, {"text": ""}, {"text": "Eric Yee  (Class of 2021): I think quarantine has worsened my mental health, as I have been feeling down a lot more than when we weren’t in quarantine. However, I’m starting to realize where my values lie now that I can’t participate in a lot of my normal activities. I guess I’m using quarantine as a chance to mature a little."}, {"text": ""}, {"text": "How are you planning on keeping your mental health strong for this upcoming year?"}, {"text": ""}, {"text": "Donna Nagorny (Class of 2022): I’m probably going to do some more self-care and start healthier habits like eating well and sleeping more. For example, I will go for walks and listen to music, and I also often give myself self-care sessions from time to time (long shower, face mask, the whole shebang haha)!"}, {"text": ""}, {"text": "Ms. Alexa Swartz: Enough though I have an idea, it’s hard to bring it into fruition. During quarantine, I think it’s important to discover what helps you and what doesn’t, so rather than consider a plan, I am just hopeful to continue to do things that benefit me and continue to leave behind what doesn’t benefit me. I haven’t realized how to translate what I have learned from quarantine to outside of quarantine. I don’t really have a plan for this positive mental health growth. The thing that quarantine has given us is a lot of time with all these expectations to bring back to a normal society. So, I am nervous that the things that I have identified will become less prevalent because I lost that time that quarantine has provided me."}, {"text": ""}, {"text": "Aadit Manyem  (Class of 2021): Staying organized, not procrastinating and having “brain breaks” are some of the strategies I plan to use to keep my mental health steady for this upcoming year."}, {"text": ""}, {"text": "Dr. Meenakshi Bhattacharya: I plan to continue on my daily walks. When it becomes safe and I get the vaccine, I will go back to the gym and work out. In addition, I plan to listen to music more frequently and play musical instruments to try to uplift my mood. I play the sitar for 30 minutes every day, so this has really helped my mental health."}, {"text": ""}, {"text": "What are some ways that you have been keeping in check with your mental health?"}, {"text": ""}, {"text": "Ms. Alexa Swartz: I do yoga weekly and I have tried to do meditation. I try to listen to my body regularly – like if it needs exercise, food, rest, etc…I try to manage my work and my play time. I realized that during quarantine there is no separation between work and home, so I am creating a balance between work and play. Most recently, I have ordered these mining rocks and you get these soils, shark teeth, fossils, and crystals. It’s just given diffusion time, which I think is important during quarantine. I picked up mining, candle-making and color-by-number."}, {"text": ""}, {"text": "Eric Yee  (Class of 2021):  I’ve been keeping in check with my mental health by holding onto the hope of when quarantine is over. As long as I have something to look forward to, I’ll be able to bear whatever happens in the upcoming future. I can usually nap, listen to music or play a game to calm myself when I get down."}, {"text": ""}, {"text": "Aadit Manyem  (Class of 2022): Running, listening to music and cooking are just a few of the activities I’ve been partaking in to sustain my mental health during the quarantine."}, {"text": ""}, {"text": "Do you have any goals related to mental health in 2021?"}, {"text": ""}, {"text": "Ms. Alexa Swartz: My overall goal is to continue to practice effective strategies for mental health even after normal life can be back!"}, {"text": ""}, {"text": "Eric Yee (Class of 2021): I want to make some new friends, and in doing so, be able to support each other’s mental health by having each other’s backs."}, {"text": ""}, {"text": "Aadit Manyem (Class of 2022): Sleep deprivation has been shown to have an adverse effect on mental health, so I’m definitely going to try and get eight hours of sleep per day in 2021!"}, {"text": "Image courtesy of Melissa Liu"}], "file_structural_elements": {"title": "Mental Health in 2021", "date": "June 18, 2021", "writer": {"IEgx27jeMWPMtV0BxA2O": {"name": "Melissa Liu", "year": "2021"}}, "description": "     A year inside our homes has inevitably impacted all of our mental wellness: we haven’t seen our friends and extended family in person, big yearly events were cancelled and many exciting activities for South students were postponed. \n     With all the changes due to COVID-19, see how the South c", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/image1-1-900x587.png"}}