{"tree_elements": [{"text": "(General Psychology, Neuroscience, Biology/Biological Sciences)"}, {"text": "“The most competitive college in the SUNY (State University of New York) system. They are nationally known as a good school with a low cost, which makes them great value. This earned SUNY Cortland a ranking of #156 on the Best Colleges for the Money list, placing it in the top 20% overall. This colleges is one of the nation’s top 50 public universities for the 20th consecutive year. According to U.S. News & World Report (2019), Binghamton is the #80 best national university in the nation, and #32 best public university.”"}, {"text": "(Computer Science, Biology, Economics, Political Sciences)"}, {"text": "“Grinnell College, a small liberal-arts school in the middle of Iowa, is giving much larger colleges a run for their money, literally. Put tiny, but well-regarded, Grinnell is ahead of Ivy League powerhouses like Harvard and Yale. Grinnell College’s ranking in the 2020 edition of Best Colleges is National Liberal Arts Colleges is #14. Its tuition and fees are $54,354 (2019-20). They meet 100% of financial need, and have an open curriculum. The founder of Intel went to Grinnell. The school is also considered the best location for Political Science outside DC.”"}, {"text": "(Communication, Journalism, Visual and Performing Arts, Business, Management)"}, {"text": "“It is known for the Roy H. Park School of Communications, which is ranked by several organizations as a top school for journalism, film, media and entertainment. The college has a strong liberal arts core, and offers several pre-professional programs, along with some graduate programs.”"}, {"text": ""}], "file_structural_elements": {"title": "More Overlooked Colleges", "date": "December 20, 2019", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}, "22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "SUNY – Binghamton University, Binghamton, NY\n(General Psychology, Neuroscience, Biology/Biological Sciences)\n“The most competitive college in the SUNY (State University of New York) system. They are nationally known as a good school with a low cost, which makes them great value. This earned SUNY Cor", "image": null}}