{"tree_elements": [{"text": "Before COVID-19, movie theatres were a comfortable and happy place. Now, most theaters have shut down across the United States due to the pandemic. Highly anticipated movies with release dates in 2020 have been rescheduled for 2021, 2022 and in some cases, 2023. Some companies have released their movies on streaming services, like the live-action remake of “Mulan” and “Artemis Fowl” (released on Disney+). However, some movies can’t be released on streaming services since not all companies have one, making the wait even longer. The following movies some of the most anticipated theatrical releases of 2021."}, {"text": "“Raya and the Last Dragon” is a Disney animated film that follows a young warrior, Raya, on a quest to find the last dragon on Earth to unite the people of her land and defeat evil spirits. Kelly Marie Tran voices Raya, Awkwafina voices Sisu the dragon, Gemma Chan voices Namaari and Benedict Wong voices Tong. Taking place in the fictional land of Kuamandra, the movie is influenced by Southeast Asian cultures. For example, Raya’s pet and primary mode of transportation is an armadillo she calls Tuk-Tuk. In Thailand, a tuk-tuk is a three-wheeled vehicle used as a taxi. The film will be released in theatres and on Disney+ with Premier Access."}, {"text": "“I think I’ll like ‘Raya and the Last Dragon’ because it seems like an adventure through a fascinating world with a background of tragedy and an entertaining character duo leading the viewer through it,” said freshman Cassiopeia Mitova. “Having watched the trailer, it definitely seems like these movies would appeal to people of all ages, but I think that more mature audiences – teen and up – would get a better experience from the movie because they would better appreciate what the characters are going through and the message behind the movie.”"}, {"text": "“A Quiet Place II” follows the Abbott family that must now face attack by the invasive creatures of the Earth. It is an apocalyptic horror/thriller movie that mostly focuses on the idea of family. The first movie (released in 2018) has received many nominations and awards such as the Academy Award for Best Sound Editing, the BAFTA Award for Best Sound, the Teen Choice Award for Choice Movie: Drama, Golden Globe Award for Best Original Score and many others. The director of the film is John Krasinski, who also played a major role in the first movie as the father, Lee Abbot. Emily Blunt, plays Evelyn Abbott, the wife. A fun fact about the cast is that in real life, John Krasinski and Emily Blunt are actually married to each other. Millicent Simmons plays the daughter, Regan Abbott and Noah Jupe plays the son, Marcus Abbott. The Abbott family must leave the refuge of their farm and head into the outside world to find other humans if any are alive at all. Filming locations include Barcelona Harbor, Lake Erie and Olcott in Akron."}, {"text": "“I usually don’t like horror movies, but it was so unearthly and eerily calm that it was wonderful to watch. If the sequel’s anything like the first one, I’d definitely recommend it,” freshman Amaidhiameya Ilangovan-Arya said. “I think the first movie wasn’t traditionally scary because it wasn’t too gory but it was unsettling in a different way and had me on the edge of my seat watching it. I’d rate it 9/10.”"}, {"text": "In an interview, Kevin Feige, President of Marvel Studios, said that “Black Widow” is one of the most fan-requested movies in the Marvel Cinematic Universe (MCU). After a decade of waiting, the request has been fulfilled. The movie is said to take place between the events of “Captain America: Civil War” and “Avengers Infinity War”, where the main character, Natasha Romanoff (“Black Widow”), is on the run from the American government. Based on the trailer, new characters will appear in the movie as well. Florence Pugh, Rachel Weisz and David Harbour will be playing some of these characters. It is also rumored that Robert Downey Jr., who plays Iron Man, might be cast in the movie as a cameo. The film shooting locations include Ørsta, Norway; Sæbø, Norway; Budapest, Hungary and Oxfordshire in the UK. “Black Widow” will be the first movie of Marvel’s Phase 4 and Marvel fans cannot wait. “Phases” refers to story arcs."}, {"text": "Phase 1 includes the movies “Iron Man,” “The Incredible Hulk,” “Iron Man 2,” “Thor,” “Captain America: The First Avenger” and finally “The Avengers.”"}, {"text": "Phase 2 includes the titles “Iron Man 3,” “Thor: The Dark World,” “Captain America: The Winter Soldier,” “Guardians of the Galaxy,” “Avengers: Age of Ultron” and “Ant-Man.”"}, {"text": "Phase 3 is the largest of the Phases so far and includes, “Captain America: Civil War,” “Doctor Strange,” “Guardians of the Galaxy 2,” “Spider-Man: Homecoming,” “Thor: Ragnarok,” “Black Panther,” “Avengers: Infinity War,” “Ant-Man and the Wasp,” “Captain Marvel,” “Avengers: Endgame” and “Spider-Man: Far From Home.”"}, {"text": "Junior Vama Deshmukh said, “I’m usually a sucker for strong female roles or leads. Black Widow was the first strong female that was in the movie because she had an actual character (not just as a love interest or something like that). Especially in the early Avenger movies, she was a part of the team, not just a love interest or a side character. I came to love her even more in ‘Avengers: Infinity War’ and mostly ‘Avengers: Endgame’ when she had shown the most character development and it was beautiful.”"}, {"text": "Though the coronavirus pandemic took the world by storm, movies and shows have helped people connect. The streaming service industry has skyrocketed and the number of films available (for a small price) is extraordinary. However, thanks to human imagination, creativity and technology, movies and TV shows have allowed for an escape from the pandemic and allow us to sit back, relax, and briefly forget about the outside world and its issues. What are your most anticipated movies for 2021?"}, {"text": "Images by Kiko."}], "file_structural_elements": {"title": "Movies and blockbusters of spring 2021", "date": "March 12, 2021", "writer": {"GwWvqK6bCH2OlR5Zw9hK": {"name": "Rujula Mahajan", "year": "2020"}}, "description": "     Before COVID-19, movie theatres were a comfortable and happy place. Now, most theaters have shut down across the United States due to the pandemic. Highly anticipated movies with release dates in 2020 have been rescheduled for 2021, 2022 and in some cases, 2023. Some companies have released the", "image": "https://thepirateseye.org/wp-content/uploads/2021/03/PNG-image-3-675x900.png"}}