{"tree_elements": [{"text": "Benjamin Young, physics and forensics teacher, said he is looked at as the “little brother of the science department.”"}, {"text": "And it is no wonder: Mr. Young graduated from Rutgers University in 2017, the same year that he started student teaching at South. He was hired as a full-time teacher last year."}, {"text": "When he was a student at Rutgers, because of his interest in math and science, he began a major in engineering. But after studying engineering his freshman year, Mr. Young realized that he didn’t like it and was actually quite miserable. Because of this, he decided to start teaching physics and so changed his major. Mr. Young described this moment as an epiphany."}, {"text": "While he pursued his degree, he was also busy working as a college assistant teacher, instructing students the same age and older than him."}, {"text": "“Because I was around the same age as my students, I was able to connect more with them because we liked the same things, listened to the same music and went to the same places,” said Mr. Young. “Sometimes I would see them at social sites, like campus hangout spots.”"}, {"text": "One afternoon, a group of students at one of the campus hangout spots saw him walking by and called him over to socialize. The students created close connections with him."}, {"text": "He brought these communication skills to South and efficiently formed connections with the students here."}, {"text": "One of Mr. Young’s physics students Knicholas Yeh said, “Mr. Young understands us and relates to the way his students talk. He connects with us because of his sense of humor.”"}, {"text": "Melissa Naud, a science teacher, agreed and added, “He is really laid back and very chill. He is still very hard working at the same time.”"}, {"text": "Furthermore, Mr. Young said, “I was always interested in watching a lot of NCIS and a lot of crime TV. I really liked the idea of forensics but never thought I would pursue anything in that subject.”\nWhen he was first offered the job at South as a physics teacher, he was taken by surprise when he was told he had to teach forensics as well. “Ever since I started teaching it, I’ve been learning simultaneously with my students about the world of forensics.”"}, {"text": "In the classroom, Mr. Young said, he wants to treat his students with respect and set them up for success. “I want my students to think that they don’t have to be or act a certain way. I want them to feel comfortable and let out their own personalities.” And this is how I feel in his forensics class. Unlike other science classes where the emphasis is on individual work and memorization, forensics is hands-on and interactive. Mr. Young makes sure all his students are involved in class, whether during lessons or labs.\nMr. Young said, “I want my students to be able to walk into a class and genuinely have a good time and have fun.”"}], "file_structural_elements": {"title": "Mr Young’s hands-on approach to teaching", "date": "February 13, 2020", "writer": {"t1wNGC5vCu2m5zKSZgLI": {"name": "Sophia Englezos", "year": "2020"}}, "description": "Benjamin Young, physics and forensics teacher, said he is looked at as the “little brother of the science department.”\nAnd it is no wonder: Mr. Young graduated from Rutgers University in 2017, the same year that he started student teaching at South. He was hired as a full-time teacher last year.\nWhe", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/Mr-Young-Photo-900x675.jpg"}}