{"tree_elements": [{"text": "On Dec. 31, 2019, many cases of presumed pneumonia were reported in Wuhan, China. In a later report by the World Health Organization (WHO), the disease was confirmed to be COVID-19. The cases eventually escalated globally and by March, WHO declared the COVID-19 outbreak a pandemic. Soon after this, measures were put in place to prevent the spread of COVID-19. Hospitals began administering COVID tests for patients and requiring people to wear face masks. Many patients like me had to stay in separate rooms and we were protected by strict, routine sanitation measures."}, {"text": "Last summer my spinal cord became compressed to the point where my legs temporarily lost function. After growing concerned, my father contacted my orthopaedic surgeon at the Alfred I DuPont Children’s Hospital, Wilmington, Delaware where I’ve been receiving treatment for my orthopaedic conditions. A few weeks after the start of school, my surgeon informed my father and me that I needed spine surgery. To ensure the safety of others in the hospital, I was required to test for COVID-19 the day before my surgery. The test could be either the pharyngeal test (where the throat is swabbed) or the nasopharyngeal test (where the nose and throat are swabbed), which some prefer because it has a higher rate of accuracy. I had a pharyngeal test. If I tested positive, my surgery would be delayed by three weeks. Thankfully, I was negative."}, {"text": "After my father and I took the elevator and walked into the main atrium where the welcome desk was located, we saw purple, circular signs on the floor telling people to stay six feet apart. A portable guardrail was installed to keep people apart. When we got up to the front desk, a woman took our temperature using an infrared thermometer. Across the hospital, there were signs that explained which face coverings will and will not protect against COVID-19."}, {"text": "After the doctors and nurses prepared me for my surgery, I was sedated and taken to an operating room. A few hours later after the surgery, I was escorted to my room. As usual, the first night after surgery was a lot of heavy monitoring. Doctors, nurses, cleaners and others came by, clad in their usual medical attire, including face masks and signed their name and how long they stayed in my room on a paper hanging outside on my door. Once a day, the cleaning staff came in and sanitized my room."}, {"text": "Because of the pandemic, the hospital had made additional adjustments to ensure the safety of staff and patients. “We weren’t doing optional surgeries at the height of the pandemic,” said Colleen Ditro, a nurse practitioner at Alfred I DuPont Children’s Hospital.  “Only emergency surgeries. They had to close down some operation rooms for social distancing.”"}, {"text": "In addition to shutting down operation rooms, Orthopedic nurse Nichole Small said that the hospital got new face masks and face shields for the staff. “Parents have to make sure that they don’t contaminate anything. They have to be escorted on and off hospital grounds as they leave.”"}, {"text": "Furthermore, frequent deep cleans were another measure taken to lower the spread of COVID-19. According to general surgeon Dr. Kirk Reichard in a video posted by the hospital, “To keep our families safe, we start by doing regular deep cleans of all our patient care spaces and waiting rooms. This includes the use of a special electrostatic spray designed to kill COVID-19 on surfaces.”"}, {"text": "In addition to sanitizing patient care spaces, a new rule was implemented on Nov. 6 stating that doctors must wear some form of facial covering, such as a face shield or goggles, during pre-op and surgery."}, {"text": "Measures such as having on a form of facial covering as well as frequent deep cleaning helped me feel safe from COVID-19. Besides this, the commitment of all the hospital staff to keep me and other patients safe also played a major factor in helping me not become another case of the pandemic."}, {"text": "Image by Ishita Jadon."}], "file_structural_elements": {"title": "My hospital visit during COVID-19", "date": "March 11, 2021", "writer": {"": {"name": " Nikhil Kishore", "year": ""}}, "description": "     On Dec. 31, 2019, many cases of presumed pneumonia were reported in Wuhan, China. In a later report by the World Health Organization (WHO), the disease was confirmed to be COVID-19. The cases eventually escalated globally and by March, WHO declared the COVID-19 outbreak a pandemic. Soon after t", "image": "https://thepirateseye.org/wp-content/uploads/2021/03/71ABE198-F43F-4136-9D2A-7921C71CD704-675x900.png"}}