{"tree_elements": [{"text": "Spring"}, {"text": "Last May 21, I entered a Zoom meeting with almost all the supervisors in WW-P. With determination, I dove into delivering my half-hour presentation on the necessity of implementing lessons about disability in K-12 curriculums. At one point during my presentation, I felt my cortisol levels skyrocket to levels I’d ever experienced in my life."}, {"text": "What brought me to this moment of skyrocketing cortisol levels? It all began in March on Instagram, when I started following Diversify Our Narrative, a student-led organization advocating for inclusive curriculums in classrooms across the U.S. Inspired by them, I began to put my thoughts down in an outline titled “The Disability Curriculum,” which contained possible topics about disability that teachers could bring into the classroom."}, {"text": "My thinking was that if schools needed to prepare students for the world full of diverse people around them, then they needed to teach about disabled people, too."}, {"text": "As I set out to accomplish my goal, I edited “The Disability Curriculum” outline throughout the month."}, {"text": "In April, I realized that I had to contact someone to get the curriculum implemented. So, I decided to take the matter all the way up to the supervisors of the WW-P curriculum. I reached out to science supervisor Richard Stec and social studies supervisor Carl Cooper. The next day, I scheduled a one-on-one Zoom meeting with each of them."}, {"text": "At my first Zoom meeting with Mr. Cooper, we made plans about how to get disability included in the social studies curriculum. He proposed that we write an article for Edutopia, a website founded by filmmaker George Lucas, that would help teachers plan lessons about disability and resources they can use to do so. Mr. Cooper advised that since teachers meet to write the subject curricula over the summer, I could attend one of those meetings and give a presentation on the importance of including disabilities in social studies lessons."}, {"text": "A few hours later, I met with Mr. Stec over Zoom and we discussed how to implement the subject of disability into the science curriculum. He brought up the idea of meeting with the supervisors of WW-P and showing my disability curriculum to Dr. David Aderhold, the superintendent of WW-P."}, {"text": "In the weeks after my May 21 presentation , I prepared to work with curricular supervisors such as Mr. Stec, Mr. Cooper and Cathy Reilly — one of the two language arts supervisors — to ensure that disability was implemented into the WW-P curriculums and into the classrooms."}, {"text": "As I continued to follow up with Mr. Stec, Mr. Cooper and Ms. Reilly, I revised the disability curriculum to include various topics that deepen understanding on disability such as Aktion T4 (Adolf Hitler’s genocide that targeted disabled people), stereotypes about disability in the media, genetically caused disabilities, and more."}, {"text": "Summer"}, {"text": "A few months later, on the morning of July 11, I attended an in-person meeting with several K-5 teachers who were revising the social studies curriculum. In the audience were Mr. Cooper, teachers I’d met when I was a student at Maurice Hawk and Village, and a North senior, who like me, was also working with Mr. Cooper."}, {"text": "Similar to my presentation with supervisors from WW-P, I gave a slide presentation that included topics that could potentially be taught in elementary school."}, {"text": "Then, on July 27, I attended a Zoom meeting with Ms. Reilly and some language arts teachers. There, I presented various topics, such as the marginalization of disabled people as well as how to change the world to help disabled people, that could be easily integrated in high school LA classes."}, {"text": "Autumn"}, {"text": "In the blink of an eye, summer vacation was over and school started. Now, I was spending my days working to achieve A-grades and study for the impending PSATs. At noon on Sept. 28, I caught up with Mr. Cooper to discuss the effectiveness of the inclusion of the disability curriculum in social studies."}, {"text": "Mr. Cooper said, “One of the revised curriculum units will have more representation of physical and invisible disabilities and that is part of a social studies unit that centers on identity, respect for others and community. Across the board from K-5, we have adopted more books that would be used as read alouds for elementary school students. At morning meetings, something we would do is have a read aloud for kids and some of those books we have purchased for classroom libraries do include more attention to representation.”"}, {"text": "Not long after my conversation with Mr. Cooper, I found out that my disability curriculum was reflected in biology and Language Arts I on the district curriculum webpages. That moment, I felt all my hard work had succeeded!"}, {"text": "The last eight months of my life have been a long road full of twists and turns. My collaborations with curricular supervisors and teachers have helped craft a more disability-inclusive curriculum."}, {"text": "But my journey hasn’t ended.  This is only the beginning of the work I plan to do in the years ahead."}, {"text": "PHOTO AND IMAGE BY NIKHIL KISHORE"}], "file_structural_elements": {"title": "My life’s project", "date": "November 11, 2021", "writer": {"zvlB1uq0RYxyMvCNpViY": {"name": "Nikhil Kishore", "year": "2021"}}, "description": "Spring\nLast May 21, I entered a Zoom meeting with almost all the supervisors in WW-P. With determination, I dove into delivering my half-hour presentation on the necessity of implementing lessons about disability in K-12 curriculums. At one point during my presentation, I felt my cortisol levels sky", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Untitled-drawing-1.png"}}