{"tree_elements": [{"text": "The first night of Ashvini, which corresponds to the Gregorian months of September and October marks the celebration of the nine most auspicious days in the Hindu calendar."}, {"text": "The Navaratri festival, with its dances and rich customs, is a festive time of year for the Indian community. On these days, the feminine divine is at the center of prayers and celebrations."}, {"text": "Navaratri worships various avatars of the feminine divine. “Everyday is a celebration for different goddesses for the nine days of Navaratri,” said Khushboo Etai (‘23). “It’s a very special occasion that shows the diversity of our culture with representing women.” The festival honors womanhood."}, {"text": "The legend most associated with Navaratri is that of the mother goddess Durga, who represents strength and protection. Durga defeated the powerful demon Mahishasura on the tenth night of Navaratri."}, {"text": "The Navaratri festival is celebrated in many different ways: for some, it is a time for fasting and religious reflection, while others see it as an auspicious occasion for meeting with family and friends, for dancing and feasting."}, {"text": "“For a lot of first generation Americans,” said Dharma Rajesh (‘25), “we lose touch with a lot of the cultural holidays we celebrate, so holidays like Navaratri are really important to me.”"}, {"text": "At South, students celebrate the festival in many different ways. Smriti Balaji (‘24) said, “My family makes various different sweets, decorates the house, sets up a golu, which is a structure of steps made for setting up different statues of gods, and invites family over to celebrate with us.”"}, {"text": "Another Navaratri tradition involves making mithai, sweet delicacies mostly made with milk or flour. Surmai Agrawal (‘24) said, “My family makes a bunch of special treats together.”"}, {"text": "One of the most popular traditions of Navaratri is taking part in garba and dandiya raas, two closely related forms of folk dance."}, {"text": "“Garba was a wonderful experience for me this year,” said Gargi Bansu (‘24). “It’s an amazing time of year with energetic people who can all express themselves through the form of dance.”"}, {"text": "In addition to the Navaratri traditions and celebrations, students enjoy strengthening a bond with their culture. Navaratri festivities are open to all who want to celebrate."}, {"text": "“The sense of community and all the fun and music that goes on at events is so much fun to be a part of,” said Eva Sharma (‘25). “Experiencing all the food, music, and prayer connects me more deeply to my culture."}], "file_structural_elements": {"title": "Navaratri", "date": "November 17, 2022", "writer": {"": {"name": "Suhani Gupta", "year": ""}}, "description": "Henna Sharma (’24) and Surmai Agrawal (’24) enjoy Garba. Photo by Gargi Bansu (’24).\n     The first night of Ashvini, which corresponds to the Gregorian months of September and October marks the celebration of the nine most auspicious days in the Hindu calendar.\n     The Navaratri festival, with its", "image": null}}