{"tree_elements": [{"text": "“How do you not know what TikTok is?” I hear students asking in the hallways of South. Our generation’s newest trend has become an internet sensation almost overnight. With one billion users worldwide, the popular app TikTok is taking the world by storm. But, how did this all start?"}, {"text": "To understand how TikTok is influencing the world, it’s important to know exactly what the app is. TikTok describes itself as “[t]he destination for mobile videos.” The New York Times refers to it as “[a]n app for making and sharing short videos.” In other words, TikTok is another social media platform created for teens’ entertainment purposes."}, {"text": "The app was developed by the China-based Internet technology company ByteDance in 2016. The app didn’t reach popularity until it was launched in the international market in 2017. By the time summer 2019 hit, I couldn’t go anywhere without hearing about TikTok."}, {"text": "The newfound popularity of TikTok is understandable considering its many appeals, one of them being how easy it is to use. When a user opens the app it takes them directly to the “For you” page, which is essentially a bottomless pit for all TikTok videos ever made. The concept of just scrolling up to the next video and double tapping to like it is very effective. People find it much easier to use compared to other social media apps. “I find TikTok so much more accessible than Twitter,” said senior Phoebe Elias, “TikTok is very easy to follow and that’s why I think so many people enjoy it.”"}, {"text": "Another quality that appeals to many users is the ease in gaining a following and becoming “internet famous” compared to other social media apps. TikTok works on an algorithm that runs on trending hashtags."}, {"text": "Anyone can get on the “For You” page by simply posting their video with a #foryoupage underneath of it. Users will see the videos on their page and will have the option to like it, just scroll past or swipe right to view the user’s profile. The more frequent a user posts, the better chances they have to get on the “For You” page, get more likes and gain a following."}, {"text": "Possibly the best part about TikTok, though, is the fun trends that it creates for teens. These trends quickly take the internet by storm. Whether it’s a new dance fad, lip-synching to a popular song or a relatable short comedy skit, TikTok has it all."}, {"text": "Teens especially enjoy the new trends and creating videos with their friends. “I love making TikToks with my friends. No one even sees them except for us. It’s just fun to laugh about them,” said Elias.\nDespite all of these unique and trendy features of the app, it has its critics. “TikTok is not exactly adding anything new to the social media world,” said senior Meghan Krabbe."}, {"text": "Critics aside, TikTok has many fans. A recent New York Times article referred to the app as, “a refreshing outlier in the social media universe.”"}, {"text": "It’s a great place to go if you’re looking for some light hearted fun and some laughs."}], "file_structural_elements": {"title": "New app TikTok becomes internet’s latest sensation", "date": "November 1, 2019", "writer": {"": {"name": "Alyse Dunn", "year": ""}}, "description": "“How do you not know what TikTok is?” I hear students asking in the hallways of South. Our generation’s newest trend has become an internet sensation almost overnight. With one billion users worldwide, the popular app TikTok is taking the world by storm. But, how did this all start?\nTo understand ho", "image": null}}