{"tree_elements": [{"text": ""}, {"text": ""}, {"text": "Here at South, one can find over 40 different clubs. Debate club. Key Club. Business Club. Physics Club. Whether a Pirate is a musician, an academic, an aspiring politician, South has a place for them to prepare for their future.\nThis year, in addition to the dozens of clubs that existed previously at South, many new clubs have been started by South students. These new unique clubs give students the opportunities to create connections, learn new things and be recognized for their interests.\nOne such club is the Music Technology Club. “Our club, we’re more focused on making music rather than playing music,” said Kaeya Gudipati (‘25), founder of the club.\nThe Music Technology Club provides aspiring composers with tools, resources and space to create musical masterpieces. Gudipati said that the focus isn’t on real musical instruments or on playing them, but instead giving members the opportunity to create music using applications such as Garage Band and Band Lab.\nGudipati started Music Technology to share her passion with like-minded South students.\n“​​I’ve been making music for over a decade now. I’ve always really loved music, so I wanted to share my interest with other people since there’s not many clubs who focus on the technology part of music,” said Gudipati. She wants to give students an avenue to express their love of music, and share it with others.\nThe club also provides members with the chance to display their skills to others, and share their technological compositions. “We’re planning on creating seasonal projects, like a Halloween project and a Christmas project. Those projects will be featured on either the morning announcements or in the hallways on Fridays,” said Gudipati.\nAnother new addition to South’s diverse list of clubs is the Application and Game Development Club. “Our club is mainly focused on building apps and games,” said founder Mehal Bhattacharya (‘23).\n“We use programming languages like Dart, and tools such as Flutter to accomplish building efficient and innovative apps.”\nThe club enables students interested in computer science to develop programs and unique apps with other like minded people. The club is already planning on participating in the Congressional App Challenge, one of the most prestigious coding competitions in the country.\nThis competition tasks students with creating their own original apps and compete in district-wide competitions.\nStudents are excited. Bhattacharya said “We’re trying to get members into that challenge, and trying to get them to compete because we want to encourage them to innovate and create their own apps and ideas.”\nBhattacharya wants the club to become a sanctuary for creativity and innovation. Open to all, the club is not lecture based and gives members space and freedom to develop whatever their imagination allows them to.\nAnother club new to South is the Disability Rights Student Association Club, or DR. SAC for short, founded by Nikhil Kishore (‘24).\n“We, basically, as the name implies, advocate for disabled people and try to raise awareness about disability,” said Kishore.\nAlongside Kishore is co-president/founder Prarthana Harikrishnan (‘25).\nKishore’s idea to start this club began a long time ago. “I wanted to start a disabilities club in my freshman year, but I just didn’t have the time to register for it,” Kishore said. “So instead, what happened was that last February, my co-president Prarthana, reached out to me and she pitched the idea that she wanted to start the club so I joined on.”\nThe club aims to reach students and raise empathy and awareness about the obstacles people with disabilities face.\nYou might have heard about one of their projects on the morning announcements.\n“We are working on a campaign surrounding disability awareness because October is National Disability Employment Awareness Month,” Kishore said. “This involves putting a poster around room 402 asking students to fill out prompts about their experiences regarding disability and ableism.”\nA long term project of the club is to establish a Disabilities Awareness Month, a month that will focus on teaching students about ableism.\nThe new editions to the South club program this year have given many students more options for clubs in which they can grow, develop and explore. All the clubs are unique in their own. In their goals. In their structure. In their atmosphere.\nAnd, each club is ‘just right’ for someone in our school. Every student should go out there, explore various clubs and find one that fits them ‘just right’. And, if they can’t, they can simply create a club of their own next yearMehal Bhattacharya"}], "file_structural_elements": {"title": "New Editions to South Club Program", "date": "November 21, 2022", "writer": {"quV4nroGEIE56FoRMO5F": {"name": "SreeCharani Avula", "year": "2020"}}, "description": "\n\n\n\n\n\n\n\nGallery|3 Photos\n\n\n\n\n\n\t\t\t\t\t\t\tNikhil Kishore \t\t\t\t\t\t\n\n\n\n\n\n\n\n \n \nHere at South, one can find over 40 different clubs. Debate club. Key Club. Business Club. Physics Club. Whether a Pirate is a musician, an academic, an aspiring politician, South has a place for them to prepare for their future.\n", "image": "https://thepirateseye.org/wp-content/uploads/2022/11/Screen-Shot-2022-11-21-at-12.24.07-PM-1.png"}}