{"tree_elements": [{"text": "The bell rings at 10:50 a.m. and students scramble up their belongings and hurry out of their classrooms. The hallways quickly fill with the bustle of students rushing to their next class and, on the other hand, those leisurely strolling to lunch."}, {"text": "Because of the ongoing coronavirus pandemic, when South reopened on Sept. 8, a new rotating lunch schedule was put in place. This means that lunch is split in two sessions: the first lunch from 10:54 a.m. to 11:35 a.m. and the second lunch from 11:54 a.m. to 12:35 p.m."}, {"text": "“We are trying to, of course, have more opportunities to maintain social distancing,” said counselor Michelle Walsh, “and that’s hard to do when 1600 students are eating at the same time.”"}, {"text": "Despite being a necessary step towards safety, students have mixed feelings about the new lunch rotation."}, {"text": "“I get the need for them,” said junior Khushboo Etai, “but it’s still sad since I do not have many lunches with my friends, which I think is weird, because in the past, we’ve always had lunch with our friends.”"}, {"text": "The rotation is such that students do not have the same lunch (first or second) every day, which often creates confusion and separates friends. Most juniors and seniors have experienced lunch without the rotations in their past years and they, more than others, reminisce about those times. But freshmen and sophomores also adjusting to the schedule."}, {"text": "“It splits up my friends and I have lunch with different people every single day,” said sophomore Rhea Vansal. “Sometimes this is good, but a lot of the time, I just want to sit down with my friends and have a designated time with a group of people that I know I can hangout with.”"}, {"text": "Although students miss having quality time with their friends, they are also aware of the upside that comes with having two lunch periods."}, {"text": "“The positive is that there are more free lunch tables so everyone is able to sit at a table instead of on the floors,” said sophomore Faith Hu."}, {"text": "Like Hu, others agree that the split lunches create a less crowded environment, due to the rule of no more than six people per table."}, {"text": "“The fewer number of people is calming and less chaotic,” said Vansal. “And of course, it’s an important safety precaution for COVID-19.”"}, {"text": "The lunches will take a bit to get used to, but the process can be sped up by realizing that this schedule is only temporary."}, {"text": "Ms. Walsh said, “I’m hoping that by next school year we can go back to single lunches.”"}, {"text": "IMAGE BY VIVIAN XIE"}], "file_structural_elements": {"title": "New lunch rotations", "date": "November 11, 2021", "writer": {"NOlffvh7x2ouyJpAMrkO": {"name": "Arishtha Dey", "year": "2021"}}, "description": "     The bell rings at 10:50 a.m. and students scramble up their belongings and hurry out of their classrooms. The hallways quickly fill with the bustle of students rushing to their next class and, on the other hand, those leisurely strolling to lunch.\n     Because of the ongoing coronavirus pandemi", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Screenshot-2021-11-11-14.15.22-900x569.png"}}