{"tree_elements": [{"text": "“The most exciting part of being an assistant principal is being able to see the growth of students from freshman year to senior year,” said Assistant Principal Ernie Covington, South’s new assistant principal for freshmen and juniors."}, {"text": "Before coming to South, Mr. Covington was at Bordentown Regional High School as an assistant principal, athletic director and physical education teacher. He was also an athletic director at Ewing Public Schools District as well as a health and physical education supervisor."}, {"text": "“As an athletic director, you have to think about your league, your county, your state,” Mr. Covington said. This wider perspective informs Mr. Covington’s approach to understanding student behavior."}, {"text": "“It could be something as simple as they’re not eating outside of school. Their family may have fallen on hard times,” Mr. Covington said. “There’s so many different scenarios that just from my experience, my wide experience dealing with athletes and students, has helped me learn.”"}, {"text": "Mr. Covington is a seasoned administrator. South is a different environment compared to previous schools he has worked in."}, {"text": "“This is the most unique building I’ve ever been in,” Mr. Covington said. “It’s very refreshing to see the art and murals.”"}, {"text": "Pirate energy is also demonstrated through South’s abundant cultural clubs and programs."}, {"text": "“I’ve seen the programs that were being run, their dedication to diversity,” he said. “In my previous districts, students would come up with things but the teacher still had to run it,” he said. He was encouraged to join South when he learned about clubs through The Pirate’s Eye, and he hopes to be involved in many."}, {"text": "“Unfortunately, in a virtual setting, we got used to everybody coming to us, whether through text messages, Zooms, Google chats — everyone came to us in some way,” Mr. Covington said. Because students had to take the initiative to reach out to teachers and administration, he wants to make an effort to reach back through social activities and clubs."}, {"text": "For instance, Homecoming helped students regain the social feeling of high school, while uniting them with school spirit."}, {"text": "“If I told you that 1600 teenagers were excited about posters on the wall, you wouldn’t believe me. Then you see it happen and it changes the whole school. That whole week has a different energy,” Mr. Covington said about Homecoming. “Hopefully, that reminds the students that there is always a social and fun aspect of school.”"}, {"text": "Having a large number of students can lead to some students feeling unnoticed."}, {"text": "“My goal is to never let anyone go unnoticed in school, especially as we’re coming back from the virtual setting,” Mr. Covington said. “I try my best to just say hi to as many students as possible.”"}, {"text": ""}, {"text": "Sport: Baseball"}, {"text": "Book: “The Outsiders” — it made him enjoy reading at a young age."}, {"text": "Movie: “The Shawshank Redemption”"}, {"text": "Dessert: Anything with peanut butter"}, {"text": "Hobbies: Chilling, spending time with family"}], "file_structural_elements": {"title": "New Assistant Principal: Mr. Covington", "date": "November 9, 2021", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "      “The most exciting part of being an assistant principal is being able to see the growth of students from freshman year to senior year,” said Assistant Principal Ernie Covington, South’s new assistant principal for freshmen and juniors.\n      Before coming to South, Mr. Covington was at Bordent", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/image1.jpg"}}