{"tree_elements": [{"text": "“They built it with the future in mind,” said Ms. Sheira Khan (‘82) about South, which opened in 1973. South will celebrate its 50th anniversary in 2023 –a half century of experiences and stories ingrained within its walls."}, {"text": "Some of these stories include pranks and, though it seems hard to believe today, food fights. Other tales of life-changing extracurriculars in science and technology and newfound passions for the humanities continue to define the South experience today."}, {"text": "From its inception, South was innovative and unconventional. Built in a culturally experimental time, South’s architecture and open classroom structure was also daring."}, {"text": "“We heard whispers that the school was going to have no windows, and state of the art equipment, which sure enough it did,” said Ms. Khan."}, {"text": "As a result, South became a point of pride for the community. “The first night they opened [South] up to the public, everybody from the town came to see the new high school,” said Ms. Khan."}, {"text": "That pride remains. When asked about student experiences in the early days of South in the “West Windsor & Plainsboro – The Glory Days” Facebook group, many alumni and former administrators were quick to respond."}, {"text": "One highlight repeatedly mentioned by alumni is the food fight of 1979. Mr. Mark McCloskey (‘79) remembers being partially responsible for it, along with Mr. Mike Root (‘79), another student."}, {"text": "“I remember asking, ‘Hey, Mike, what if we have a food fight like in Animal House?’ Somehow, he told someone and people got behind the idea, and then it happened. Everybody [in the cafeteria] seemed to know about it,” Mr. McCloskey said."}, {"text": "“People lined up the halls just standing there, waiting. Then the room exploded with food. There was food in the air. Everywhere. I saw ketchup flying across the room.”"}, {"text": "He recalled other pranks. “They had a movie in the auditorium on a Friday night, and some of us climbed up on the roof and started standing at the windows to try to scare people. I don’t know if we scared anybody. I think we scared ourselves trying to get on the roof.”"}, {"text": "Other alumni recalled how South provided a chance to nurture their interests and creativity. Ms. Amy Farrar (‘85), first found her passion by writing for The Pirate’s Eye."}, {"text": "“Working at the paper started me on a long career in writing and editing, and I am now a published book author,” she said. “The paper was where I got my feet wet in discovering that I really liked working with words.”"}, {"text": "For Ms. Khan, the national choir competition was life changing. “The robust arts program, including choir and jazz band, made me very comfortable with the arts,” she said. As a current expressive arts therapist, she credits South with igniting her passion."}, {"text": "Mr. Laurence Fieber was assistant principal of South from 1978-1994. He was also the first advisor of The Pirate’s Eye, the school newspaper which started publication in 1974. Fieber explained what was at stake for the newly opened South."}, {"text": "“We wanted to make this school work. We wanted to create the school of excellence,” he said. “What an incredible thrill to be part of the new school.”"}, {"text": "This commitment still flourishes as we near the fiftieth anniversary. Mr. Bryan Fisher (‘96), American Studies teacher, said, “The people are still spirited and invested in our Pirate Com- munity,” he said. “The bones are still very strong.”"}], "file_structural_elements": {"title": "Once upon a time: 50 years of memories", "date": "January 5, 2023", "writer": {"mmPM0AAOdiQuDZH4MUVF": {"name": "Karen Yang", "year": "2022"}, "4O50QdSwGku17T0Iu4Mx": {"name": "Smiti Yadla", "year": "2022"}, "": {"name": "Sri Sowmya Tanguturi ", "year": ""}}, "description": "“They built it with the future in mind,” said Ms. Sheira Khan (‘82) about South, which opened in 1973. South will celebrate its 50th anniversary in 2023 –a half century of experiences and stories ingrained within its walls. \n      Some of these stories include pranks and, though it seems hard to bel", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/80s-Marching-Band-900x401.jpg"}}