{"tree_elements": [{"text": "Homecoming week was filled with school spirit, and this year, South came back with newfound excitement. Homecoming Week lasted from Oct. 17–22. Student Council organized the spirit week themes and dance."}, {"text": "The idea of Homecoming brings back countless memories and emotions. “Homecoming Week is centered around school spirit and opportunity,” said Principal Jessica Cincotta. Students experience school-related events, and freshmen get to know more about South."}, {"text": "Mr. Matthew Coburn, Student Council adviser, explained that “Student Council has a very eclectic mix of all the grade levels, so everyone is represented.”"}, {"text": "To choose the theme, the Student Council brainstormed a list of ideas. This list was then sent to the administration for approval. With the approved list, the Student Council voted on and decided the theme of the year. Student Council voted on this year’s theme—Broadway."}, {"text": "Arfa Hassan (‘25) said, “I think it’s a creative theme to have. Also, Broadway’s a classic!”"}, {"text": "Sarah Hussain (‘26)  said, “I think the theme chosen for Homecoming this year was somewhat vague because ‘Broadway’ can mean so many different things. Like, there’s so many different Broadway shows that you could use as a theme.”"}, {"text": "After being discontinued for the last three years because of COVID-19, the Homecoming Dance finally returned..  The Homecoming Dance took place on Oct. 22, from 7–10pm."}, {"text": "The Pirates’ Crew returned to South. The crew is chosen by voting.   The first round of voting is by seniors only and they select ten seniors. The second round of voting is by the whole school.  Of the ten seniors selected, five are voted to be part of the crew.  The Pirates’ Crew represents the senior class during Homecoming Week. They dressed up fully in South gear and attended the dance for free."}, {"text": "Unfortunately, this year, the alumni of South did not return to the school. “It’s also for the safety and security [of the students] of having alumni wandering around the building…we want to know where the alumni are and where our students are,” said Ms. Cincotta."}, {"text": "The Homecoming football game took place at South, and our team played against Robbinsville High School. We lost the game 20–34."}, {"text": "Vedant Trivedi (‘26) said “Even though our pirates fought hard, they couldn’t pull out with a win. But that doesn’t take away from the blast we had all through the amazing homecoming week!”"}], "file_structural_elements": {"title": "Part the seas for Homecoming Week!", "date": "November 17, 2022", "writer": {"XcmuVTXN9sZF9M4e49HG": {"name": "Aadya Srivastiva", "year": "2022"}}, "description": "\n\n\n\n\n\n\n\nGallery|10 Photos\n\n\n\n\n\n\t\t\t\t\t\t\tImages from Rachael Kapoor, Yuhan Wang, Lauren Kim, Anushri Dwivedi, Mrs. Hayden, and Maria Baumgartner\t\t\t\t\t\t\n\n\n\n\n\n\n\n     Homecoming week was filled with school spirit, and this year, South came back with newfound excitement. Homecoming Week lasted from Oct. 17–", "image": "https://thepirateseye.org/wp-content/uploads/2022/11/D48E76C0-D643-4AE4-8E3E-233FF0D078EF-900x600.jpg"}}