{"tree_elements": [{"text": "Congratulations to the winners of our first Pirate’s Eye photo contest! The theme for this photo contest was “Life during the pandemic.” Participants were allowed to submit images that they felt captured the unique situation of their lives this year. The photo contest was judged by Photography teacher, Mr. Nathan Leventhal. His comments on each of the winning submissions are included below."}, {"text": "Backstory (Arjun Tewari): The back story is quite simple. I was sitting on the sofa with my MacBook and the sunset was really beautiful so I just clicked a photo with my phone and it came out pretty cool."}, {"text": "If we are looking at the overall theme of the 2020-2021 life, then without looking at any information I would pick Arjun Tewari with his moody portrait of the laptop with the glow of the beautiful sunset out the window. It sums up being on a computer incessantly maybe even to the point of missing life going on right behind you (there are no real details of the outside world and it is even out of depth of field so it’s all blurry too). The person would be looking at the screen and missing the sunset to their left! Which he didn’t of course artistically. It also seems to draw comparisons to the interior world (made even more insular and interior through the computer screen “life” reference) vs the outside world which so many of us have been isolated from."}, {"text": ""}, {"text": "Backstory (Amy Xu): Not a lot of people see the person editing behind the broadcast. It’s always interesting to see yourself quite literally create an image of yourself."}, {"text": "My second pick is Amy Xu, with her glimpse into the countless (and mostly thankless) hours working on the announcements which creates a microcosm within our already dwindled world to where she spends time not just alone looking at a screen, but also alone with herself literally! Just required to sit and look at herself and watch herself talking and editing over and over as if she wasn’t isolated enough. There is also a good balance between the sides and the battle between her attention and the computer version of herself. Her face with the cool color palette creates a subdued mood that backs up the amount of time and focus that her Sisyphean task requires."}, {"text": ""}, {"text": "Backstory (Vlad Marchenko): I set up a tripod and a digital camera, set it to BW and red filter. I tied some cables and earbuds to the computer and held it then took the picture."}, {"text": "Vlad Marchenko has the most interesting conceptual approach with overt symbolism being manipulated with deceptive simplicity. It also raises so many good conversation points."}, {"text": ""}, {"text": "Zain Zaidi also has an interior world vs exterior world dialogue going with the artificial lighting and complex area (where we are forced to spend so much time) vs outdoors a warmer/brighter world that seems open and simple. There’s also an interesting breaking of the nine-zone grid with the center of focus in the dead-center balanced by the zig-zag of the surroundings to create more dynamics, similar to many artists like Degas."}], "file_structural_elements": {"title": "Photo contest winners", "date": "May 19, 2021", "writer": null, "description": "Congratulations to the winners of our first Pirate’s Eye photo contest! The theme for this photo contest was “Life during the pandemic.” Participants were allowed to submit images that they felt captured the unique situation of their lives this year. The photo contest was judged by Photography teach", "image": null}}