{"tree_elements": [{"text": "Summer is a time to relax and have fun after a long school year. But during the summer of 2020, a lot of events were not possible – preseason was canceled and so were a lot of summer activities and internships."}, {"text": "Senior Akshata Padalkar said, “It was quieter, definitely a lot less social and very minimal time was spent outside. Compared to previous summers where I would hang out with groups of friends and just stay outside for most of the day, this summer was much less eventful.”"}, {"text": "Because of the coronavirus pandemic’s impact on the social environment, many events were adjusted to adapt to the new situation. Junior Melissa Liu said, “I had to cancel a lot of the plans that I scheduled earlier in the year. I was a little upset about that because I was really excited to start up some new activities this summer and visit some of my old friends.”"}, {"text": "Although the extended quarantine period was unexpected for a lot of South students, they adapted and found ways to make the most of their summer."}, {"text": "To make up for these plan cancellations, South students used the extra time to work on their talents, participate in new activities, spend more time on jobs and strengthen their connections with family."}, {"text": "Junior Riyana Bhatt has wanted to remodel her room and the summer was a perfect time to accomplish her goal. “I had a lot more time for hobbies and academic work and I was able to finish a lot of things that I wanted to work on but never found the time to do,” she said."}, {"text": "Other students, like Padalkar, started exploring skills that they always wanted to try but never got the time to start. “I learned how to embroider and practiced the skill on random shirts,” Padalkar said. “With all the free time, I was able to get more creative with how to spend it. I spent my time cooking, baking, doing art, embroidery and even cool nail art too.”"}, {"text": "Senior Jonathan Sauer used his skills, knowledge and interests to find jobs and volunteering opportunities. “This summer I worked on a local farm and continued running to stay in shape despite the absence of my fall cross country season,” Sauer said. “I also joined the West Windsor Volunteer Fire Company and began to learn about the gear, procedures and equipment used by firefighters.”"}, {"text": "Sauer was proud that he was able to stay active even through difficult times. “This summer gave me a lot of freedom to work on self-improvement. Whether it is physically or mentally, I had a lot of time to work out, study and hone my skills for the coming school year.”"}, {"text": "As another benefit of the quarantine, South students were spending time with the important people in their lives this summer. Liu went hiking with her family. She said, “It was a really fun experience and I got to spend a lot of valuable time with my family. I never realized how long it’s been since we last had such deep thoughtful conversations. I learned a lot about them and a lot about myself too.”"}, {"text": "Like Liu’s appreciation for her family, Padalkar learned the importance of a healthy balance between family life and personal life. She said, “I learned how and when to spend time with my family and when I should have alone time.”"}, {"text": "Some students had new additions to their families. Freshman Vinesha Shaik’s family grew by four, four pet budgies that is- two blue and white budgies and another two green and yellow budgies. “Although they are still relatively new, they have become more comfortable with my family,” Shaik said. “When we let them fly around the room, after exploring and flying around, they come back to us when they’re tired. Which is different from when we first got them since they would be hesitant to come near us.”"}, {"text": "Sometimes, we do not need to do something extravagant or travel far to enjoy our summer. Padalkar said, “Although the situation was so different, we found ways to make memories and have new experiences. One thing is for sure, this was one summer that most of us will never forget.”"}, {"text": "Photo courtesy of Akshata Padalkar."}], "file_structural_elements": {"title": "Pirates persevere during stay-at-home summer", "date": "November 3, 2020", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "       Summer is a time to relax and have fun after a long school year. But during the summer of 2020, a lot of events were not possible – preseason was canceled and so were a lot of summer activities and internships. \n     Senior Akshata Padalkar said, “It was quieter, definitely a lot less social ", "image": "https://thepirateseye.org/wp-content/uploads/2020/11/COVID-19-summer-picture.jpg"}}