{"tree_elements": [{"text": "“Hi guys! Welcome to the ‘Unraveling the World’ podcast,” a peppy voice says at the beginning of each episode. The voice belongs to sophomore Kavya Katkuri, one of the founders of the podcast."}, {"text": "Katkuri and fellow sophomores Ishani Konar and Melvina Deb sat down with me to discuss their weekly podcast and the work, stress and inspiration it brought them in 2021. The podcast engages in racial and feminist discussions, Brown stereotypes and school dress codes. One recent episode interviewed model with vitiligo (a condition in which patches of skin lose their melanin), another discussed uncovering the dark side of the logging industry. Katkuri, Konar, and Deb seek to shine a spotlight on stigmatized or overlooked topics and give a voice to marginalized communities."}, {"text": "In addition to covering stigmatized topics, the co-hosts wanted to give voice to the experience of South Asian American women. “We’re all of South Asian heritage and in the shows we watch, there are few South Asian American women. There was little to no representation of people who looked like us, and because of that we felt it was our calling to make these voices heard,” said Konar."}, {"text": "The idea for the podcast came about after a 20-minute FaceTime call last year in March."}, {"text": "“Something came up in the news about homelessness and we were talking about the issues our generation face and how challenging it is,” said Konar. She said Katkuri was originally only joking about creating a podcast, but thinking it over they realized it would be an interesting project to take up."}, {"text": "After some hesitation, Katkuri said, they took the plunge last April."}, {"text": "“Actually, after our first call about starting a podcast, we were still unsure if we would actually do it,” said Deb."}, {"text": "The podcast has on average 300 listeners per episode. Their episode “Unraveling: Societal Norms” received over 2400 listens."}, {"text": "“I came to realize it’s really important to make sure that whoever you’re working with, especially for something like this, you’ve got to be on good terms with,” said Konar."}, {"text": "The co-founders encourage and motivate each other. “What kept us from burning out is that we were able to blend into each other’s qualities which kept us–and continues to keep us–motivated.”"}, {"text": "“Because we could all bring so many different perspectives to this podcast, we’re innovative and creative together, and more motivated by each other’s qualities,” said Konar."}, {"text": "Deb said that the motivation for creating a podcast was heartfelt."}, {"text": "“We did it because we are passionate about it,” said Deb. Recent high-profile guests have been actresses Lily D. Moore from the Netflix show “Never Have I Ever” and Annie Jacob from the movie “He’s All That”."}, {"text": "When we talked about [Down syndrome] with Lily, we were able to get first-hand experiences,” Katkuri said."}, {"text": "“The experience with Lily definitely stood out to me,” said Katkuri."}, {"text": "The episode featuring Woods, a vitiligo advocate, was Deb’s favorite."}, {"text": "“Her story is so inspiring to us, especially to me because she gained back her confidence. That episode gave me confidence to know we should not let those types of things break you down,” said Deb."}, {"text": "Despite their successes, the producers themselves have faced their own fair share of obstacles. A major one was when one their guests got “cancelled” and the co-hosts were put in the line of fire."}, {"text": "“I remember when the news was coming out, I was extremely unsettled. Even before she got cancelled, it was one of our most popular episodes because she’s pretty well-known,” Konar recalled. They received backlash and the co-hosts weren’t sure whether to take down the episode."}, {"text": "Despite the backlash, Katkuri said that the work they had done pushed them not to give up. At the time, she recalls thinking, “We’ve come so far, we’ve accomplished so much, we’ve gotten so many guest speakers, we’ve recorded so many episodes, we’ve put so much effort into our Instagram feed, and we have so many listeners.”"}, {"text": "Konar said, “I remember talking to Kavya and Melvina, discussing whether or not it would be best to take down that episode, but we ultimately decided not to because the episode itself was done with good intentions in mind.”"}, {"text": "Giving a platform to marginalized voices remains the aim of their podcast."}, {"text": "Konar said, “Having the opportunity to talk to people, learn their background, and know your voice is empowering so many other listeners is rewarding.”"}, {"text": ""}], "file_structural_elements": {"title": "Podcast creators “Unraveling the World”   on inspiration, cancel culture, representation, and more", "date": "January 18, 2022", "writer": {"71hhF0oQr1LLxWE03E35": {"name": "Sidd Shetty", "year": "2021"}, "h9Cb7CTjUobs8x6jzw69": {"name": "Pranavi Sagi", "year": "2021"}}, "description": "“Hi guys! Welcome to the ‘Unraveling the World’ podcast,” a peppy voice says at the beginning of each episode. The voice belongs to sophomore Kavya Katkuri, one of the founders of the podcast.\nKatkuri and fellow sophomores Ishani Konar and Melvina Deb sat down with me to discuss their weekly podcast", "image": "https://thepirateseye.org/wp-content/uploads/2022/01/IMG-5008.jpg"}}