{"tree_elements": [{"text": "When you toss a school lunch tray or a plastic bag in a blue recycling bin, how many times have you thought about where your recycled waste ends up? We know the benefits of recycling, but does it actually reduce waste?"}, {"text": "“If you have two or three banana peels and an apple core at the bottom of a recycling bin at South and the rest of it is perfectly recyclable,” explained junior Michael Mancuso over a phone interview. “That bin of waste  can’t be recycled, which is a shame because there are students that are trying to help out by recycling.” Waste being unknowingly contaminated is a common phenomenon."}, {"text": "“The term is called wishcycling,” said Rachel Garcia in a Zoom interview. She is the owner and founder of Dry Goods Refillery in New Jersey. “It’s when you put something in the can and you assume it’ll get recycled and actually, there’s a lot of danger with that. The truth is that unless you are very aware of what your town accepts and how exactly to do it, there’s only a small chance that it will actually get recycled.”"}, {"text": "According to a survey conducted by The Pirate’s Eye, 76.5 percent of students are unfamiliar with the term “wishcycling.” 64.7 percent of South students believe plastic bags can be recycled via curbside pick up on recycling trash days in WW-P, but this is not possible according to the 2021 Plainsboro Recycling & Curbside Collection Guide and westwindsornj.org."}, {"text": "Although we hope our recycled plastic will end up being created into clothing and other goods, this rarely occurs. According to the report “The New Plastics Economy — Rethinking the Future of Plastics” by the Ellen MacArthur Foundation and McKinsey & Company, eight percent of plastic gets recycled for lower quality applications and only two percent for applications with equivalent or similar quality. In addition, businesses can fluctuate between using new and recycled plastic, according to National Public Radio."}, {"text": "Waste should be seen as circular rather than linear. In other words, waste should be used repeatedly rather than going straight to the waste bin. This idea is encouraged by Loop, a company that delivers products in reusable containers."}, {"text": "Recycling is better than immediately throwing waste away, but the best possible solution would be not to produce waste at all."}, {"text": "“In addition to reduce, reuse, recycle, is refuse,” Maiden said. “So say no to what you can buy, repair, refurbish, reuse, then recycle.” She explained that by being mindful of the long-term effects of what you buy, you can avoid creating waste in the future."}, {"text": "But if you cannot refuse waste, it’s better to prioritize reusing to control where the packaging will end up, so it doesn’t get left in a trash heap, incinerator, or the ocean. Each year, people produce 2.01 billion tons of trash, with 37 percent going to landfills, according to a report by the World Bank."}, {"text": "There are many creative and convenient ways to reuse products."}, {"text": "“The easy ones are like the reusable water bottle,” Maiden said. “Bring a tote bag with you everywhere. Then you notice, ‘Oh, wow, look at all those times that people get plastic bags and I don’t need one.’”"}, {"text": "Garcia suggests using leftover yogurt cups for planting seeds. Other typically single-use items can also be reused."}, {"text": "“I think everybody knows how to reuse Tupperware. That’s the idea,” said senior Deshik Iyengar in a Zoom call. “Single-use can be reused.”"}, {"text": "You can also buy from stores like Loop, which delivers products in reusable containers that can be sent back to be cleaned professionally or Dry Goods Refillery that allows customers to refill goods in reusable packaging. If the packaging is recycled, it would need to be transported to a material recovering facility, but by choosing to bring a container, any additional transportation or energy use is avoided."}, {"text": "Food waste can also be reduced by buying a customized amount of food at Dry Goods Refillery."}, {"text": "“It’s a great way to introduce people to new things because they can take literally just the tiniest amount,” Garcia said."}, {"text": "As a generation that strives to protect our planet for a sustainable future, we must be mindful of the waste that we produce and where it goes. We can start by not only reusing and refusing but also educating ourselves and spreading awareness in our community and school."}, {"text": "“We should have more community-wide events dedicated to educating people on what to do in these kinds of situations,” said freshman Nikhil Kishore in a phone call. Conserving our resources is essential in solving environmental issues."}, {"text": "“We have to save our planet. This is our home,” Kishore said."}, {"text": ""}], "file_structural_elements": {"title": "Prioritize Reusing over Recycling", "date": "June 19, 2021", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     When you toss a school lunch tray or a plastic bag in a blue recycling bin, how many times have you thought about where your recycled waste ends up? We know the benefits of recycling, but does it actually reduce waste?\n     “If you have two or three banana peels and an apple core at the bottom ", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/Reuse-Recycle-900x530.jpg"}}