{"tree_elements": [{"text": "Failure makes us resilient."}, {"text": "Project Pride embraces the idea of mistakes and opening up new opportunities."}, {"text": "The club, which is a collaboration between teachers and students, meets every other Wednesday after school at Thomas Grover Middle School. South students visit Grover and “help middle schoolers with their speaking, teamwork and cooperation skills,” explained senior Rahul Shah, a member of Project Pride."}, {"text": "The reason Project Pride started was because middle schoolers were having trouble navigating the social environment of middle school. Ms. Fitzpatrick said that a “group of kids were falling through the cracks” of the social and emotional environment at Grover."}, {"text": "Ms. Nancy Henzel and Mr. Frank Cinccotta, both are retired, noticed that some groups of students were having trouble socially. They started Project Pride, not knowing that it would be prevalent in both South and Grover to this day."}, {"text": "These skills are developed through a series of teamwork-related activities and socialization. “The motive of the club is to create lasting relationships and to make everybody feel more comfortable in a social setting, whether through an activity or a simple conversation while eating snacks,” said senior Ebad Jamal."}, {"text": "The structure of the Project Pride meetings supports their purpose. “We have food and drinks and then we do activities,” explained Shah."}, {"text": "Although the club is mostly student led, Jaimie Casey and Zachary Kumor, teachers at Grover middle school recruit students that are a “bit shy in class, can speak out more, and work together better” according to Shah."}, {"text": "Towards the end of the year, South and Grover students go to Camp Bernie, a YMCA day and night camp, to have build their team working skills. The South students emphasize through the camp that “you can’t really do the activities individually,” said Shah. Even for zip lining “you need people supporting you and lifting you up” stated Shah."}, {"text": "Camp Bernie and the club create powerful connections between the high schoolers and middle schoolers. “The best part is when the high school kids walk in, it’s like they are rock stars for the middle school kids, their [middle schoolers] faces light up,” said Ms. Fitzpatrick."}, {"text": "Jamal agrees, “[A] group of high school students visiting can light up a room for the middle schoolers.”\nThis impact of Project Pride goes further than middle schoolers. Project Pride has “helped me take time out of my day to appreciate a sense of community and involvement in how doing things for others can really make your day,” said Jamal."}, {"text": "Jamal even claimed that “the club made me feel as if I was doing something meaningful and helpful. Meeting with somebody you don’t know might make your day or theirs and that is why I do it.” The club impacted Jamal even though he is a leader proving how the clubs impact is never ending."}, {"text": "“The club creates an out of school family with all the middle school students and the bonds which you form are everlasting” added Jamal."}, {"text": "Ms. Fitzpatrick explained how Project Pride leaves an imprint on the students. She said, “[Y]ou see how they [middle schoolers] slowly start to feel more and more comfortable and I mean sometimes I cry at Project Pride because the growth and the way people come out of their comfort zone is just awesome.”"}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Project Pride club promotes teamwork and creates everlasting friendships", "date": "December 20, 2019", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "Failure makes us resilient.\nProject Pride embraces the idea of mistakes and opening up new opportunities.\nThe club, which is a collaboration between teachers and students, meets every other Wednesday after school at Thomas Grover Middle School. South students visit Grover and “help middle schoolers ", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/Claw-603x900.jpg"}}