{"tree_elements": [{"text": "Much-loved math teacher Ms. Bonnie Brienza is retiring after 18 years of teaching.  She taught Algebra, Geometry, AP Statistics and AP Calculus.  Junior Urvi Bhojani, who was in Ms. Brienza’s AP Calculus class this Covid-19 year, said, “I really enjoyed having Ms.Brienza as my teacher. She helped us grow from our past mistakes, reinforced key concepts in class and ensured we had a strong classroom dynamic.”"}, {"text": "Here, Ms. Brienza reflects on her years at South:"}, {"text": "How would you compare your first year at South to your last year here?"}, {"text": "The nature of education is that there are changes every year. This is part of continually trying to do better. The strength of this school district and South, in particular, is that every year we try to do better for our students. When I started at South we had 40-minute periods with no rotation, instead of the 60-minute rotating schedule we have now. The longer periods have allowed us to create a more collaborative learning environment. This has had a positive effect on students because it fosters a sense of a community of learners. This has been for students and teachers alike."}, {"text": "What comes to mind when you think of South?"}, {"text": "There is a tangible school spirit at South. Anyone who comes to a school event can feel it. I often think of those bumper stickers that say “South!” that can be seen throughout the community. The exclamation point says it all. There is something uniquely exciting, positive and affirming about being part of the South community."}, {"text": "Do you have any fond memories from the past years that you could share with us?"}, {"text": "The many school events stand out as fond memories: the homecoming decorations, watching the step team at the Black History Celebration, China Night, SAASA, so many fall dramas and spring musicals, the art display in the library and outdoor art contests, the band and orchestra concerts, musical performances during lunch, math week and so many more. Besides the school events, the triumphs of so many students over the years have been a pleasure to watch. The commitment to learning, the persistence as we worked to develop difficult concepts and the genuine caring and compassion I have observed on the part of so many students over the years has been heartwarming."}, {"text": "Is there a specific year you taught that stands out the most? Which year is it and why?"}, {"text": "It seems to me that every year has felt like my favorite year since each year always felt better than the previous one. To have my final year be the year of the Covid-19 pandemic is something quite unusual. This year is remarkable because even in the midst of a complete upheaval of our learning environment and structure, South students persevered, adjusted to our new reality and worked together to make the best of it. This resilience will carry them forward and serve as an example of their own ability to deal with adversity and to succeed. Education is about learning how to learn and this year should have made that message real to our students. Years from now, it is not a particular fact that you learned that will matter, but rather, the ability to learn and grow from the acquisition of knowledge."}, {"text": "What advice would you give to all the South students and graduating seniors? Are there any motivational words you would like to say to South students?"}, {"text": "To all my lovely seniors I would say “be kind.” This world needs kindness and compassion to guide us. Be kind to yourself and to one another. Life’s path does not have to be straight. Whichever part of the journey you are on, there are multiple paths to a successful life, one filled with purpose and love."}, {"text": "Is there anything you would like to add?"}, {"text": "It has been a pleasure to be a part of the South community. I will miss it very much and I will cherish my experiences here. It has been wonderful to be part of this dedicated community of students, teachers, administrators and staff all working together to do a little bit better each year."}, {"text": "I will remain proud to have been a Pirate."}, {"text": ""}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Q & A with Ms. Brienza", "date": "June 19, 2020", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "Much-loved math teacher Ms. Bonnie Brienza is retiring after 18 years of teaching.  She taught Algebra, Geometry, AP Statistics and AP Calculus.  Junior Urvi Bhojani, who was in Ms. Brienza’s AP Calculus class this Covid-19 year, said, “I really enjoyed having Ms.Brienza as my teacher. She helped us", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/5118DB1A-F4C0-4D1D-9E71-DEDB11353B91-900x900.png"}}