{"tree_elements": [{"text": "Before quarantine, when you entered the media center to check out a book, attend a class, or use the library’s resources, you were met with the smile of Sarah Mustoe, South’s School Library Media Specialist. She retired this year. Here is Ms. Mustoe reflecting on her years at South:"}, {"text": "When did you first become a part of the South community? What were your first impressions?"}, {"text": "I came to South five years ago. I had been at North for a few years in a part-time capacity as a Media Specialist. Here, I was immediately taken with the Pirate spirit and sense of community. Often, words and phrases like “spirit” or “sense of community” are thrown out as platitudes in an attempt to describe a feeling or a place, but at South these words carry weight. I felt immediately at home and felt lucky to come to work every day in such a special place. The staff were all very welcoming, and the students were incredibly polite and respectful. Of course, there were challenges, but in general, I have felt that students and staff alike enjoy being a part of something that feels like family, something larger than themselves."}, {"text": "I was fortunate also to follow in the footsteps of the two long time and well-loved librarians who came before me, Randye McBride and Deborah Marinsky. I wished I had managed to leave behind some kind of a memoriam to them; they were at South for a long time and established many of the library procedures and practices that are still in evidence and that help to make the library what it is. I also appreciate the book collection that they left, so that even if I have not been able to update it much and have been busy weeding older materials, the core collection is one they developed, and I only wish more materials were circulated. I tend to tell people that some of the oldest books in the collection are some of the best. Books do become dated, but some of the oldest have held their value over time."}, {"text": ""}, {"text": "What are some of your happiest memories at South — something you will look back at and smile?"}, {"text": "I worked closely with two library aides during my years at South, Mrs. Nikolaeva and Mrs. Khot. Any regulars at the library will have seen them behind the circulation desk. The three of us worked together and coordinated efforts with our student library department aides, and over the years we had regular lunchtime business meetings/parties and formed a close-knit group. We had lots of fun and laughs –  and our aides collectively have contributed in so many ways of which I’m certain the school community is not fully aware."}, {"text": ""}, {"text": "What will you miss most about South?"}, {"text": "I’ll miss the students, the staff, and the administration, all who contributed to that special South spirit. I’ll miss seeing not only the library aides and helpers but the “regulars” in the library be they students or staff. I’ll also miss the special occasions, such as Halloween and Homecoming, and other school events, such as the fall drama and spirit week."}, {"text": ""}, {"text": "Is there something you have learned from your experience at South that you would like to share?"}, {"text": "I’ve learned that being in an atmosphere of positivity and goodwill goes a long way; I have encountered this generosity of spirit time and again, and I want to take this with me. My wish is that everyone connected with South carries some of this out into the world, especially in this time of uncertainty and for many real hardships."}, {"text": ""}, {"text": "Reflecting back on your first year at South, how would you compare it to this year?"}, {"text": "The first year there was definitely a learning curve in taking over the management of the library, those first few months especially. This year, though, was especially challenging. Before the lockdown, there was planning for eventual construction, so unneeded equipment and books needed to be weeded, and a lot was accomplished with regard to these efforts. However, with the lockdown and all the uncertainty plus the challenges of online learning, it’s been more difficult, although I’ve learned a lot, as we all have, with this new reality."}, {"text": ""}, {"text": "You have supported South’s unofficial book club since its beginning. Do you have any hopes or wishes for the club?"}, {"text": "I have been privileged to support and participate in South’s unofficial book club for the past two years, and I am happy to say that two rising seniors will be taking charge next year: Suneha Sinha Ray and Chacrica Pagadala. I hope that the club will grow and that perhaps the club may become official. Book Clubs at South have come and gone, I understand, but I hope that it will become a fixture in the school. Reading is so important, and just having the club is one way to highlight the importance of leisure reading. There are so many benefits, and I feel that the majority of students don’t give reading its due. Since school became virtual, the Book Club did as well, and we have continued to read and discuss books together."}, {"text": ""}, {"text": "Do you have any message for South students and staff?"}, {"text": "Please support the library in any way you can think of; be appreciative, come to the library and use its resources. With budgetary challenges, libraries everywhere, be they school or public or academic, libraries and their resources are at risk, and they get by with very little. The library needs its community."}, {"text": "I also want to say congratulations to all the seniors and I wish them well. I admire their fortitude in making it through this difficult end to their high school careers."}, {"text": ""}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Q & A with Ms. Mustoe", "date": "June 19, 2020", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "     Before quarantine, when you entered the media center to check out a book, attend a class, or use the library’s resources, you were met with the smile of Sarah Mustoe, South’s School Library Media Specialist. She retired this year. Here is Ms. Mustoe reflecting on her years at South: \n     When ", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/E599574B-54AC-4EB6-8BF6-F3E5C460992F-900x900.png"}}