{"tree_elements": [{"text": "I interviewed retiring teacher Ms. Dawn Bozian.  In the interview below, she speaks about her years teaching in WWPRSD and how South evolved to be the spirited community it is today."}, {"text": ""}, {"text": "What department were you a part of? What subject did you teach over the years?"}, {"text": "I’ve been a part of the Family and Consumer Sciences Department (formerly known as the Life Skills Department) for the last 36 years. My first two years, I taught one Foods class that consisted of first-year and advanced level students combined, along with eighth-grade cycle classes. Later, I continued to teach more classes for the department and an Independent Living class for Special Needs students."}, {"text": "When enrollment increased at South, I taught the same classes to the Severe Special Needs students known as the LARKS. Soon after, the Youth Teaching Youth (YTY) program became part of my department and I wrote the curriculum and began teaching that course for future educators in 1993-94."}, {"text": "Since then, I have mainly taught Child Growth and Development and YTY with a few years of Adaptive Life Skills–until the LARKS program was moved to North–and Culinary Arts."}, {"text": ""}, {"text": "When did you first become a part of the South community? What were your first impressions?"}, {"text": "I began teaching at South in 1985 after teaching one year in a school for emotionally disturbed children in North Jersey. My first impressions were, “No walls, open space. Oh my goodness!”  Even in my area, the sound of the class next door was so distracting — as were the aromas of the food they were preparing."}, {"text": "The 600s area was the “Middle School” – all classes for grades seven and eight were held there, except for science, which was taught in an area where the Media Center is currently located–in the Pit!"}, {"text": "The demographics were very different from what they are now. Because of the proximity to Princeton and it being the mid-’80s, the students’ dresses and mannerisms were very collegiate at that time – boys wore button-down collar shirts with ties and long plaid shorts and girls wore sweaters with pearls. It was very different from what I was used to."}, {"text": "The lockers in Commons One were painted yellow and in Commons Two and Three they were orange. All the students used their lockers and the 7th and 8th graders had theirs right outside my classrooms and wow, were they loud!"}, {"text": ""}, {"text": "What are some of your happiest memories at South — something you will look back at and smile?"}, {"text": "There are so many. There was the Pirate Preschool, where over the years I watched my students interact with the children in such positive and life-changing ways for both the preschoolers and themselves. It was also a joy to spend time with my colleagues’ delightful children and watch them grow!"}, {"text": "Another one of these memories was creating the YTY program and working closely with The Center for Future Educators at the College of New Jersey. Together we exposed South’s interested students to the world of education through numerous opportunities and programs within the district and throughout the state. Witnessing one of my YTY students become the very first state president of the New Jersey Future Educators Association (NJFEA) and another student get voted by delegates from across the country to become president of the NJFEA were some of the proudest moments for me."}, {"text": "I had a lot of fun in the classroom, too. Years ago during a fire drill, we settled the Pirate preschool  children on the grass in a circle to play “Duck, Duck, Goose.” Then, students from the 600 and 700 areas gathered around and joined the group, creating the largest “Duck, Duck, Goose” game I’ve ever seen! Another day, we set the fire alarm off when having a barbeque activity with the LARKS on a rainy day. The borrowed grill was set up right outside an exterior door and the wind blew the smoke inside and off went the alarm on a rainy day!"}, {"text": ""}, {"text": "What hopes do you have for all these activities you participated in?"}, {"text": "I hope that the programs I put my heart and soul into over the years continue to flourish and grow.  Developing them brought me great joy and satisfaction and witnessing the effect they had on my students, contributing to and enhancing their lives, will remain with me forever."}, {"text": ""}, {"text": "What will you miss most about South?"}, {"text": "I think I will miss teaching and developing relationships with so many students, including those who never took one of my classes. I will also miss the faculty and staff — so much of my life has been spent in this building and with these wonderful individuals and so many are considered family to me."}, {"text": ""}, {"text": "Reflecting back on your first year at South, how would you compare it to this year?"}, {"text": "This is very difficult to answer because of the pandemic, the Hybrid/Virtual learning situation and the effect they have had on education in general.  This year is very different from my first-year experience but in some ways, it is also similar.  Unlike my first year, this year I had to teach on a computer screen. Unlike my first year teaching Child Growth and Development, I could not give my students the opportunity to operate and participate in a preschool program and unlike my first year with the YTY program, this year the program had to be put on hold. But, similar to my first year, I needed to redesign and recreate learning activities to enhance, augment and reinforce the concepts in the curriculums."}, {"text": ""}, {"text": "Do you have any messages for South students and staff?"}, {"text": "Never let go of that wonderful sense of family – the Pirate Family –  that exists at South.  There is nothing more heartwarming than to know that you are part of a group where the professionals have such passion for what they do and the students have such an intense desire to learn and grow. The love and care for one another just flows throughout the building and I hope and pray that never ends."}, {"text": "Photo courtesy of Dawn Bozian."}], "file_structural_elements": {"title": "Q&A with Ms. Bozian", "date": "June 16, 2021", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "     I interviewed retiring teacher Ms. Dawn Bozian.  In the interview below, she speaks about her years teaching in WWPRSD and how South evolved to be the spirited community it is today. \n    \n     What department were you a part of? What subject did you teach over the years? \n     I’ve been a part", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/Bozian_Dawn-1.png"}}