{"tree_elements": [{"text": "As part of South’s first celebration of Pan-Asian American History Month, the Pirate’s Eye editors-in-chief, Cathy Xiang, Shriya Deshmukh, Ankita Nair and Ishita Jadon, had the opportunity to take part in a student panel and speak with  Dr. Amit Majmudar on May 17.  He joined us via Zoom from Ohio. Dr. Amit Majmudar is a radiologist and a writer and he was Ohio’s first Poet Laureate. During our  Zoom panel discussion, which was open to sophomores at North and South, we spoke to Dr. Majmudar about his life as a physician and writer, his love for literature and negotiating identity labels. The following is an edited version of our panel discussion."}, {"text": ""}, {"text": "What made you want to pursue both medicine and writing? Would you say that your two careers impact one another?"}, {"text": "For me, poetry and literature were the things I loved from a very early age. At the same time, both my parents and my sister were all doctors. It seemed to me that it was a noble profession: I wouldn’t have to debase myself in pursuit of worldly success if I became a doctor. I pursued medicine to facilitate my first love which was literature. I chose to specialize in radiology knowing from the very beginning that I wanted to do two things at once. With radiology you have a shift, you do the shift and the rest of the hours of the day are yours. I also think that my life as a doctor really does impact my work as a writer. Becoming a doctor basically takes your 20s away. It’s so formative and it’s so much a part of my daily life that it finds its way into my writing even when I’m not necessarily dedicating myself to writing about medicine."}, {"text": ""}, {"text": "Since you’ve had a love for literature from a young age, what kinds of literature did you encounter in your early education? What about high school, specifically?"}, {"text": "I did spend some time early on reading a lot of Newbery Award-winning books and I remember my favorite was Johnny Tremain. In elementary school and middle school, I started getting into science fiction, like Issac Asimov. Then I started getting into spy fiction, Ian Flemming’s James Bond novels and a lot of other thrillers that were generally written for grownups–even in high school I was really into those. Then, I blundered into old literature like the “Canterbury Tales” by Chaucer, or Dante’s “Inferno,” or the “Iliad” and the “Odyssey.” I don’t think I necessarily understood it to the full and I certainly didn’t understand it as much as I understand it now, but the good thing about those books is that they reward rereading. I’ve since revisited a lot of those books and I’ve gotten more out of them as someone who is older. But I would never trade those early reading experiences for anything because it really introduced me to the western tradition.  I was also introduced to the Indian tradition and to a bunch of different literary traditions around the world. I was just really really into it."}, {"text": ""}, {"text": "Both in terms of the growing demographic of Asian Americans, especially in our district and in terms of this thread of common humanity that you can find in all stories, do you feel that it’s important for young people to read diverse texts?"}, {"text": "Yeah, absolutely. I think that’s one of the best ways you can understand the humanity of people around you. As you go out into the world you’re going to come across people from all different backgrounds and it’s important for us not to get provincial and open our minds. This holds true both for people engaging with our culture and for us when we engage with other people’s cultures. One of the best ways we can do that is through literature because this is where people tell their stories. This is where people embody their hopes and aspirations, their dreams and their despair, the good and the bad of their stories. And once you really hear someone’s story out, you can never find yourself in a place where you’re feeling alienated from that person, or feeling negativity towards that person. It’s a civic duty in a sense. It’s interesting to meet people through literature – meet writers and also their characters – through literature. Whether that’s your contemporaries from other walks of life and other cultural backgrounds, or whether you’re doing that in time – using literature as a form of time travel to see what people were like here, there, or anywhere. That’s all illuminating and it broadens us and deepens us."}, {"text": ""}, {"text": "Some sophomores may recognize Dr. Majmudar’s poem, “Dothead,” from their LA II Honors class. Readers, follow the link below to the poem on the Poetry Foundation website."}, {"text": "*link to='https://www.poetryfoundation.org/poets/amit-majmudar'*“Dothead” courtesy of the Poetry Foundation.*/link*"}, {"text": ""}, {"text": "Could you talk about your poem?"}, {"text": "There is a mythological reference at the very end that refers to Nataraja, who is a form of Shiva dancing the dance of destruction in a sphere of fire at the end of time. That’s where the poem ends – it begins in a high school cafeteria in the late 1980s. It’s called “Dothead,” which was a racial slur that was referring to the bindi, as I’m sure you all know."}, {"text": ""}, {"text": "How has your upbringing influenced the themes that you’ve written about in your works and specifically in “Dothead”?"}, {"text": "This is probably one of the poems that I’ve written that is most drawn from my personal experience growing up in suburban Ohio. I have this culture and background that is very dear to me and it is a question of how does this get represented in a classroom format when they are talking about all the ways Indians are seen as weird or horrible. Is that really representative of how I lived in that background? There was this disconnect for me where they were supposedly talking about my civilization and my background but it didn’t track to anything I had lived or read. That aspect plays into the poem. There is also an aspect of regret. The narrator starts by saying a measured, deep, poised and controlled thing that he wishes he would have said and that’s how the poem opens–with the narrator wishing he had those words ready. Then, it becomes another fantasy of not being poised and explanatory and trying to deepen the conversation. It becomes aggressive and he invokes the god of destruction. There was this sudden desire to be conciliatory that gives away to not wanting to be conciliatory and wanting to assert one’s heritage."}, {"text": ""}, {"text": "The bindi is a prominent part of your poem. Why did you choose a bindi to represent the culture in this poem?"}, {"text": "There are a couple of reasons. One is because in the 70s and 80s, the racists who invented the slur “dothead,” chose the bindi to represent our culture. In a sense, it’s a response to the bindi being the identifiable marker of otherness. There is also a profound spiritual meaning of the third eye of lord Shiva, who in turn, becomes the god formed at the end of time:  Nataraja the dancer. Nataraja that I mentioned in the final line of the poem is a manifestation of Shiva and Shiva is the one who has the third eye, which relates to the bindi. There is that network of mythology, the history and the personal experience all coming together into one poem or network of associations. I think from the beginning of the poem, it is a matter of “I’m a little bit ashamed of it; I’m going to explain it to you and I don’t want you to think that it is so weird.” By the end of the poem, it becomes the planet Mars, the bringer of war, or the third eye blazing forth aesthetic energy. It becomes something that the narrator is ashamed of a little bit or something he wants to explain away. But then, the narrator becomes proud and fearless."}, {"text": ""}, {"text": "Do you often find that you’re labeled as an immigrant writer? What’s your opinion on labels such as “Asian writer,” “Midwestern writer,” or even “male writer” that authors are often classified as?"}, {"text": "I do feel that I am labeled as that pretty frequently. I think “doctor writer” is another one that I get a lot. It doesn’t bother me much because I know that people are trying to get a handle on a writer. Critics like to do this, book reviewers like to do this, booksellers like to do it, publishers like to do it and readers like to do it. It allows them to mentally classify people and create a broad category, such as, like you said, male writer. That’s a very big category and all sorts of things can fit it. If it gets really reductionistic that can get straightjacket-like where they’re like this is an Indian American doctor writer from the Midwest of Hindu origin. You’re bringing it down to a narrow thing and there’s a lot to me that isn’t going to be covered by that narrow category. I think that if I, as a minority, or as an Indian American, write about certain topics it’ll be perceived to be more authoritative if it directly relates to my identity. I don’t necessarily feel that pressure, but I know that dynamic exists. It exists in people’s heads and it’s not something that I can change. I tend to focus on things I can control, which are the words on the page. All I can do is try and show all those people that label us, who try to reduce us through those labels that there’s more to us than just that particular element and that there’s a lot more to everybody than just any given identity-based element that they apply to us."}, {"text": ""}, {"text": "Can you talk about your writing process?  What are some solutions you have when you have difficulty developing your thoughts?  What about writer’s block?"}, {"text": "My technique is to just sit down and write it. I feel that I don’t have to show my failures to anyone. If something doesn’t work, then no one has to see it. That really frees me up from writer’s block because a lot of it has to do with your internal critic getting the upper hand over your internal creator. I’m in my study, in this exact room, at this exact laptop and I just let her rip. I just get things down and if I have to discard it, I’ll discard it."}, {"text": ""}, {"text": "At the end of our panel discussion, Dr. Majmudar read the poem “Vocative” from his most recent poetry collection, “What He Did in Solitary.”"}, {"text": ""}, {"text": "“Vocative” from “What He Did in Solitary” reprinted with permission from Amit Majmudar"}, {"text": "English is my native"}, {"text": "anguish. I was born here,"}, {"text": "read here, teased and torn here."}, {"text": "Vocative, ablative,"}, {"text": ""}, {"text": "locative, alive:"}, {"text": "English was a dislocation"}, {"text": "navigating oceans."}, {"text": "Wherever it arrived,"}, {"text": ""}, {"text": "it broke and brokered words,"}, {"text": "its little bits of Britain"}, {"text": "pilfered, bartered, written,"}, {"text": "looted, hoarded, heard."}, {"text": ""}, {"text": "Papa swapped a world"}, {"text": "for shiny colored beads,"}, {"text": "for dandelion seeds."}, {"text": "We are subject verbs."}, {"text": ""}, {"text": "The root word of my name"}, {"text": "hooks a foreign land,"}, {"text": "long-since-shifted sand"}, {"text": "books cannot reclaim."}, {"text": ""}, {"text": "Graft of tongue, gift of dust,"}, {"text": "mother and stranger, sing"}, {"text": "the kedgeree, the everything"}, {"text": "at once you’ve made of us."}, {"text": ""}, {"text": "Image by Ishita Jadon."}], "file_structural_elements": {"title": "Q&A with Dr. Amit Majmudar", "date": "June 16, 2021", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}, "ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}, "bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}, "5ZZyMhdJyIdn45SwdcwV": {"name": "Catherine Xiang", "year": "2020"}}, "description": "As part of South’s first celebration of Pan-Asian American History Month, the Pirate’s Eye editors-in-chief, Cathy Xiang, Shriya Deshmukh, Ankita Nair and Ishita Jadon, had the opportunity to take part in a student panel and speak with  Dr. Amit Majmudar on May 17.  He joined us via Zoom from Ohio. ", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/D60EA9CB-1B4C-44F3-9228-2FAD0B7F2A0D-900x506.png"}}