{"tree_elements": [{"text": "Ms. Audrey Rothbloom retired on May 14, 2021, carrying with her almost 35 years of memories full of vibrant yellows and greens, a Pirate spirit and many classroom tidbits. She reflects on her years at South below."}, {"text": ""}, {"text": "What department were you a part of? What subject did you teach over the years?"}, {"text": "I am part of the Special Service Department and I also work with the Social Studies Department. At one point, I have taught LA and math classes but basically American Studies I and II classes."}, {"text": ""}, {"text": "When did you first become a part of the South community? What were your first impressions?"}, {"text": "I joined South in 1987 when I took over for maternity leave. My first impression was that I was in heaven because I had just left a New York City public school that had no air conditioning, exposed ceilings, no elevators and a classroom where the room was divided by a shower curtain."}, {"text": ""}, {"text": "What are some of your happiest memories at South — something you will look back at and smile?"}, {"text": "My happiest memories at South are teaching the kids (in-person) and working with my colleagues. I also loved the vibe and spirit of South– the Spirit Weeks, charity drives, talent shows and the amazing staff and students."}, {"text": ""}, {"text": "What will you miss most about South?"}, {"text": "The real question is what won’t I miss. I will miss the people of South the most because everyone has become woven in my memories and represent so much care and love for me."}, {"text": ""}, {"text": "Is there something you have learned from your experience at South that you would like to share?"}, {"text": "I have learned that, especially during these pandemic times, how my colleagues especially have risen to the challenges and how blessed I have been to work with such a dedicated group of people who strive to check in on each other, who tapped into their creative selves to make teaching fun and personal. They have also tried to recreate, as best as they could, the South experience for all and I have been blessed to know them. I have also learned/knew that the students also rose to the challenge, tried to engage their classmates and did the best they could to adapt."}, {"text": ""}, {"text": "Reflecting back on your first year at South, how would you compare it to this year?"}, {"text": "Wow, that is going back 34 years. The school was the only high school in the district and the 500 area was composed of trailers. The school had 7th-12th grades. The township was primarily an agrarian one and coming from NY, I had to get used to the open space concept."}, {"text": ""}, {"text": "Were there any South activities that you liked partaking in? What hopes do you have for them?"}, {"text": "Spirit Week, watching the kids at prom, walking at graduation and saying goodbye to my students, the teacher potluck luncheons, Washington Seminar, Gettysburg and Constitutional Center trips, everything. My first hope is that the South traditions will continue and South will continue to participate in those diversity/equity discussions. My second hope is that Fall 2021 will be a return to the school we all know and love, with everyone back. My final hope is that although South will be even bigger, that it maintains that personal touch with each and every person."}, {"text": ""}, {"text": "Do you have any messages for South students and staff?"}, {"text": "I will miss them all but I will NOT miss Zooming! Much love to all and congratulations to all the Seniors!"}], "file_structural_elements": {"title": "Q&A with Ms. Rothbloom", "date": "June 16, 2021", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "     Ms. Audrey Rothbloom retired on May 14, 2021, carrying with her almost 35 years of memories full of vibrant yellows and greens, a Pirate spirit and many classroom tidbits. She reflects on her years at South below.   \n   \n     What department were you a part of? What subject did you teach over t", "image": null}}