{"tree_elements": [{"text": "Sophomore Asmita Sharma wrote a book of poems called “Wild,” in October during quarantine. It was self-published by Kindle Direct Publishing on Feb. 21, 2021 and available through Amazon. I interviewed her through Zoom to learn more about her journey to publishing a book as a high school student."}, {"text": ""}, {"text": "Why did you choose to write “Wild” in a poem format?"}, {"text": "Poetry was my first experience with creative writing. I started writing poetry when I was ten and it really appealed to me. When I was in fourth grade, there was a contest called “Creative Communications.” You write a poem and if they like it, they’ll publish it in a quarterly poem booklet/magazine. My poems were published four times from 2015 to 2017, and that really encouraged me to continue writing."}, {"text": "I thought it fit that my first book would be a book of poems because that’s where my whole writing journey started."}, {"text": ""}, {"text": "What was the inspiration for writing “Wild”?"}, {"text": "I was listening to an album called “Folklore” by Taylor Swift and the lyricism in those songs reminded me of poetry. The music I was listening to had vivid descriptions, similes and metaphors, which probably subconsciously influenced what I was writing."}, {"text": ""}, {"text": "What was the process like for getting your book published? Were there any struggles because you’re a high schooler?"}, {"text": "Usually, to publish a book, you’d get a literary agent who would send your book to publishers. I didn’t do that because there isn’t really a market for poetry books, alongside the fact that I was 15 when I published it, so I didn’t think I had a good chance of getting it out into the world. Instead, I decided to self-publish. I sent it to Amazon and they vetted it. They went through it and flagged anything that they wanted you to change. You make those changes and Amazon publishes the work."}, {"text": "If another high school student writes a realistic fiction book for young adults, I would recommend getting a traditional publisher. They’re better at marketing and cover designs. They can give much more advice because they know the market and you’ll probably get more books sold. However, I think self-publishing was a lot smoother for me than going the traditional route."}, {"text": ""}, {"text": "Which poems in your book do you like the most?"}, {"text": "I like the first one called “Her.” Another one I like is “My Mind” because it’s the only poem in the book inspired by another poet — Emily Dickinson. I wrote the entire poem the way she would write. I was watching a TV show (“Dickinson”)  about her and she lived alone for 20 years in her house, all locked up and wrote poetry and I thought she was probably in her head a lot, so I wrote “My Mind” about her."}, {"text": "I wrote 200 poems, and then I narrowed it down to 66. There were a lot of them that are just sitting around, unseen by anyone else. They just didn’t fit. Maybe in the future, if I write another book, they’ll fit in there."}, {"text": ""}, {"text": "Why was the book titled “Wild”?"}, {"text": "Here’s the story. I had another title planned. I had a book cover and everything planned out and then the day before we were supposed to send it in, I completely deleted it. I made a new cover and created a new title called “Wild” because I really liked the word “wild.” The other title that I had didn’t feel right and it was more of an instinct I had."}, {"text": "Previously, I had an idea of splitting the poems up into chapters, which would be streets in a town where people lived. The book would be called “Crazy Town” and the first chapter was Heather Avenue. There’s a song called “Heather” by Conan Gray and it’s about how he doesn’t want to be himself, so all the poems about wanting to be someone else are in that chapter. I would describe it as though those people live on that street. It’s a little confusing, which is why I got rid of it."}, {"text": ""}, {"text": "When your readers read your book, what do you want them to take away?"}, {"text": "When you read it, you can take a step back from your life and look within yourself by reading deep stories about other people. I wanted people to read it and imagine anyone so they can relate to it. I didn’t add specific names because labeling each person takes away the imagination that the reader uses. I just want them to be able to reflect and connect, somehow, somewhere at least with one poem."}, {"text": "I wrote it for people our age because there’s a lot of poems about identity and everyone is figuring out who they are, so it’s definitely directed towards high schoolers."}, {"text": ""}, {"text": "*link to='https://www.amazon.com/dp/B08X4WN5H6/ref=mp_s_a_1_3_nodl?dchild=1&keywords=wild+asmita+sharma&qid=1614032274&sr=8-3'*https://www.amazon.com/dp/B08X4WN5H6/ref=mp_s_a_1_3_nodl?dchild=1&keywords=wild+asmita+sharma&qid=1614032274&sr=8-3*/link*"}, {"text": ""}, {"text": "PHOTO COURTESY OF ASMITA SHARMA"}, {"text": "The poem “Her” is about improving oneself to be the best version. “My Mind” compares the mind to someone running through a succession of dark rooms. “The Century-Long Flood” describes worries that come slowly and seem to last forever. “Fool’s Gold” is about how people pursuing STEM professions seek high status but only end up with “fool’s gold.”"}, {"text": ""}], "file_structural_elements": {"title": "Q&A on “Wild” by Asmita Sharma", "date": "June 4, 2021", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     Sophomore Asmita Sharma wrote a book of poems called “Wild,” in October during quarantine. It was self-published by Kindle Direct Publishing on Feb. 21, 2021 and available through Amazon. I interviewed her through Zoom to learn more about her journey to publishing a book as a high school studen", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/Screen-Shot-2021-06-04-at-6.27.54-PM-900x653.png"}}