{"tree_elements": [{"text": ""}, {"text": "With his fame and fortune virtually gone and his reputation shattered, R Kelly quickly went from a top R&B singer to an alleged sexual abuse offender."}, {"text": "After the release of the Lifetime Documentary “Surviving R Kelly,” the once beloved “I Believe I Can Fly” singer has now become the face of one of the most controversial sexual abuse cases with 10 counts of aggravated criminal sexual abuse charges, three of them involving underage girls. While some fans have chosen to stand by the singer’s side, opinions are slowly turning against Kelly as more and more people begin to question his alleged actions."}, {"text": "At what many believe to be the height of his fame, the allegations that would alter his life forever began. In 1994, rumors surfaced that Kelly married 15-year-old R&B singer Aaliyah when he was 27. In order to complete the marriage process, marriage papers were forged, claiming that Aaliyah was 18 years of age. Whenever interviewed together during their marriage, Aaliyah and Kelly claimed that the rumors were false and that they were just close friends."}, {"text": "It was recently confirmed, however, by Kelly’s current lawyer Steven Greenberg that the marriage was in fact real, but Kelly had no knowledge of Aaliyah’s true age. In a recent interview on ABC News, Greenberg said, “My understanding is that she did not claim to be 15 and, in order to get married, she had to lie about her age.”  He reiterated that Kelly had no idea about her actual age."}, {"text": "After their marriage ended in 1995 and the controversy over the pair died down, Kelly quickly moved on and married 22-year-old dancer Andrea Lee and went on to have three children with her before their divorce."}, {"text": "It wasn’t until 2002 that the controversy over R. Kelly started up again. At this time, a tape was anonymously released allegedly showing Kelly having sexual relations with a minor. Soon after the release of this tape, Kelly was charged with 21 counts of child pornography. After getting out on bail, just seven months later, Kelly was arrested again for 12 additional counts of the same charge. The case was dropped, when a Florida judge threw the case out, claiming that the photos were obtained illegally from Kelly’s home."}, {"text": "Despite all of these allegations and trials, Kelly’s stardom remained steady when he continued to receive music awards such as numerous Grammys, topping Billboard Music lists and a nomination for the  NAACP Image Award. Not only did people still see Kelly as a beloved musician, but his trial was constantly pushed back due to excuses that many felt were “invalid.” The trial that was supposed to take place in 2002 but did not take place until 2008 – six years after he was charged. In the end, Kelly was found not guilty."}, {"text": "After the verdict, fans forgave and forgot all of the allegations against Kelly.That is until 2017 when three parents came out to the media and claimed that Kelly was holding their daughters hostage in a “cult”-like environment. This again opened the public’s eyes to the questionable actions of the singer, but this time critics, even fans, could not turn their backs on what was going on in plain sight."}, {"text": "Senior Fatima Mumtaz reflected on when she found out about the allegations against Kelly. “I had a feeling of disgust and anger that I couldn’t shake off,” Mumtaz said."}, {"text": "Soon after these parents came out begging for the return of their daughters, protests began throughout the country. Thousands of people called for venues and festivals to cancel any shows that R. Kelly would be performing in. Slowly, venues began listening."}, {"text": "The Pitchfork Music Festival in Chicago, apologized to the public for allowing Kelly to perform at their event in 2013 and decided to partner with Rape, Abuse & Incest National Network to raise awareness against sexual violence to make their statement loud and clear. Eventually, Spotify even removed the singer’s music from its playlists and instituted a new policy that condones hateful conduct."}, {"text": "It only got worse for Kelly when, in 2018, Faith Rodgers filed a lawsuit against the singer for knowingly giving her herpes and for abusing her by locking her in a room as punishment throughout their relationship. Following this charge, Kelly finally decided to address all of these allegations coming out against him through the release of a 19-minute song titled “I Admit.” In the song, he denied any allegation against him."}, {"text": "Finally, the entirety of the hidden story of Kelly’s long alleged history of abuse came to light when in 2018, the Lifetime documentary “Surviving R. Kelly” came out in a six part series. The Lifetime documentary featured interviews with various women who had been a part of Kelly’s alleged “sex cult” and various parents whose children are still allegedly trapped in Kelly’s homes. Kelly has denied all allegations made in the documentary."}, {"text": "The series primarily contained stories from past victims, current victim’s parents, famous public figures and psychologists. Primarily African-American victims told their stories of having sexual relations with him, often underage, and revealed information about their experiences of being trapped in his various homes and recording studios with other girls at the same time."}, {"text": "Kelly’s ex-wife Andrea Lee was also interviewed and told her horrific stories of things she was forced to do throughout their marriage. In some instances, she would only be allowed to perform necessary life-sustaining tasks like getting food or going to the bathroom when she asked Kelly if she could leave the bedroom."}, {"text": "Parents of current victims told their stories of trying to get their children back from Kelly by attempting to enter the places he kept their children and being escorted out by security guards. The documentary series opened the world’s eyes to a situation that had been ignored for decades."}, {"text": "In addition to interviews with victims and their families, the producers interviewed John Legend, Tarana Burke (one of the founders of the #MeToo movement), and various psychologists that worked to explain how Kelly lured his victims."}, {"text": "After watching the documentary, Mumtaz said, “I couldn’t believe what I had just watched. It just amazed me that we forgive these disgusting artists for inhumane things just because we like their music or think they’re above the average person.”"}, {"text": "The effects of Kelly’s alleged actions are starting to come to light after the release of the documentary. Kelly was dropped by Sony music and he was recently charged with 10 counts of aggravated criminal sexual abuse that took place over a decade. On Feb. 22, Kelly was arrested and his bail was set for one million dollars. Kelly has pleaded not guilty to all of the charges against him."}, {"text": "As the trial for Kelly continues to unfold, the world awaits to see if he will be held accountable for his actions."}], "file_structural_elements": {"title": "R. Kelly faces loss of support, jail time after several sexual abuse allegations", "date": "March 28, 2019", "writer": {"vcRNXdDaPStd2IWpBNRh": {"name": "Alexa Bornstein", "year": "2018"}}, "description": " \n     With his fame and fortune virtually gone and his reputation shattered, R Kelly quickly went from a top R&B singer to an alleged sexual abuse offender. \n     After the release of the Lifetime Documentary “Surviving R Kelly,” the once beloved “I Believe I Can Fly” singer has now become the face", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/R-Kelly-Image.jpg"}}