{"tree_elements": [{"text": "South jumped into May with our first Pan-Asian American History Month, a celebration of the Asian American experience."}, {"text": "The May celebration is tied to a national one which started in 1976 with  Jeanie Jew, a Capitol Hill staffer. According to the Asian Pacific American Heritage Month website, Jew noticed a lack of recognition of Asian American and Pacific Islander history and approached Representative Frank Horton. Rep. Horton, from New York, drafted a resolution, which took two tries to pass but was eventually recognized by the House, Senate and President Jimmy Carter. The resolution proclaimed that the 10 days following May 4 would be reserved for all Americans to celebrate Asian American and Pacific Islander history. Later, in 1992, Congress declared an annual month-long celebration of Asian American and Pacific Islander history."}, {"text": "May was chosen because in May 1868, the first Japanese immigrants came to the United States. May is also the month when Chinese workers finished building the First Transcontinental Railroad."}, {"text": "The district event was catalyzed by Language Arts teacher Sima Kumar who was initially working on a different project. She moved her project to May and it evolved into Pan-Asian American History Month (PAAHM). Other district members that comprised the PAAHM committee were Jessica Wong, North Language Arts teacher; Anthony Jones, Coordinator for Diversity, Equity and Inclusion; North Language Arts teacher Venkat Ramaprasad; North and South Chinese language teacher Susan Hseuh; and North and South Media Center Specialist Kathryn Carroll. Other advisors were Michelle Liu and Bryce Mayor."}, {"text": "Student leaders who led the month’s celebration were Jeremy Hui, Graceylnn Lu, Eric Yu, Megan Lee, Nona Saharan, Alexander Chang, Anoushka Aswin, Bessie Lyu, Devanshi Chaudari, Smriti Ganesh, Rakiya Hassan and Madoka Kondo."}, {"text": "Nationally, May is known as Asian/Pacific American Heritage Month, or AAPI, but the committee members decided that “Pan-Asian American History Month” was more fitting for our district."}, {"text": "“We understand that the name Asian American Pacific Islander was a name given by the government,”  said Ms. Jessica Wong, one of the main committee organizers who spearheaded speaker invitations and galvanized student participation for the month’s celebration. “The term ‘heritage,’ too. I don’t know why it’s heritage and not history. There’s a lot of connotations that come with the word heritage. It makes us more ‘other’ than part of American history– it’s used to separate us.”"}, {"text": "Junior Jeremy Hui, a student leader for the event said, “We’re definitely trying to focus more on history than just a cultural celebration. We’re trying to focus on how, specifically, Asian Americans, throughout the 400 years of history, were being positioned in American society.”"}, {"text": "Ms. Wong said that the month focused more on the continent of Asia rather than the Pacific Islands. She stated that there were certain differences when it came to the Asian experience versus a Pacific Island one. “It’s basically a diasporic history versus a colonized history. So, we were trying to come up with a name that was most accurate to the history that we wanted to address this month. ”"}, {"text": "Gracelynn Lu, a sophmore from North, who was one of the student leaders, talked about these different experiences. “So, the Pacific Islander Part of the AAPI mainly refers to a different experience compared to the Asian diaspora that we want to talk about. The Pacific Islanders have a more convoluted history with American colonialism and imperialism, which isn’t necessarily the case for a lot of the other Asian countries that we wanted to focus on.”"}, {"text": "Ms. Audrey Rothbloom, a special services teacher who retired this year after 35 years at South, reflected on this history and the school community. “We need to acknowledge and recognize the different groups that make up the WW-P population,” she said."}, {"text": "Ms. Rothbloom added, “When I first started in the district in 1986 or so, there wasn’t a multicultural history class. So I think when you go back and dive into history until today, how far have we come? We’re making inroads.”"}, {"text": "One event which helped make inroads in recognizing Asian American experiences in our district is the Pan-Asian American Literature Read-In, a project where volunteers read works of Asian American authors and poets."}, {"text": "“I’ve been working with the students to curate these readings into a Google Slides presentation that will be shared with HSN and HSS Language Arts teachers and their classes during the month of May,” said Ms. Carroll, who curated the event with assistance from Language Arts teacher Ms. Kumar."}, {"text": "Ms. Carroll said that she hoped that the Read-In would help spotlight Asian American stories and writers. She said, “The Read-In provides a way for students to see themselves in literature and reflect on the experiences of others.”"}, {"text": "Throughout the month, guest speakers explored a range of topics from personal experiences to Asian American history that is often left out of American history classes to anti-Asian racism. The many speakers who visited the event via Zoom included Ruth Chan, an author and illustrator of picture books such as “Thank You, Neighbor”; Amit Majmudar, a radiologist and poet of books such as “Partitions,” “Dothead Poems,” and his most recent collection “What He Did in Solitary”; and Richard On, the lead guitarist of the rock band O.A.R. Other guests included Barbara Yasui, an educator from  Densho: The Japanese American Legacy Project; and the hosts from The Woke Desi Podcast Anika Sharma and Nehal Tenany."}, {"text": "The Asian American community sometimes gets forgotten in the larger American society due to issues such as the model minority myth, said Ms. Rothbloom."}, {"text": "Reflecting on the recent rise in anti-Asian racism in our country, Ms. Rothbloom said, “If you want to combat hate, you have to do that through education.”"}], "file_structural_elements": {"title": "Reflecting on Pan-Asian History month", "date": "June 17, 2021", "writer": {"71hhF0oQr1LLxWE03E35": {"name": "Sidd Shetty", "year": "2021"}}, "description": "    South jumped into May with our first Pan-Asian American History Month, a celebration of the Asian American experience. \n     The May celebration is tied to a national one which started in 1976 with  Jeanie Jew, a Capitol Hill staffer. According to the Asian Pacific American Heritage Month websit", "image": null}}