{"tree_elements": [{"text": "“With tables and chairs six feet apart from each other, all employees wearing masks and disposable menus,” said senior Lina Deleger, a hostess at On the Border located in Marketfair mall, “we can ensure that everyone who comes to sit inside the restaurant has a safe and healthy experience.” On June 15, restaurants only allowed outdoor seating and takeout for their customers. As of Sept. 4, restaurants in New Jersey are permitted to seat customers inside the building."}, {"text": "With these indoor seating accommodations, extra safety precautions are taken by both the employees of the restaurant and its customers. According to NJ.com, employees must wear masks, ensure all tables are six feet apart and only allow 25 percent capacity to be inside the building to avoid overcrowding. Customers, on the other hand, must wear masks until they are seated, can only be seated with seven other people (eight people permitted at each table) and are encouraged to use either digital or disposable menus. Deleger said, “To keep everyone safe, we have plexiglass set up in between all of the booths, we clean the tables and our hands regularly and enforce social distancing protocol”."}, {"text": "According to the Center for Disease Control (CDC), restaurants with indoor seating are at the highest risk for spreading Covid-19 due to the lack of air circulation when the doors are closed.  However, restaurants with solely outdoor seating, drive-thru, delivery and takeout are at low risk of spreading Covid-19."}, {"text": "To address the issue of air circulation, senior Mia Fremder, a hostess at On the Border said, “ At the restaurant, we have the outdoor patio which is obviously air circulated. For indoors, before every shift, the general manager makes sure that all windows are open and all vents are operating properly.”"}, {"text": "Though fellow employees at South think their restaurants are staying safe from Covid-19, some students may not know about these safety measures."}, {"text": "I conducted a survey for South students and asked their opinions on indoor seating. 52.9 percent of students said that indoor seating is unsafe and the other 47.1 percent of students think indoor seating is safe."}, {"text": "Furthermore, outdoor seating arrangements not only give the customers a glimpse of normalcy but it also positively impacts the restaurant’s business."}, {"text": "Senior Mark Sheffield, an employee at Thomas Sweet in West Windsor said, “ As of now, we only have outdoor seating and takeout; customers prefer to sit inside rather than having to bring their food home. I wish we had indoor seating because it helps restaurants get more business”"}, {"text": "According to ABC News, more than 100,000 restaurants have closed in the last six months of the pandemic. Out of all retail businesses such as shopping/retail, beauty/spa, bars/nightlife and fitness, restaurants had suffered the most, containing the highest amounts of permanent closures. Not only is it important to get out and have a nice cooked meal, but it’s also crucial to support our local businesses during these difficult times."}, {"text": "“I understand why some people think that sitting indoors at restaurants is bad, but we give it our all to keep our customers safe and healthy,” said Fremder. “I encourage people to come and support all restaurants in West Windsor, Plainsboro (WWP) so they can continue to stay open at times like these.”"}], "file_structural_elements": {"title": "Restaurants during COVID-19", "date": "November 16, 2020", "writer": {"t1wNGC5vCu2m5zKSZgLI": {"name": "Sophia Englezos", "year": "2020"}}, "description": "    “With tables and chairs six feet apart from each other, all employees wearing masks and disposable menus,” said senior Lina Deleger, a hostess at On the Border located in Marketfair mall, “we can ensure that everyone who comes to sit inside the restaurant has a safe and healthy experience.” On J", "image": "https://thepirateseye.org/wp-content/uploads/2020/11/Indoor-seating-.png"}}