{"tree_elements": [{"text": "As the lights dimmed, curtains opened, and music played, students jubilantly walked to center stage with beaming smiles. After two years of virtual celebrations, on Friday, April 11, 2022, the South theater doors finally opened, welcoming guests and performers for the annual South Asian American Student Association (SAASA) show."}, {"text": "SAASA, a student-run club. is responsible for putting on performance that showcases South Asian culture through a series of acapella performances, dance performances and a play. South Asia consists of cultures from countries such as India, Pakistan, Bangladesh, Sri Lanka, Nepal, and Bhutan. One of South’s largest clubs,"}, {"text": ""}, {"text": "with over 100 members, SAASA brings together South Asian American students, teachers and all who appreciate South Asian culture."}, {"text": "Junior class dance choreographer Aru Kakar said, “The event brings a sense of culture that is a representation for South Asians–or anyone who likes Bollywood music.”"}, {"text": "Being able to see teachers and friends both off and on stage appreciating a culture that is widely represented at South brings together our community. Freshman class dance choreographer Tvisha Srikanth said, “South is very heavy on Indian culture so it’s important to have a club that’s inclusive to it so we can embrace it.”"}, {"text": "Teachers and students from cultures outside of the South Asian region took part in the show."}, {"text": "“I love learning more about other cultures, and I learn better by participating,” said guidance counselor Cheryl Smith. “I really loved it!”"}, {"text": "The teacher dance was a memorable experience for both the teachers and students. Dr. Meenakshi Bhattacharya, Ms. Cathy Reilly and Mr. Joe Porter were some staff members who made this a community event with their special cameo. appearances."}, {"text": "SAASA teacher advisor Rose Leonard, said, “Kids love having their teacher up there dancing and being involved.”"}, {"text": "A secondary function of shows like SAASA is to educate and expose members of our community to a culture they may not be familiar with. Freshman Sania Manyem said, “Even if you don’t understand the culture, you’re still able to participate and learn more about it.”"}, {"text": "Students celebrated their regional heritage through dance styles specific to that area. Below is a map of India showing where in India the dances performed at SAASA show originated."}, {"text": "Bhangra"}, {"text": ""}, {"text": "Dressed in the traditional costume of bright green kurtas (long shirt), pink tugis (waistcoat without buttons) and dark blue salwars (loosely fitted pants), South dancers appeared on stage with their joyful attitude to perform bhangra. Bhangra is an energetic folk dance originating from Punjab and has been seen in historical records since the late 1800s, but the roots of bhangra can be traced back to before the term existed. At South, dancers performed on a mix of traditional bhangra music which is beats from various types of dhols (drums) wih short sets of lyrics describing stories from Punjab and the famous Latin Urbano song “Mia” by Bad Bunny."}, {"text": ""}, {"text": "Kathak"}, {"text": "Kathak is a North Indian classical dance form that originated in 400 BCE. Dancers at South performed a fusion of American and Indian songs including “Kiss From A Rose” by Seal and “Mitwa” by Shafqat Amanat Ali. South Kathak dancers were elegantly draped in a traditional lehenga (a short blouse and long skirt) with a dupatta (scarf) pinned on top. As one of the opening dances, Kathak dancers set the mood of the show through their precise movements and expressions capturing the audience’s attention."}, {"text": ""}, {"text": "Raas"}, {"text": ""}, {"text": "Raas is a traditional folk dance that originated in Gujarat and is a popular dance performed in many events. Raas dancers twirl wooden sticks called dandiyas and focus on form, formation, and energy. Dandiya Raas is one of the forms of the dance style Garba, which is performed for the goddess Durga. South Raas dancers wore bright orange and yellow blouses and skirts which sparkled in the spotlight."}, {"text": ""}, {"text": "Bharatnatyam"}, {"text": ""}, {"text": "Bharatanatyam is one of the oldest classical dances in South India, originating in the state of Tamil Nadu. This dance is usually accompanied by classical Tamil songs, but at South the dancers performed with Hindi songs. This dance requires skill, precision, strength, and discipline. In the performance, South dancers wore traditional bharatanatyam dress. Dancing to a fusion of both Indian and English songs, they moved to songs “Ghar More Pardesiyan” by Shreya Goshal and Vaishali Mhade and “Woman” by Doja Cat."}], "file_structural_elements": {"title": "SAASA: Celebration of culture", "date": "June 24, 2022", "writer": {"ZSFFpdQWjszDdCIoro8x": {"name": "Sana Manchanda", "year": "2021"}, "TtzLeEsqVllY4uMU8Zl6": {"name": "Manika Niwas", "year": "2022"}}, "description": "As the lights dimmed, curtains opened, and music played, students jubilantly walked to center stage with beaming smiles. After two years of virtual celebrations, on Friday, April 11, 2022, the South theater doors finally opened, welcoming guests and performers for the annual South Asian American Stu", "image": null}}