{"tree_elements": [{"text": "Before quarantine, you’ll remember security aide Jim Carvalho, with his tall stature and confident stance, alert and observant, welcoming people into the building."}, {"text": "“From the outside I know he looks tough,” said senior Abhinav Pandey, “but when you start talking to him you realize he’s a very sweet person.”"}, {"text": "Jim attended Trenton State College, now known as The College of New Jersey, where he played football. He graduated as an Industrial Arts major with a teaching degree. He said, “I loved being in the classroom and making a difference.”"}, {"text": "After teaching Industrial Arts for a few years, including woodshop and other vocational subjects, Jim decided he was ready for a change. With the help of his friends and an ad in the local newspaper, he decided to apply to be a police officer in West Windsor. “I didn’t even know where West Windsor was at the time,” he recalled."}, {"text": "Jim’s first experience at South was in 1983, when he took the written portion of the initial police entrance exam in the playhouse. Though the town was unfamiliar to him then, it would eventually become like a second home."}, {"text": "He worked as a police officer for eight years before being assigned to the Detective Bureau. “When I was a detective, I liked the hunt to get to the truth and find justice for people,” he said."}, {"text": "After 13 years as a detective, Jim was promoted to the rank of Sergeant (someone who supervises others in the police force), a position he held for five years before retiring in 2009. Despite the demanding nature of his job, he says that he would do it again in a heartbeat."}, {"text": "“But after 26 years, it was time to move on, and that’s when I came [to work at South],” he added."}, {"text": "Jim has been working at South as a security aide for 11 years. Although his job title suggests that his responsibilities are limited to watching the school entrance and taking occasional rounds through the hallways, he does much more. He said, “I make myself available to everybody for anything.”"}, {"text": "Pandey said, “I met him a few times in ninth grade, and slowly we built up this connection and a friendship. I’m an attendance aide and sometimes if I get bored he’ll walk with me to whichever room I’m delivering the pass to and we’ll have a discussion in the hallway.”"}, {"text": "Jim draws from his experiences as a police officer to protect staff and students. He prides himself in his communication skills, which is something he believes “you develop throughout the course of your life.”"}, {"text": "Even during quarantine, Jim goes to South every day to ensure that the building is secure. He said, “I still get up every day and come here to work except there are no students and staff in the building.”"}, {"text": "When art and photography teacher Nathan Leventhal first met Jim, he recalled, “He struck me as someone solid, with a lot of experience, who cared less about the differences in people than our commonalities.”"}, {"text": "As a member of the South community, Jim has gotten not only to create lasting relationships with staff and students, but he has also been able to find new hobbies."}, {"text": "He is an avid painter, which he discovered on a Washington Seminar trip six years ago."}, {"text": "While visiting the National Art Gallery, he pointed to one of the paintings and jokingly asked a fellow chaperone, “‘Hey, do you think I could paint something like this?’”"}, {"text": "When he returned, he recreated the painting using a picture from the internet as a guide. He knew he was onto something when people couldn’t believe he made the painting."}, {"text": "After recreating some more pieces from the internet, Jim realized he had a knack for painting. “I had relied on some of my training as an Industrial Arts major where I had taken mechanical drawing classes,” he said."}, {"text": "Now, Jim creates original pieces. He enjoys painting “en plein air,” which is a French term meaning “outside.” Whether it is a landscape or the sunset, he finds beauty in nature."}, {"text": "“Inspiration is all around us if you are an artist,” he said. “I get most of mine when I’m just driving around.” Jim says he does not hesitate to pull over his car and take out his art supplies if he sees something that he feels inclined to paint."}, {"text": "Mr. Leventhal said, “He enjoys making people happy, which is why he often sells his paintings to the people whose land he’s painting, or the people that stop to watch on the canal, or someone who lets him know that it speaks to them.”"}, {"text": "Jim admitted he is his own worst critic, saying, “I couldn’t wrap my head around the fact that someone wants my stuff.” His pieces have received rave reviews and he continues to create new ones whenever inspiration strikes. While quarantine has put a temporary pause on Jim’s painting, he hopes to continue over the summer."}, {"text": "Jim’s life trajectory  from a high-stress job as a police officer to a previously dormant passion of painting is unusual. “Don’t ever think that you can never be something in life,” he said. “If you have a goal in mind, if you have a dream, pursue it!”"}, {"text": ""}], "file_structural_elements": {"title": "Security aide Jim Carvalho reveals the painter inside", "date": "June 11, 2020", "writer": {"ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}}, "description": "Before quarantine, you’ll remember security aide Jim Carvalho, with his tall stature and confident stance, alert and observant, welcoming people into the building. \n“From the outside I know he looks tough,” said senior Abhinav Pandey, “but when you start talking to him you realize he’s a very sweet ", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/Screen-Shot-2020-06-11-at-11.11.37-AM-900x681.png"}}