{"tree_elements": [{"text": "Sub-study provides an interesting forum for discussions. Sitting at a table with fellow seniors who have applied, waited, applied, then waited some more to hear back from colleges and universities around the country, we reflected on their college application process."}, {"text": "“It was stressful at the moment,” senior Amisha Tandon said. Tandon began her Common Application essay the summer before the start of senior year. “You should start in the summer as soon as you’re done with your SAT and subject tests.”"}, {"text": "Starting in the summer prevents “juggling all the school work with November deadlines,” Tandon said."}, {"text": "Beginning college application materials before senior year proved to be helpful for senior Sam Hastings who took the SAT her sophomore year. “I took it in my sophomore year in March and the August after that. I think being so fresh out of Algebra II helped me.”"}, {"text": "She continued, explaining the reason for the early start: “Junior year for me was the hardest school year so I didn’t have to worry about test scores as much.”"}, {"text": "Aside from the importance of not procrastinating on college applications, senior Abby Carlson found that it’s important to have an open mind. “If I were to give advice to a junior, I would tell them to apply to a bunch of schools.”  Carlson added that getting in is “honestly luck.” “I know kids that got into really good schools and didn’t even get into schools that were not as good as those ones,” Carlson explained."}, {"text": "It’s also important to keep in mind the motives of each schools admissions process. “You don’t really know what a college is looking for, each college is different and it’s based off other applicants,” Carlson said."}, {"text": "Tandon agreed, advising that students research the colleges the apply to given the academic major they would like to pursue."}, {"text": "The fees should deter students from applying without thorough research.  . “They make you pay 50-75 dollars for each application you submit,” Tandon said. So, take into account “how many students are going to the school, what the professors are like, what the breakdown of the school is, and different activities… to make an informed decision.”"}, {"text": "Hastings stressed the importance of looking into the schools you’d like to go to. “As long as you do your part in looking for things you could be interested in and looking at a wide range of schools…then you’re going to find a place that you’re going to be really happy at.”"}, {"text": "The advice that everyone at the table agreed with was that when rejection comes along, don’t give up on the college application process. At first, Hastings received a disappointing decision, but she said,“I decided to commit to my other school by the time I got my decision back. I wouldn’t say it was not where I was expecting to go or trying to go but it sort of worked out in that I’m in the place that is best for me.”"}, {"text": "Tandon explained how she is happy with the overall result too. “You always end up picking the college that you don’t start out with,” Tandon said. “I thought I was going to end up at Penn State or Drexel but now I’m going to Rutgers and I’m totally happy with that decision.”"}, {"text": "And if a student feels unhappy at the school of their choice, Carlson explained that transfering is always an option. “It’s an option if you’re really unhappy.”"}, {"text": "Now that most seniors have heard back from their colleges and universities, it’s time to look toward the future instead of the past."}, {"text": "“Don’t waste time thinking about everything you could’ve done differently,” Hastings said."}, {"text": "The students and I sitting around the table in sub- study chuckle knowingly."}], "file_structural_elements": {"title": "Seniors reflect on college experience", "date": "May 21, 2019", "writer": {"": {"name": "Jen Clancey", "year": ""}}, "description": "     Sub-study provides an interesting forum for discussions. Sitting at a table with fellow seniors who have applied, waited, applied, then waited some more to hear back from colleges and universities around the country, we reflected on their college application process.    \n “It was stressful at t", "image": null}}