{"tree_elements": [{"text": "Disclaimer: This article contains spoilers for “Shang-Chi and the Legend of the Ten Rings” and “Avengers: Endgame”"}, {"text": "A new era is arriving in the Marvel Cinematic Universe (MCU) with the entrance of Marvel’s first Asian superhero: Shang-Chi."}, {"text": "With the exit of many of Marvel’s iconic characters in “Avengers: Endgame,” the company’s plan for introducing additional superheroes on the big screen began in 2021 with “Shang-Chi and the Legend of the Ten Rings”–an, action-packed, emotionally driven love letter to Marvel fans and members of the Asian community. The movie leaves the complicated history Shang-Chi had since his appearance in 1973 behind and transforms the story into something more exciting and empowering."}, {"text": "“I think that the movie was a great mix of comedy, action, romance and sci-fi,” sophomore Javeria Jamal said. “For me, it shows movement in the right direction. Finally, Marvel is becoming more diverse.”"}, {"text": "The story follows Shang-Chi, a young man who was trained to become an assassin by his father Wenwu, the fierce and immortal leader of the Ten Rings terrorist organization. Thirteen years after escaping the Ten Rings, Shang-Chi is taken back to their base of operations as his father reveals his plan to invade his late wife’s native village, Ta Lo. Wenwu believes his wife is alive and communicating with him through telepathy while held prisoner in her village. In reality, though, those messages are being sent by the Dweller-in-Darkness, an unstoppable, malevolent entity who feeds off of people’s souls."}, {"text": "After Wenwu frees the Dweller-in-Darkness, the monster consumes his soul. Shang-Chi bands together with his sister Xialing and the people of Ta Lo in a fierce battle to defeat the evil entity and put his father’s soul to rest."}, {"text": "Though the film is an action-packed blockbuster like all Marvel films, at its core the film is an organic and emotionally-driven story about Shang-Chi and his relationship with his estranged family, one of the most significant being his father. After the death of Wenwu’s wife, Shang-Chi’s family became fractured because his father distanced himself from his children, rebuilding the Ten Rings’ power and forcing Shang-Chi to undergo traumatic assassin training during his childhood."}, {"text": "Having struggled with this childhood trauma, Shang-Chi longs for reconciliation. Before his father is consumed by the evil entity, he appealed to Wenwu to accept the past, allowing him to accept Shang-Chi as a true son again. The emotional tension between father and son is at the real story in this film, beyond the martial and mystical arts."}, {"text": "Like many MCU movies, the film is filled with humor and many callbacks to previous MCU movies, including cameos from previous characters."}, {"text": "“I like how Katy [Shang-Chi’s friend] actually stepped up,” sophomore Grace Choy said. “She wasn’t just one of the extras, she was actually showing a lot of character development, which is great since a lot of movies slowly forget about side characters.”"}, {"text": "Shang-Chi’s cinematic debut is an empowering representation of Asian people. During his first few comic stories, the character was associated with racial stereotypes as the son of the supervillain Fu Manchu, a racial caricature of Asian people created by novelist Sax Rohmer. Fu Manchu’s image was widely publicized in the 20th century as an embodiment of “yellow peril,” a phrase used to illustrate Asians as a danger to the western world."}, {"text": "In the Marvel film, the father Wenwu is depicted as a man focused on his family rather than on conquering the world. This characterization attempts to correct the racialized representations of the previous century. Given the underrepresentation of Asian characters in the movie industry, American audiences are seeing for the first time a powerful lead character and cast on the big screen playing natural, relatable people and showing us the diversity of our country."}, {"text": "“In this movie, they all represent a small piece of the Asian and Asian-American experience,” Chinese language teacher Vivian Yu said. “It was beyond my expectations, and I was stunned. Each one of them pulled off their character incredibly well. Everybody involved with this movie deserves praise.”"}, {"text": "Chinese customs and language in the movie provide audience members a glimpse into the homes of Chinese Americans. Computer generated imagery, or CGI, used to animate some of the action scenes are aesthetically pleasing and, as expected, the fight scenes feature astounding choreography."}, {"text": "“I​​t was funny, at times relatable, had amazing production and so many cool CGI effects,” sophomore Aura Singh said. “It had some great action, and it also showed a lot of female contribution and female strength.”"}, {"text": "In an industry that has often failed to depict Asian people in a positive light since its origins, “Shang-Chi and the Legend of the Ten Rings” breaks ground in the MCU and the entertainment industry as an appealing action story for all audiences."}, {"text": "IMAGE BY VIVIAN XIE"}], "file_structural_elements": {"title": "Shang-Chi and the art of breaking ground", "date": "December 22, 2021", "writer": {"zvlB1uq0RYxyMvCNpViY": {"name": "Nikhil Kishore", "year": "2021"}, "x0qtq92usjgRms9hU9NA": {"name": "Alexander Chang", "year": "2021"}}, "description": "\nDisclaimer: This article contains spoilers for “Shang-Chi and the Legend of the Ten Rings” and “Avengers: Endgame”\n\n     A new era is arriving in the Marvel Cinematic Universe (MCU) with the entrance of Marvel’s first Asian superhero: Shang-Chi.\nWith the exit of many of Marvel’s iconic characters i", "image": "https://thepirateseye.org/wp-content/uploads/2021/12/IMG_0991-900x900.jpg"}}