{"tree_elements": [{"text": ""}, {"text": "Can a common activity such as shopping have any effect on the brain? Millions of people shop everyday both online and in stores."}, {"text": "It’s important to be a smart shopper. One part of being a smart shopper is understanding the psychological effects that shopping has on the brain. This includes being aware of impulsive buys before you reach for that credit card to saving you from overspending."}, {"text": "Today, online shopping has become second nature for most people. Senior Lily Zhu explained, “I prefer online shopping compared to shopping at a mall just because it’s less tiring.”"}, {"text": "One of the exciting parts of online shopping is waiting for the package, containing everything you ordered with clicks of your finger, outside your door. The anticipation of receiving and opening the package is what releases dopamine in the brain."}, {"text": "“When I get a package in the mail I get really happy because I’ve been looking forward to it,” said junior Abbie Randow. She’s not the only one who enjoys the thrills of online shopping. Amazon, the world’s largest online retailer was projected to make $177 billion in 2017 sales according to Business Insider."}, {"text": "It’s not just online shopping that makes the brain happy. In-store shopping is just as enjoyable. And now that the holiday season is over, the clearance racks are filled with extra items. Zhu said, “because it is such a good deal [she will] feel more encouraged to buy it.”"}, {"text": "According to BBC, buying items on clearance creates an addiction similar to drugs, food or alcohol. This rush of excitement and joy makes it hard to maintain self control."}, {"text": "The items don’t have to be on sale to make the brain feel good. Author and consumer psychologist Kit Yarrow observed that as soon as people decide to buy something, they instantly feel better than before. Because of this, they coined term “retail therapy”, often seen in movies about fashionistas, is actually a way to temporarily feel better in real life."}, {"text": "“I’m sort of surprised it’s a real thing but I guess anything that makes you happy can be considered therapy,” said junior Phoebe Elias."}, {"text": "Not only is it a real thing, but it’s popular too. Marketing research agency TNS Global conducted a study that showed more than half of Americans admit to engaging in “retail therapy.”"}, {"text": "A purchase doesn’t need to be made for the brain to be happy. A person just stepping foot in their favorite store triggers a release of dopamine. According to the brain, making the trip to the store is already an enjoyable experience without any money being spent."}, {"text": "The brain bases the impulse to buy off of previous experience. If someone already owns a brand that they like, they’re more likely to feel positive about the purchase."}, {"text": "Although shopping can be beneficial for the brain, it’s not all positive. Shopping can easily become an addiction. According to compulsive shopper therapist Angela Wurtzel, shoppers begin to think about the shopping experience days before it occurs."}, {"text": "There is also a feeling of regret and guilt after making a purchase."}, {"text": "“When I make a purchase that I later think is unnecessary, I regret it because it’s my money I’m spending,” said Randow."}, {"text": "But some have a method of shopping that reduces impulsive hauls. When Zhu shops she “won’t actually buy things unless there is a big sale.” Then she filters through which items she will get the best deals on for her purchase."}, {"text": "The next time you go shopping, consider how useful the item will be to you, if you are getting a good price, and limit yourself by planning out what you will buy beforehand."}, {"text": ""}, {"text": "IMAGE BY CASSIE WANG"}], "file_structural_elements": {"title": "Shopping and your brain: surprising connection between them", "date": "January 25, 2019", "writer": {"": {"name": "Jen Clancey", "year": ""}}, "description": " \n     Can a common activity such as shopping have any effect on the brain? Millions of people shop everyday both online and in stores. \n     It’s important to be a smart shopper. One part of being a smart shopper is understanding the psychological effects that shopping has on the brain. This includ", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/Cassie-Wang-Shopping-design-833x900.jpg"}}