{"tree_elements": [{"text": "“Meet me at midnight,” said Taylor Swift during the August MTV Video Music Awards. Swift invited her fans to the release of her 10th studio album, “Mid nights,” on Oct. 21, at 12 a.m. EST. After the release of “Midnights”, three hours later, Swift released a deluxe version of her album named “Midnights (3am Edition),” with seven additional tracks."}, {"text": "Swift, famous for profound lyricism, took the opportunity to explain the struggles she has faced as a woman in the music industry. On her Instagram, Swift wrote that “Midnights” connects “the stories of 13 sleepless nights scattered throughout [her] life.”"}, {"text": "In the opening song of the album, “Lavender Haze”, Swift uncovers the stereotypes about women still present. She sings, “all the 1950s things they want from me” suggests that she feels that society wants her to act “conventionally.” As we’ve learned in American history class, despite working during World War II, in the 50s, women were expected to go back to conforming to gender roles and staying at home to hold families together."}, {"text": "Other lines from “Lavender Haze” like “All they keep asking me is if I’m gonna be your bride ” connect to the old fashioned conventional expectation that a woman must marry in her 20s. Much of Swift’s lyrics are based on her experiences and challenges in life. In “Anti-Hero,” Swift sings about the insecurities that keep her up at night. The line, “Did you hear my covert narcissism I disguise as altruism,” alludes to how Swift is afraid to be open about her body image because she doesn’t want to seem self absorbed. Swift displays altruistic behavior in order to hide her feelings of insecurity. In her 2020 documentary “Miss Americana,” Swift said that “there’s always some standard of beauty you’re not meeting.”"}, {"text": "Many fans are aware of this connection. “I feel like the success of people in the music industry depends on their looks, which isn’t really fair because they should be judged on their talents, not their appearance,” said Anoushka Nataraj (‘25)."}, {"text": "Track five, “You’re On Your Own, Kid,” also discussed the subject of beauty. She sings, “I gave my blood, sweat, and tears for this. I hosted parties and starved my body like I’d be saved by a perfect kiss.” Swift speaks openly about the struggle of fitting the beauty standard after widespread fame. This was also mentioned in her documentary. Swift said, “I saw a picture of me where I feel like I looked like my tummy was too big, or… and that’ll just trigger me to just starve a little bit—just stop eating.” After fame, especially in the music industry, celebrities may feel the need to diet in order to look beautiful. Swift recognized the impact society’s expectations have had on her life and wrote songs with the goal of destigmatizing a topic that affects people all over the world."}, {"text": "“It’s sad to see, but Taylor brings up a topic which needs to be talked about, especially in the industry she is in,” said Ishika Malaviya (‘24). “I love that she was able to do that through her music, and I know that she has helped so many fans across the world by being so open.”"}], "file_structural_elements": {"title": "Singing back to the patriarchy: Taylor Swift’s “Midnights”", "date": "January 6, 2023", "writer": {"": {"name": "Ishani Konar and Manika Niwas", "year": ""}}, "description": " “Meet me at midnight,” said Taylor Swift during the August MTV Video Music Awards. Swift invited her fans to the release of her 10th studio album, “Mid nights,” on Oct. 21, at 12 a.m. EST. After the release of “Midnights”, three hours later, Swift released a deluxe version of her album named “Midni", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/Taylor.midnights-album-cover-1-900x845.jpeg"}}