{"tree_elements": [{"text": "Because May is Pan Asian American Heritage Month, Lunar New Year, the most important holiday for many Asian countries, deserves to be highlighted."}, {"text": "“It’s like a second Christmas,” said sophomore Amy Xu. Lunar New Year is a time for celebration, family and good food."}, {"text": "Lunar New Year, following the Lunar calendar, typically falls between the end of January and the beginning of February. This year, the holiday was on Feb.12, marking the end of the Year of the Rat and the beginning of the Year of the Ox, a year known for hard work, luck and fortune."}, {"text": "Lunar New Year is celebrated in China, Taiwan and Southeast Asian countries with large Chinese populations, like Singapore and Malaysia. In other countries, Lunar New Year takes a different name. In Korea, it is called Seollal; in Vietnam, Tet; in Tibet, Losar. About 1.5 billion people around the world celebrate this holiday."}, {"text": "The origins of this celebration are rooted in a story where a wild beast, Nian, which is also the Mandarin word for “year,” appeared at the end of each year, attacking and killing villagers. Loud noises and bright lights scared the beast away, translating to the modern tradition of setting firecrackers. Other activities include watching dragon and lion dances, cooking traditional meals and presenting red envelopes stuffed with money out to children, symbolizing good luck."}, {"text": "This pandemic year,the celebration wasn’t the same for most: “I went to a close friend’s house, with social distancing, of course, and this year, Lunar New Year looked and felt completely different than it had previous years,” said freshman Eliana Du. “It still bore some semblance of a celebration, but with COVID-19 restrictions, the joy that was so prevalent just a year before was nowhere to be found.”"}, {"text": "Sophomore Yuhan Wang said, “This is the only year that my dad didn’t come for Chinese New Year because of COVID-19.”"}, {"text": "At South, Lunar New Year is also a vital part of the Chinese classroom curriculum, for Chinese teachers Vivian Yu and Suey Lain Pei."}, {"text": "“I celebrated Lunar New Year with my students by giving out lucky red envelopes and teaching students how to make paper decorations,” Ms. Pei said. “We also watched videos about the zodiac signs and dragon dances.”"}, {"text": "Due to virtual instruction, Ms.Yu was unable to celebrate many Lunar New Year activities with students. Instead, she taught a lesson about the different auspicious foods that are eaten. She said, “Students found many similarities between Lunar New Year traditions and other cultural celebrations like Nocheviejo, Christmas, Eid, and Diwali!”"}, {"text": "Ms. Yu found these connections important. “For my students, the current unit is about communicating with love, and Lunar New Year’s traditions perfectly illustrate familial love– Chinese people express love by cooking and cooking.” Ms.Yu’s family would start a month in advance. “My mom, as a busy teacher, worked hard to make sausage and ham. Now, families come together to make dumplings and celebrate.”"}, {"text": "“Lunar New Year is all about family and hopefulness,” Liu said. “I think that especially in this year, it is so important to be hopeful and positive for the future and upcoming year.”"}, {"text": ""}], "file_structural_elements": {"title": "South Students Celebrate Lunar New Year", "date": "June 3, 2021", "writer": {"mmPM0AAOdiQuDZH4MUVF": {"name": "Karen Yang", "year": "2022"}}, "description": "\n\n\n\n\n\n\n\nGallery|2 Photos\n\n\n\n\n\n\n\n\n\n\nBecause May is Pan Asian American Heritage Month, Lunar New Year, the most important holiday for many Asian countries, deserves to be highlighted.\n“It’s like a second Christmas,” said sophomore Amy Xu. Lunar New Year is a time for celebration, family and good food.", "image": "https://thepirateseye.org/wp-content/uploads/2021/06/8B82383D-DE9D-42FF-9B93-A83E8A4DF86B-645x900.jpeg"}}