{"tree_elements": [{"text": "“Human beings are hardwired to respond to story,” Ms. Mustoe said. At the South Book Club, students spark meaningful conversations while engaging in discussions on the latest books."}, {"text": "The South Book Club, an unofficial club at South, was started by Hannah Ahmed (’19) in Nov. 2018 and supported by Sarah Mustoe, the School Library Media Specialist."}, {"text": "This year, the library became involved with the club to increase participation. The book club meets on Monday once every two weeks. The South book club not only provides an effective platform to discuss great literature, but also fosters a community at South where students can connect over their love of reading."}, {"text": "The idea of hosting a book club at South stemmed from Ms. Mustoe’s own love for literature."}, {"text": "“ For years, I was a part of a parent-child book club,” Ms. Mustoe said, “and at one point, I also started up a book club at North. When I came here, there had been an [unofficial] student-run book club, but they were all seniors and they graduated.”"}, {"text": "Many students at South wanted the book club to continue."}, {"text": "“When my library helpers were interested in starting a book club, it was really more about the students.” Ms. Mustoe said. “I was a very enthusiastic supporter of the idea.”"}, {"text": "At a typical club meeting, students warm up by discussing the reading in small groups for a couple of minutes before beginning the group discussion."}, {"text": "Senior Raghu Nema, president of the South Book Club, said, “We just go with the flow. Usually we start talking about the book, but then we diverge and start talking about some deeper ideas like the character’s philosophies and how it connects to the real world.”"}, {"text": "The club has read “Speak” by Laurie Halse Anderson and is in the process of reading “Brave New World” by Aldous Huxley."}, {"text": "By reading and participating in discussions with other students, club members can see more than their own perspective on the book."}, {"text": "“[The club] brings attention to books and the value of books and the value of stories. I think you get a different feeling for a book when you see other’s point of view on it,” said Ms. Mustoe.\nIn addition, the club not only provides a community for South readers, but it also validates South students who read for pleasure."}, {"text": "Junior Jay Rana, a member, said, “The book club inspires people to read more often, and also allows people to relax in a no-stress atmosphere. For me, this club helped me grow my interest in reading.”\nNema said, “Generally, I feel like a lot of people enjoy reading books but may not have the time. The club helps motivate people to read more books. If you read about a good book and you want to talk about it, this club provides a good platform.”"}, {"text": "The club hopes to attract more readers who want to combine a hobby with an opportunity to meet new people."}, {"text": "“I definitely want to expand the club.” Nema said. “Currently, we have six or seven people who regularly come and three or four people who regularly rotate in and out. Having fifteen to twenty people would be really nice.”"}, {"text": "Ms. Mustoe said, “[Our club] gives visibility to the fact that books are still relevant and stories are still important.”"}, {"text": "PHOTO BY CATHY XIANG"}], "file_structural_elements": {"title": "South students bring novel ideas to the South Book Club", "date": "December 20, 2019", "writer": {"": {"name": "Cathy Xiang", "year": ""}}, "description": "“Human beings are hardwired to respond to story,” Ms. Mustoe said. At the South Book Club, students spark meaningful conversations while engaging in discussions on the latest books.\nThe South Book Club, an unofficial club at South, was started by Hannah Ahmed (’19) in Nov. 2018 and supported by Sara", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/Book-Club-Group-with-Color-900x675.jpg"}}