{"tree_elements": [{"text": "“You’re listening to 107.9fm,” or should I say reading about it."}, {"text": "The next time you’re on your way to the nurse’s office, look at the room across the hallway.  That room is the home of South’s radio station–107.9."}, {"text": "The station has been broadcasting music, live discussion, talk and game shows, public service announcements and local community news for 42 years. WWP radio club is made up of South and North students and the programs are transmitted from a tower above South.\n     Radio is often compared to typewriters and telegraphs because it originated in a similar era in history, the turn of the century ; yet those objects are obsolete, relegated to little more than decoration or a curiosity in an antique shop window.  To be obsolete, something must be outmoded and antiquated past the point of useful function. The radio is far from being so–radio club remains important for students."}, {"text": "For example, a session on air offers a chance for students to be themselves and to unplug from social media for a few hours a week."}, {"text": "A variety  of creative pursuits and topics are explored in its programs. But, according to sophomore broadcast producer Levi Elias, for most of those involved in the club, while the topic of discussion that is aired is always important, it is not as important as the social chemistry between those who are having the conversation."}, {"text": "“The club values the interpersonal aspects of broadcasting,” Elias said, “which makes radio about more than just music, and about the connections you make while talking to people.”"}, {"text": "“But the club also represents a sort of freedom to me,” said Elias, “whether that is of speech, or to be free and to do whatever you feel like doing that is important to you.”"}, {"text": "What students find most engaging about the club is that “it is very self-directed, and they can talk about whatever they want so long as its school and broadcast appropriate,” said Club Officer and program director Katelyn Saldanha."}, {"text": "“Your level of commitment and enjoyment depends on your own personal interests,” Saldanha said. “The club is first and foremost about enjoyment.” \n     Saldanha said that the social element of radio club is most important to her. She said of the radio broadcasting room, “It’s a safe space to talk. Even the radio booth’s ambiance is inviting.” She described the space as a place to sit back and chat with friends. “The comfortable and social atmosphere is what’s different about radio club,” Saldanha said."}, {"text": "And that comfortable and social atmosphere of the radio booth is necessary to create the necessary air chemistry that drives their shows.\n     When asked, “what’s important about the club?” South’s broadcast writing teacher and club supervisor Glenn Allison expressed similar sentiments to Saldanha. “I think it’s kind of like a family. You have people who graduated and they keep in contact and come back sometimes. It’s really because of the bonding that you do over the radio.” \n     The club is about more than just sitting around and discussing things, Mr.Allison pointed out. “It’s about participating in something that few high schoolers in the entire country have the option to participate in. It’s something that you can look back on and be able to say, ‘I did that’.” \n     To some, radio is a dying medium, headed down the path of the typewriter.  But to students at both of the district’s high schools who man its station every Tuesday and Thursday, the radio is a medium where discussions thrive and high school memories are created. From their standpoint, radio and radio club is alive and well."}], "file_structural_elements": {"title": "South and North on same wavelength with 107.9 radio channel", "date": "April 1, 2019", "writer": {"K0XYYhODXZQZ46XQPVNR": {"name": "Richard Maffei", "year": "2018"}}, "description": "     “You’re listening to 107.9fm,” or should I say reading about it. \n     The next time you’re on your way to the nurse’s office, look at the room across the hallway.  That room is the home of South’s radio station–107.9. \n     The station has been broadcasting music, live discussion, talk and gam", "image": "https://thepirateseye.org/wp-content/uploads/2019/04/radio-final.jpg"}}