{"tree_elements": [{"text": "This school year, South welcomed our new principal Jessica Cincotta, who was previously the assistant principal at North."}, {"text": "Principal Cincotta is eager and excited to be working at South, connecting and helping students and teachers."}, {"text": "“She is definitely, as she calls it, ‘all in for HSS,’” said Snehal Paliwal, secretary of Student Council."}, {"text": "Before she began working for the district, she was active in the educational system in other parts of New Jersey. “I was at Lawrence High School for five years as an assistant principal, with Lawrence Township Public Schools,” said Principal Cincotta."}, {"text": "Although she has been an administrator for large public schools such as WW-P and Lawrence, Principal Cincotta’s own schooling was in a small district."}, {"text": "Growing up, she went to a small public high school in Bluffs, Illinois, a small town of about 700 people. At Bluffs High School, she was involved in many extracurricular activities: sports such as basketball, softball, volleyball, and activities such as student council, musical theatre, band and choir."}, {"text": "“I took parts from each that pushed me or helped me grow to create and formed who I am today,” said Principal Cincotta."}, {"text": "Her early experiences in high school and influences from her mother shaped her career choice."}, {"text": "“I had my mom as a teacher every day, from middle school through high school, as well as part of the time I was in elementary, which was hard,” said Principal Cincotta. “But also I got to see my mom be really happy at her job,” she said."}, {"text": "“She loved what she did, and so I think no matter what I decided to do, it was really that I needed to find something that I loved,” said Principal Cincotta. The job turned out to be teaching and education."}, {"text": "For four years in college at Illinois Wesleyan University, she studied music education. After teaching for some years, she decided to return to school and get her masters in Educational Leadership."}, {"text": "Being a teacher for a few years inspired Principal Cincotta to become an administrator. “I thought that I might be able to be a person who could remove roadblocks for teachers who do a fantastic job in the classroom, but a lot of times get caught up in red tape,” she said. She has been doing just that for 13 years as an administrator, removing roadblocks and easing the troubles faced by teachers, which she wishes to do at South as well."}, {"text": "Her journey to South, interestingly, also began with a roadblock: the coronavirus pandemic. When the pandemic hit and schools shut down in March 2020, the administrative staff of North and South started working closely together. She started communicating with Dennis Lepold, former principal of South; Paul Hamnet and Carla Royster, both former assistant principals of South."}, {"text": "“Through our communication and all of that, I started wondering if South might be a place that I could somehow, someday see myself,” said Principal Cincotta. “When Mr. Lepold announced his retirement. I quickly jumped at the idea of being able to be a Pirate.”"}, {"text": "Now, a few months later, Principal Cincotta feels right at home at South. “Oh, it’s fantastic,” she said. “South has welcomed me so warmly with such kind gestures and actions and words, through emails, or just quick conversations in the hallway.”"}, {"text": "PHOTO BY MS. JESSICA CINCOTTA"}], "file_structural_elements": {"title": "South welcomes new Principal: Ms. Jessica Cincotta", "date": "November 9, 2021", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "This school year, South welcomed our new principal Jessica Cincotta, who was previously the assistant principal at North.\nPrincipal Cincotta is eager and excited to be working at South, connecting and helping students and teachers.\n“She is definitely, as she calls it, ‘all in for HSS,’” said Snehal ", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/IMG_3781-1-1.jpg"}}