{"tree_elements": [{"text": "Trying to escape the cold air, we walk into Starbucks, shuddering as the door closes. Loud cheery Christmas music resounds through the restaurant and it’s only Dec. 1. To tell you the truth, we’ve been listening to Christmas music since Thanksgiving break because we love the feel of the holiday season. There are a variety of Christmas songs, ranging from the classics to new pop tunes, but regardless, everyone has a special song in their heart. Through a Pirate’s Eye poll, we found out South’s top five favorite Christmas songs."}, {"text": ""}, {"text": "5: Santa Tell Me"}, {"text": ""}, {"text": "Starting off our list is “Santa Tell Me” by Ariana Grande. This contemporary holiday pop song was quick to hit the charts, peaking at number 17 on Billboard’s Hot 100 and reaching number  one on their Holiday 100."}, {"text": "It is also the fourth most streamed holiday song on Spotify, and like many of Grande’s songs, is very catchy. “I remember hearing it once on the bus in third grade, and then I came home and couldn’t stop listening to it,” Swara Sanghvi (‘26) said."}, {"text": "The playful tune combined with Grande’s airy vocals creates the perfect holiday atmosphere."}, {"text": ""}, {"text": "4: It’s Beginning to Look a Lot Like Christmas"}, {"text": ""}, {"text": "Number four on our list is “It’s Beginning to Look a Lot Like Christmas.” Written by Meredith Willson in 1951 and originally sung by Bing Crosby, this song celebrates the decorations, such as twinkling lights and trees, that start to appear around the holiday season."}, {"text": "The first rendition to raise the song’s popularity was sung by Perry Como and The Fontane Sisters, but the most popular version today is Michael Bublé’s."}, {"text": "Quickly entering Billboard’s Hot 100 in December 2011, the song is the third most played Christmas song on Spotify, reaching over 690 million listens."}, {"text": "The slower tempo enhances Bublé’s deep legato voice and gives listeners the warm and cozy feeling of Christmas. Ishan Kaluskar (‘26) said, “It’s my first memory of a Christmas song. I remember listening to it with my friend, and every time I hear this song I think of him.”"}, {"text": ""}, {"text": "3: Last Christmas"}, {"text": ""}, {"text": "Entering the top three on our list is “Last Christmas” by Wham!. Peaking at number seven on the Billboard Hot 100, number three on the Billboard Holiday 100 and reaching number one on the UK singles chart, this song is treasured by many."}, {"text": "Ramya Gouriah (‘24) said, “I just like the way it flows. I am also learning how to play it on the guitar for this Christmas.”"}, {"text": "Since its release, “Last Christmas’’ has sold over 1.9 million copies and reached around 980 million streams on Spotify. It has been covered several times, most notably by Ariana Grande, Carly Rae Jepsen, Gwen Stefani and Taylor Swift. The relaxed beat and catchy tune make it an unskippable Christmas classic."}, {"text": ""}, {"text": "2: Feliz Navidad"}, {"text": "Our runner up is the lively bilingual favorite, “Feliz Navidad.” Translated to “Merry Christmas” from Spanish, “Feliz Navidad” was recorded by Puerto Rican singer Jose Feliciano in 1970.     Feliciano said that the inspiration for writing this song came to him on Christmas, when he was away from his family and longed to spend the joyous day with them."}, {"text": "Reaching number 12 on the Billboard Adult Contemporary chart in 2000 and peaking at number six on the Billboard Hot 100 in 2020, “Feliz Navidad” is perfect for karaoke night with its fast tempo and energetic feel."}, {"text": "Art teacher Mr. Nathan Leventhal said about the song, “When I was growing up it felt more modern than a lot of the Christmas songs you heard.”"}, {"text": "Featuring the trumpet, the bongos and Feliciano’s peppy singing, it’s almost impossible to not dance a little when this song comes on."}, {"text": ""}, {"text": "1: All I Want For Christmas is You"}, {"text": ""}, {"text": "At number one, South’s favorite Christmas song is the one and only “All I Want For Christmas is You” by Mariah Carey."}, {"text": "“All I Want For Christmas is You” currently holds records for the Highest-Charting Holiday Song on Billboard’s Hot 100 by a Solo Artist and the Most Streamed Track on Spotify in 24 Hours by a Female Artist, accumulating over 17.2 million streams on Dec 24, 2020. As of now, it has over 1.2 billion streams on Spotify alone, making it the most streamed Christmas song ever."}, {"text": "Released on Oct 29, 1994, Carey wrote this song to speak about what the perfect Christmas would be like for her. “All I Want For Christmas is You” has now made its way into the holiday seasons of many others, being a part of their childhood memories. Ananya Mehta (‘26) said, “It was the first Christmas song I can remember listening to. I also remember dancing to it for my community’s Christmas show.”"}, {"text": "The song starts with a cheerful xylophone tune and then segues into a verse that builds up to an animated chorus, complimenting Carey’s powerful voice. “It’s a very screamable song and I just like the cheerful holiday-ness of it,” Aura Singh (‘24) said."}, {"text": "The dramatic ending coupled with Carey’s signature whistle notes completes this Christmas masterpiece."}, {"text": ""}, {"text": "That wraps up our list of South’s top 5 favorite Christmas songs, but there are so many more songs out there that can help you get into the holiday spirit. Each song has its own feel and tune that make them special."}, {"text": "So, if you ever feel the need to add some holiday cheer, make some hot cocoa, connect your headphones, open Spotify and sit back and enjoy."}, {"text": "IMAGE BY: HARSHAL REYAA VELAT"}], "file_structural_elements": {"title": "South’s Top 5 Christmas Songs", "date": "January 5, 2023", "writer": {"rX3hx9WOOLdUxxe9lrqF": {"name": "Nirati Iyer", "year": "2022"}, "5Sse8M0fpDIfezMBAk38": {"name": "Vrinda Chandnani", "year": "2022"}}, "description": "   Trying to escape the cold air, we walk into Starbucks, shuddering as the door closes. Loud cheery Christmas music resounds through the restaurant and it’s only Dec. 1. To tell you the truth, we’ve been listening to Christmas music since Thanksgiving break because we love the feel of the holiday s", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/Screen_Shot_2022-12-19_at_2.28.55_PM-removebg-preview-1.png"}}