{"tree_elements": [{"text": "It’s been a long road back to the stage for many, but this month South spring musicals returned with “Footloose”, the first musical production since 2020’s “Guys and Dolls”. Performed the weekend before the removal of the school mask mandate, the show symbolically served as a celebration of our community’s perseverance, and South’s students shined both on stage and behind the scenes to deliver a joyous viewing experience."}, {"text": "Most people know “Footloose” as the 1984 film starring Kevin Bacon, but it began its run as a musical in 1998, lasting on broadway for 709 total shows until July of 2000. Its plot is very similar to the movie, following the story of Ren McCormack, a high school senior forced to move from Chicago to the small, rural town of Bomont after his father abandons him and his mother Ethel. Upon reaching Bomont, he learns of the town’s strict law against dancing and becomes determined to change it."}, {"text": "Ren is played by seasoned veteran of South theater senior Connor Rossi, who lights up the stage with exuberant dance moves and showcases an impressive vocal range."}, {"text": "“Ren’s a very cool person, he’s very suave,” said Rossi. “That’s never me, as a person… it was difficult for me, walking with my shoulders back and being cocky.”"}, {"text": "That challenge doesn’t come across on stage as Rossi captivates the audience with the flamboyant, carefree mannerisms his character demands."}, {"text": "Rossi stars opposite sophomore Henna Sharma who plays Ariel, the rebellious daughter of the influential Reverend Shaw Moore, who is responsible for creating and upholding Bomont’s anti-dancing law. Sharma rises to the challenge of portraying the promiscuous and often rambunctious Ariel, exuding swagger and confidence through fast paced dances and numerous vocal solos. “I’m not like Ariel at all,” said Sharma. “I’m more reserved, but she was a lot of fun to act as because she’s very different from me.”"}, {"text": ""}, {"text": "Henna Sharma (center), circled by (left to right) Sophia Azzara, Zarah Mendoza, Cindy Liu, and Surmai Agrawal at the end of a musical number"}, {"text": "Just like her co-star, though, Sharma shows no signs of discomfort in a dazzling on-stage display."}, {"text": "The rest of the cast supplements the leads very effectively. Seniors Alex Fisher and Faith Falkowitz take on the role of Ariel’s parents, the afore-mentioned Reverend Moore and his wife Vi. The pair emotively express the burdens of their respective characters’ lives. Shaw struggles to balance his sense of duty for his town with maintaining a positive relationship with his daughter, and Vi grapples with encouraging her husband to loosen up his rigid views while still “knowing her place” in the house. Fisher and Falkowitz both deliver impactful dialogue and their own emotional solos with a sincerity that perfectly complements the largely comedic tone of the show. Senior Chase White portrays the endearing Willard Hewitt, Ren’s newfound friend in Bomont. A clumsy and somewhat oblivious cowboy type, White makes it easy for the audience to get behind Willard with well-delivered, witty lines as he slowly comes out of his shell and is taught by Ren how to dance. Opposite Willard is the character of Rusty, Ariel’s tambunctious friend with a long running crush on Williard. Sophomore Surmai Agrawal elevates the energy on stage with every sentence and song as Rusty as she indoctrinates Ren into Bomont and fawns over Willard."}, {"text": "Rounded out by a lively ensemble and a few more vibrant minor characters, every member of the cast turns in a stunning effort that makes the performance all the more vivid and real."}, {"text": "The on stage cast is far from the only group that contributes to the success of “Footloose” though. The pit band is equal parts responsible for the presentation of the show’s jubilant score. A mix of orchestral and band instruments, the pit both adds to the vocal performances and plays over the intermittent set changes, seamlessly transitioning between melodies whenever the progression of the show demands it. “The pit band just provides most of the energy for the cast of the musical,” said senior Rishab Nalgundwar, who plays the drums for the show. “Without the pit band, you have this really bad recorded music, and it overall just feels pretty lame.”"}, {"text": "Needless to say, the presence of live accompaniment makes a world of difference in helping to bring the show to life."}, {"text": "The greatest unsung heroes of “Footloose” are the behind the scenes crew. Known collectively as the “A-Team”, this cohort of students spends hours perfecting all the little things that the audience might not even notice, yet are essential for a successful performance. There’s the simple but versatile set construction and props that can change the stage from a train station hideout to a family home in no more than thirty seconds. There’s the hair and makeup team that heightens the facial expressions of each and every actor. There’s the costume team, cladding the cast in bright colors and midwestern apparel that authenticates the setting of the show even more. There’s the lighting team, who stop on a dime and refocus the audience’s attention even through the production’s trademark upbeat dancing and movement. All together, the “A-Team” is the heart and soul of this triumphant performance for the theater department, paying off months of hard work and dedication."}, {"text": "“Footloose” serves as the culminating product of time, effort, and talent that has been two years in the making. A fun ride from start to finish, it stands squarely among a long line of great South productions and is a bright reminder of what the future holds."}], "file_structural_elements": {"title": "South musicals make rousing return with “Footloose”", "date": "March 30, 2022", "writer": {"xcHHOYKQ8MJMj6FRgYiE": {"name": "Danny McElroy", "year": "2021"}}, "description": "       It’s been a long road back to the stage for many, but this month South spring musicals returned with “Footloose”, the first musical production since 2020’s “Guys and Dolls”. Performed the weekend before the removal of the school mask mandate, the show symbolically served as a celebration of o", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/image1.jpg"}}