{"tree_elements": [{"text": "Creating positive change in a community may seem daunting to most, but for Dr. Carla Royster, who retired as South’s Assistant Principal effective January 1, 2020, creating positive change was part of what she did every day at our school."}, {"text": "Dr. Royster’s career at WWPRSD spanned well over three decades. During this period, her positive attitude empowered students and teachers."}, {"text": "“She is just a big, strong personality, and so warm and gentle and really easy to get along with,” said Paul Hamnett, High School South’s Assistant Principal."}, {"text": "South was essential to Dr. Royster’s personal development.  She was a student in the 1980s, and she was the only African American student in her class. As a student, she was involved in many extracurricular activities. She was part of the basketball and track teams, a member of the Human Rights Club, Art Club, and the school band. She was also the Student Body President."}, {"text": "While in high school, she petitioned to make Martin Luther King Jr. Day a district-recognized holiday at South. “I was already a political activist, but not really thinking about it,” said Dr. Royster. Growing up, Dr. Royster’s mother was a great influence. Her mother’s family trips around the globe provided Dr. Royster with a broader perspective and a more open mindset."}, {"text": "“She wanted us to be children without walls,” said Dr. Royster. These experiences made her a problem solver, a person who is always ready to take down whatever blocks her way."}, {"text": "After graduating from South in 1983, Dr. Royster moved to Baltimore, Maryland to attend Morgan State University, a historically black university, where she earned her bachelor’s degree."}, {"text": "During her undergraduate studies, Dr. Royster said,  “I began to devote myself to the lives and the education of the disenfranchised.” Dr. Royster taught women how to read and write in the Department of Corrections."}, {"text": "She graduated from Morgan State in 1987 and moved back to New Jersey, where she began working at the New Jersey State Training School for Boys And Girls."}, {"text": "At the training school, she decided to start a running program for the students. She contacted the Assistant Principal of High School South, Dr. Seaver, to find schools to compete with. She had stayed in contact with  Dr. Seaver since graduating from South. Dr. Seaver helped her find teams to compete with, and later he also offered her a job at the school. African American students, Dr. Royster explained, were feeling isolated and parents were requesting that an African American teacher be hired to serve as a mentor."}, {"text": "Dr. Royster said that having been the only African American in her graduating class, she felt compassion for the students at South. “I understood what that was like. I remember feeling that way, like wow, no one understands me, without me having to over-explain.”"}, {"text": "In 1989, she joined South as a physical education teacher and taught for five years. Later, she took up the position of a full-time health teacher because she preferred teaching in the classroom."}, {"text": "“I taught health for 17 wonderful years,” said Dr. Royster."}, {"text": "During these years as a teacher, she collaborated with Mr. Hamnett to add swimming lessons for students who didn’t know how to swim. She also introduced many cultural clubs at South, including Korean Club, Irish American Awareness Club, Crescent Club, Average American Awareness Club, Spectrum, and others. She said, “I was hands-on in starting all of those clubs to give kids an opportunity to have a place for dialogue ”"}, {"text": "But Dr. Royster faced many obstacles in creating change for her students. “I kept hitting walls,” said Dr. Royster. Whenever she tried to take down these walls, she was told the same thing: she didn’t understand the system. This led her to go back to school to learn more about “the structure of the educational administration.”"}, {"text": "In 2011 she started her first administrative job as assistant principal at GMS. By then, she’d finished her Ph.D. from Rowan University."}, {"text": "At GMS, she worked closely with current South Principal Mr. Dennis Lepold, who at that time was the principal of GMS."}, {"text": "“My time there was a training ground, kind of experiential for learning about younger kids,” said Dr. Royster. “I was really happy at the middle school.”"}, {"text": "After a few years, Dr. Royster found her way back to South, where Mr. Lepold had become principal."}, {"text": "Surprisingly, she had a hard time settling back at South: “It was the most trying part of my entire career,” said Dr. Royster. Her promotion to Assistant Principal changed her dynamics with everyone."}, {"text": "“It changes your whole relationship with parents and students,” said Dr. Royster."}, {"text": "Although she faced challenges, she kept doing her job."}, {"text": "“Trust does not come easy–it takes time to build,” Mr. Lepold said. “Dr. Royster connected with many students and families during her time at South and some of those kids have younger siblings.”"}, {"text": "Now retired in Florida, she works in partnership with charities with the goal “to have an impact on the lives of people who are invisible.” She collaborates with Goodwill, Habitat for Humanity and Meals on Wheels to make this possible. She also works alongside churches in her neighborhood."}, {"text": "Dr. Royster inspired South for over three decades. Mr. Hamnett said, “We are not going to be able to fill her shoes.”"}, {"text": ""}], "file_structural_elements": {"title": "South pride: Dr. Royster retires", "date": "May 19, 2021", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "Dr. Royster’s senior picture.\n     Creating positive change in a community may seem daunting to most, but for Dr. Carla Royster, who retired as South’s Assistant Principal effective January 1, 2020, creating positive change was part of what she did every day at our school. \n     Dr. Royster’s career", "image": "https://thepirateseye.org/wp-content/uploads/2021/05/Royster.jpg"}}