{"tree_elements": [{"text": ""}, {"text": "On Sept. 15, South kicked off Hispanic/Latinx Heritage Month, a month-long celebration highlighting the contributions and history of Hispanic and Latinx people in the United States. From Mexican-inspired Homecoming decorations to clips on the morning announcements, students organized to educate our community about the food, traditions and culture of Hispanic and Latinx communities this month."}, {"text": "Hispanic/Latinx Heritage Month (officially recognized as National Hispanic Heritage Month) was first proposed by Californian congressman George E. Brown. Like many other Heritage and History Months, National Hispanic Heritage Month was first established as one week in 1968, before being expanded in 1988 to a whole month. National Hispanic Heritage Month begins on Sept. 15 and ends Oct. 15."}, {"text": "The date of Sept. 15 holds special importance as it is the day that Central American countries such as Costa Rica, Nicaragua, Guatemala, El Salvador and Honduras proclaimed their independence from Spain."}, {"text": "The Latinx/Hispanic heritage of this country is often overlooked. For example, the states of Florida and Louisiana were originally Spanish colonies. The 1846 Mexican-American war reconfigured the entirety of Northern Mexico, which was taken over by the United States to become what is now known as California, New Mexico, Arizona, Texas, Nevada, Colorado, and Utah."}, {"text": "There are around 60.5 million Hispanic and Latinx people living in the United States, and they make up 18.4 percent of the population."}, {"text": "The terms Hispanic and Latinx are distinct. Verónica Villacrés, a Spanish 3 Honors and Honors Cultural teacher, stated that it is impossible to learn about Hispanic and Latinx cultures when they are conflated as one population."}, {"text": "“Hispanic & Latinx are often and mistakenly used interchangeably. I think this leads to us grouping these two terms together, and ignoring the rich culture behind these terms.” Hispanic people are those who originate from a Spanish speaking country, while the term Latinx is used to refer to people who come from Mexico, the Caribbean, Central America and South America."}, {"text": "Stra. Villacrés said the importance of educating South on the history and culture of Hispanic and Latinx cultures. “I think if we educate both staff & students on not only Hispanic/Latinx but other topics of ethnicity, and culture, it allows us to better understand others.” She added, “We have many Hispanic and Latinx students who would like to see themselves in the books they read, and we need to allow for ways in which this can happen.”"}, {"text": "Mary Desmond, media center specialist, agrees. Ms. Desmond and Katherine Carroll, North’s media center specialist, created slides about Hispanic/Latinx Heritage Month. “She and I put together a resource list that we felt pretty good about and hopefully the students have been accessing, just as ways to participate in the month long celebration and also just gain more knowledge about it as well,” said Ms. Desmond"}, {"text": "However, the main attraction was the spotlight on Hispanic and Latinx authors and poets, such as Elizabeth Acevedo and Javier Zamoda. “We all, as individuals, appreciate it when we can see ourselves in literature,” said Ms. Desmond. “If we are reading about characters from different backgrounds or situations from our own, that’s what helps us grow and that’s what helps connect us.”"}, {"text": "Sabrina Rocha, a junior, was one of the students who created a video clip and shared her heritage and culture on the morning announcements. When asked on the importance of highlighting different cultures, she said, “I think it’s important because when one gets to know about others they see that there are different ways of living and thinking, that goes with religion and customs.” Rocha added, “It helps us understand each other and it’s important to consider one another and since we are close to many Latin and Hispanic people, we should make an effort to be cultured.”"}, {"text": "For Homecoming, sophomores adorned commons 2 with marigolds, corn and famous figures–such as artist Frida Kahlo and Pancho Villa, a Mexican general. The decorations were based on and inspired by Mexican culture, as well as the holiday Day of the Dead, a Mexican holiday that takes place Nov. 1 and celebrates the cycle of life and death."}, {"text": "Dominique Hooks, one of the sophomores who helped create the designs, emphasized the importance of highlighting different cultures. “I think it’s important because our world and country is very diverse so knowing about more than your own culture will help you in the real world.”"}, {"text": "Photography teacher Nathan Leventhal, who was one of the advisors of the sophomore decorating team, said, “When there’s more diversity, you can feel like you can be unique and fit in there also.”"}, {"text": "The artists hoped to expose students to Mexican culture. “In our set-up we actually had facts about each of the things we made so that people could read them and see the symbolism and importance,” said Hooks."}, {"text": "“We tried to take the things that we were inspired by and put up little snippets of what they were and why they were important to Mexican culture,” Mr. Leventhal said."}, {"text": "In addition to Homecoming decorations, the sophomore design of the Homecoming shirt was also Mexican inspired."}, {"text": "“The skull on the back is supposed to be a calavera or sugar skull, and the eye patch is because we’re Pirates, and I thought both would match together,” said sophomore Siri Nimkar."}, {"text": "Nimkar believed in the necessity of highlighting different cultures. “It’s important because we’re such a diverse school district and we need to make sure that all cultures are being brought to light, rather than the few that are celebrated each year.”"}, {"text": "In fact, many people, students and staff alike learned about new things about Hispanic culture."}, {"text": "“I came across various types of dances I didn’t know about,” said Nimkar."}, {"text": "Mr. Leventhal explained that he learned about the Mexican folktale behind the relationship between marigolds and hummingbirds. “There’s a woman, and a man that were worshippers of this god and they were lovers. And when the man died, the woman begged the god to bring him back. The god turned the woman into a marigold and the man into a hummingbird,” he said. “Marigolds became a symbol of finding your way back from the dead.”"}, {"text": "Rocha talked about why she chose to create a morning announcement for this month: “Many of my classmates don’t know much about my culture and I thought I’d share.”"}, {"text": "In an email interview, Srta. Villacrés expressed hope for future celebrations “This year, I’ve seen students feel pride in their Hispanic and/or Latinx culture, and I think it’s because of the small changes South is trying to put in place.”"}, {"text": "One such change is the school and district’s equity goal, which aims to “cultivate a diverse and inclusive community where members of every race, sexual orientation, gender, gender identity, ability, religion, socio-economic class, ethnicity, and national origin are welcomed, valued, respected and celebrated.”"}, {"text": "Celebrations such as Hispanic/Latinx Heritage month is a step in the right direction."}, {"text": "IMAGE BY SIDD SHETTY AND ISHITA VINAY"}], "file_structural_elements": {"title": "South’s rich Hispanic and Latinx cultures", "date": "November 11, 2021", "writer": {"71hhF0oQr1LLxWE03E35": {"name": "Sidd Shetty", "year": "2021"}}, "description": " \n     On Sept. 15, South kicked off Hispanic/Latinx Heritage Month, a month-long celebration highlighting the contributions and history of Hispanic and Latinx people in the United States. From Mexican-inspired Homecoming decorations to clips on the morning announcements, students organized to educa", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Screenshot-2021-11-16-9.33.05-PM.png"}}