{"tree_elements": [{"text": "Due to the coronavirus pandemic, WWPRSD transitioned to remote learning on March 16, but the typical high school life became impossible. Clubs no longer meet, sports teams are inactive and field trips are canceled. Free time in quarantine is a unique opportunity for students to pursue new activities."}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": ""}, {"text": "I pretty much never baked during school.”"}, {"text": "— Ellen Wu, freshman"}, {"text": ""}, {"text": "Free time has allowed students to explore hobbies like cooking and baking."}, {"text": ""}, {"text": "I can give more time to my family. ”"}, {"text": "— Isha Shrivas, junior"}, {"text": ""}, {"text": "Normally, we would spend our time on schoolwork and extracurricular activities, with no time to eat meals with the whole family. But quarantine has become a time where we can connect with each other."}, {"text": ""}, {"text": "[I have been] going out into nature and discovering new places. I would never go out and have the time to explore like that.”"}, {"text": "— Nina Shinder, junior"}, {"text": ""}, {"text": "I have a lot more free time to do things I like and I also get a lot more sleep.”"}, {"text": "— Naveena Erranki, senior"}, {"text": ""}, {"text": "As high schoolers, we often stay up past midnight, working on homework and studying for tests. For South students, quarantine has become a chance to make up for the hours of sleep we missed."}, {"text": ""}, {"text": "[I have been] Drawing, binge-watching shows, organizing and learning piano. I usually didn’t have enough time to do these activities and be satisfied.”"}, {"text": "— Tania Sterling, senior"}, {"text": ""}], "file_structural_elements": {"title": "South students in quarantine", "date": "June 19, 2020", "writer": {"t1wNGC5vCu2m5zKSZgLI": {"name": "Sophia Englezos", "year": "2020"}, "PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     Due to the coronavirus pandemic, WWPRSD transitioned to remote learning on March 16, but the typical high school life became impossible. Clubs no longer meet, sports teams are inactive and field trips are canceled. Free time in quarantine is a unique opportunity for students to pursue new activ", "image": null}}