{"tree_elements": [{"text": "Monday, Sept. 27 marked the first day of South’s highly anticipated fall Homecoming. Wrapped in giant blankets, trailing long bathrobes, students came to school eager to participate in Homecoming spirit week."}, {"text": "Monday was Lazy Day, Tuesday Formal Day, Wednesday U.S.A Day, Thursday Flannel Day, and finally Thursday Class Color Day. All this was a build up to Friday’s Homecoming football game and the competition among the four grades in a variety of activities to win spirit week."}, {"text": "Pre-pandemic, that’s the way we celebrated Homecoming. South hasn’t had a homecoming spirit week since 2019. Last year, when school was hybrid and virtual, students logged onto their classes in pajamas and tuxedos and Hawaiian shirts while teachers tallied up the points from behind a Zoom screen."}, {"text": "When asked about South’s spirit week last year, junior Sangeeta Quddus said, “I was hybrid, and even then, no one really participated in spirit week.”"}, {"text": "But with the repopulation of our South hallways this year, students of each grade have been more excited about spirit week."}, {"text": "Freshman Lauren Kim said, “I definitely expected all the upperclassmen to participate a lot but I am super impressed with the freshman.”"}, {"text": "Sophomores who didn’t have a real spirit week last year weren’t expecting much from this year. “At first I wasn’t that excited,” said sophomore Maggie Li. But, when they got to experience the South atmosphere this spirit week, they were pleasantly surprised. “When I actually started dressing up for it and my friends were dressing up for it, it was really fun,” said Li."}, {"text": "Junior Sohini Mukherjee said, “I’m just excited to come to school and see everybody else’s outfits.”"}, {"text": "Some seniors couldn’t help feeling nostalgic."}, {"text": "“It’s my last spirit week, so I’m glad that I can participate,” said senior Nyomi Lyons. “Compared to last year’s seniors, I really think we got lucky because we actually have a real senior experience.”"}, {"text": "Senior William Jett said, “It’s a nice improvement that we can at least have a spirit week. That much is appreciated, but it’s still sad to see that we don’t get a proper send-off.”"}, {"text": "This year’s spirit week can feel a little less lively than before due to the cancellations of"}, {"text": "several South spirit week traditions. For example, students will no longer gather during gym to watch their classmates compete or have Homecoming dance this year."}, {"text": "Principal Cincotta explained, “It was really out of an abundance of caution to keep everyone safe so that we can then be safe in school and keep everyone in for as long as possible.” She added, “Hard decisions have to be made at times but health and safety is the top priority.”"}, {"text": "When asked whether she is hopeful that we can return to having normal spirit weeks, Principal Cincotta’s answer was more than optimistic."}, {"text": "“Yes, yes, and yes,” she said. “I am super hopeful that we can go back and think about what things happened in the past, keep everything that we used to love, and then build and make things even bigger and greater in the future.”"}], "file_structural_elements": {"title": "South spirit:  united together", "date": "November 9, 2021", "writer": {"oZGSQKPCWdIpU60HDHNu": {"name": "Vivian Xie", "year": "2022"}, "ZSFFpdQWjszDdCIoro8x": {"name": "Sana Manchanda", "year": "2021"}}, "description": "Monday, Sept. 27 marked the first day of South’s highly anticipated fall Homecoming. Wrapped in giant blankets, trailing long bathrobes, students came to school eager to participate in Homecoming spirit week.\nMonday was Lazy Day, Tuesday Formal Day, Wednesday U.S.A Day, Thursday Flannel Day, and fin", "image": "https://thepirateseye.org/wp-content/uploads/2021/11/Screen-Shot-2021-11-09-at-12.46.35-PM-900x815.png"}}