{"tree_elements": [{"text": "“As a leader, Vonesha, makes sure to include everyone,” said Ms. Libby Kamen Drost, the advisor for the WW-P FIRST Robotics team 1923 The MidKnight Inventors.  “So not only is she leading by example that women are welcome in STEM, but she’s making sure the culture of the entire group is welcoming to all people and all backgrounds. It’s made a huge difference in the culture of the WW-P Robotics team.”"}, {"text": "Senior Vonesha Shaik has made waves in the STEM world, starting with the South and North combined Robotics team, The MidKnight Inventors. As the outreach captain for the team, Shaik influences and leads the outreach subteam under The MidKnight Inventors for the 2020-2021 season."}, {"text": "Although she joined The MidKnight Inventors her freshman year, Shaik has been immersed in FIRST and coding from a young age. She explained that her earliest memory was at the age of seven when she moved LEGO blocks through simple motors and code."}, {"text": "“It was fun to share my building and coding experiences with my little sister and her friends,” she said. “This is how I started mentoring before I knew what that meant.”"}, {"text": "Soon after discovering her passion for mentoring and coding, Shaik started her sister’s FIRST LEGO League Team (FLL) and created a FIRST LEGO League Junior Team (JFLL) with her younger sister freshman Vinesha Shaik."}, {"text": "Vinesha added, “Starting a team with my sister was an exciting experience because we were able to introduce young girls to the growing field of STEM from a young age.”"}, {"text": "Vinesha explained how she learns a lot from her sister and sees her as a role model."}, {"text": "However, Shaik was not initially the leader she wanted to be.  As Shaik branched into large scale programs and camps, where she teaches STEM concepts and business strategies, she was nervous with the large crowds and new faces."}, {"text": "“At the beginning, I was very shy and thought twice before interacting with new people,” she said. “It was my first time coordinating with kids and adults at the same time. I had a lot of questions and doubts.”"}, {"text": "Instead of allowing these challenges to deter her from her passion, Shaik learned from them and continued to create professional programs."}, {"text": "GIRLS Crack The Code, one of Shaik’s non-profit organizations, took months of hard work and preparation to create. However, Shaik stayed motivated and continued to work towards creating a program that would be an inspirational medium for young girls all across America to learn about STEM. She hoped that through her programs and initiatives the younger generation of girls would not have to face the same challenges she did as a woman in STEM."}, {"text": "“As a woman in STEM, I know how discouraging it can be to walk into a technology class or program and see no one else like you there,” said Shaik.“When I first joined co-ed technical teams and classes I was either the only girl or one of the few girls among the boys. I always needed to put in extra effort to show that ‘I can do it.’”"}, {"text": "Shaik explained how the reward she gets from running these programs makes up for the obstacles she faces as a female STEM mentor. “When I go for a walk in my town or anywhere outside, kids and parents who participated in the program come up to me with a smile, talk about the programs, or their newfound STEM interests.  It always brings me joy,” said Shaik."}, {"text": "Her simple inspiration to bring joy and innovation to young girls has shaped Shaik into the responsible leader she is today. Senior Ishita Pandey, the Vice President of Logistics of GIRLS Crack The Code, explained how well they work together."}, {"text": "“It is definitely easier to work with your friend and Vonesha is just such a great person and easy to work with,” said Pandey. “If I don’t understand something, I just call Vonesha and she handles it well.”"}, {"text": "Shaik’s teamwork and hardworking personality helped her land an internship at Bloomberg this past summer."}, {"text": "“I was assigned work in totally new languages, C++ and Python,” explained Shaik. She initially had many questions, but she said that by “Using AP Computer Science and Java language knowledge I started mapping the differences and similarities to understand C++ and Python.”"}, {"text": "Through her positive attitude towards this new hurdle, Shaik preserved and became an active intern at Bloomberg."}, {"text": "“My self-motivation and enthusiasm resulted in developing software modules for business usage and I was re-hired for another internship at Bloomberg in 2021,” said Shaik."}, {"text": "Shaik’s determined mindset has never failed her, and now pushes her to become a confident leader young girls can look up to."}, {"text": "“Even though male domination in STEM was a barrier, I was determined to pursue my goals,” said Shaik. “My struggle and success in technology led to my passion for educating and inspiring girls to reach their potential and shine in their STEM interests irrespective of the environment.”"}, {"text": ""}, {"text": ""}, {"text": "Word Bank:"}, {"text": "FIRST Robotics Competition (FRC): High school teams in a limited time frame must create their own brand, raise money and build functional large robots for a championship against other teams."}, {"text": ""}, {"text": "FIRST LEGO League (FLL): Kids from grades 1-8 are introduced to STEM and get experience in real-world problem solving through a guided program."}, {"text": ""}, {"text": "FIRST LEGO League Junior (JFLL): Kids from kindergarten to 4th grade are mentored by two adults, explore their challenge and create a representative LEGO model."}, {"text": ""}, {"text": "STEM: Science, technology, engineering and mathematics."}, {"text": ""}, {"text": "Photo courtesy of Vonesha Shaik."}], "file_structural_elements": {"title": "South STEM leader: Vonesha Shaik", "date": "November 13, 2020", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "     “As a leader, Vonesha, makes sure to include everyone,” said Ms. Libby Kamen Drost, the advisor for the WW-P FIRST Robotics team 1923 The MidKnight Inventors.  “So not only is she leading by example that women are welcome in STEM, but she’s making sure the culture of the entire group is welcomi", "image": "https://thepirateseye.org/wp-content/uploads/2020/11/Vonesha_Shaik_Picture-e1605317243365-900x852.jpg"}}