{"tree_elements": [{"text": "Spring has arrived: colorful flowers in bloom, longer days and warmer weather. After a year of lockdown, quarantine and several snowstorms, South staff and students can’t wait to get outside and soak up some sun."}, {"text": "This spring, staff and students should get outside of the house and make the best of the beautiful weather approaching. There are many safe activities that staff and students can participate in both alone or with friends and family."}, {"text": "For one, people can now start going outside much more than they were able to before. According to NJ.Gov, on April 26, Governor Murphy has announced that the outdoor gathering limit is now 500 persons and indoor capacity has been raised to 50 percent with a maximum of 250 persons."}, {"text": "“Ever since the weather has started getting warmer, my new favorite hobby is going on long walks with my dog and occasionally my sister,” said junior Chahek Upadhyay. Like Upadhyay, many people have been taking advantage of the weather to spend more time outside and exercising to become healthier versions of themselves."}, {"text": "“I’ve been riding my bike a whole lot more. I rode over to school a couple of times and I want to do the entire Lawrence-Hopewell Trail at some point,” said world history teacher Mr. Brian Levinson."}, {"text": "Biking, however, is not the only way one can gain physical activity. For those currently looking to exercise, the Plainsboro Recreation Center is offering a variety of activities during the spring and summer. The Center offers fencing, volleyball, soccer, tennis, yoga, Zumba, pilates and more from toddlers all the way to senior citizens. They also offer educational programs such as creative gardening, Java programming, graphic design and theater. As of now, there are no date restrictions as to when to sign up, but classes are first come first serve, so hurry and sign up to experience these classes."}, {"text": "Other students are seizing the opportunity to meet up with loved ones in ways to ensure that everyone stays as safe as possible."}, {"text": "“I often meet up with my cousins at a park, and just spend the day relaxing in each other’s company,” said freshman Vanessa Zhang."}, {"text": "Like Zhang, others are also taking the opportunity to hang out with family in outdoor settings."}, {"text": "“I plan to spend more time with my family by going on outdoor, socially distant picnics,” said freshman Ratchana Rameshpandi."}, {"text": "Whether it’s by spending time with family and friends or joining classes at the Rec Center, make sure to stay active and get outside to enjoy the sunny days and gentle breezes this spring!"}], "file_structural_elements": {"title": "Spring Time Activities", "date": "May 27, 2021", "writer": {"yCkJnR93m7cf2NvYleFK": {"name": "Mahek Upadhyay", "year": "2020"}, "NOlffvh7x2ouyJpAMrkO": {"name": "Arishtha Dey", "year": "2021"}}, "description": "    Spring has arrived: colorful flowers in bloom, longer days and warmer weather. After a year of lockdown, quarantine and several snowstorms, South staff and students can’t wait to get outside and soak up some sun. \n     This spring, staff and students should get outside of the house and make the ", "image": null}}