{"tree_elements": [{"text": "A wave of tropical air hit me as I walked off the plane. I smelled delicious warm empanadas and heard the welcoming sound of Bachata, the traditional dance music of the Dominican Republic (D.R.). When my group and I met the cheerful musicians they cheered, “Welcome to Puerto Plata!”"}, {"text": "There were eight of us walking through the airport, joking around and laughing loudly. It probably appeared as if we’d known each other for years, but actually we’d only met six hours ago."}, {"text": "Walking through customs was surprisingly fun. The officer who looked over my travel documents asked me who I was and why I’d flown to the island by myself at my age. This was when what began as only an idea felt real – I was here for a week to volunteer in local communities with a global health organization."}, {"text": "The idea of visiting the D.R. started a few months ago, when I was given the opportunity in Señora Blejwas’ spanish class to research the country. At first, the main search results I found were about Punta Cana and that tourism is a major industry in the country. As I dug deeper, I found out about the darker side of the D.R.. People often live without running water or access to medical care.  There is little social mobility and the justice system is known to be corrupt. I was concerned by what I was reading."}, {"text": "On a Peace Corps webpage that described the situation in the D.R., I found information about a program called “The 7 Elements” or 7e. Through this program teenagers around the world are able to volunteer in underdeveloped areas. After eventually convincing my parents to let me go, I applied for the program. Two weeks later, I recieved my acceptance letter and the adventure began."}, {"text": "After the customs officer wished me luck on my project, my group and I exited the airport and boarded the bus that was waiting for us. The forty-five minute long bus ride was the bumpiest I’d ever been on because of the unpaved roads. The ride felt short, though, because of my excitement. As soon as we saw our room, the other five girls and I were surprised and concerned about how we’d be able to get through our week-long stay."}, {"text": "We weren’t used to dealing with spiders the size of golf balls and cockroaches the size of hamsters. We had to adjust to cold showers and sleeping under mosquito nets. I’m so grateful we were provided mosquito nets–they saved us from the fear of waking up with a critter in our beds."}, {"text": "During our trip, we worked on two different global health projects: the lack of medical care and water sanitation. With the help of local masons and community leaders, we spent most of our time working to build a base for the water tank in a local community called Caño Dulce, or the sweet community, because of the delicious mangoes it was known for."}, {"text": "The other days, we worked as  part of a medical brigade. On our first day, we were trained to take vitals such as blood pressure, temperature, height and weight. Afterwards, we headed to a neighboring community called Nueva York Chiquito, or little New York, because like parts of the famous city, it was built on a foundation of trash. We worked with children, interviewing them in Spanish and distributing vitamins because many of the children were malnourished."}, {"text": "I’ll never forget an experience on the second day of our medical brigade. I met a little girl wearing a faded green dress. She was around eight. When I was interviewing her mother about her health, the daughter began to giggle at my broken Spanish, and gave me a wide, toothy grin."}, {"text": "That moment, and others like it, made my service trip feel less like service, and more like the privilege that it was– meeting and learning from people beyond the West Windsor community."}], "file_structural_elements": {"title": "Spring break service story: volunteering in the Dominican Republic", "date": "May 21, 2019", "writer": {"LpDIeLwdu280NdPILdWj": {"name": "Ashna Garikapati", "year": "2020"}}, "description": "     A wave of tropical air hit me as I walked off the plane. I smelled delicious warm empanadas and heard the welcoming sound of Bachata, the traditional dance music of the Dominican Republic (D.R.). When my group and I met the cheerful musicians they cheered, “Welcome to Puerto Plata!” \n      Ther", "image": null}}