{"tree_elements": [{"text": "After a long day of school, many students rush home to turn on Netflix and watch the popular Korean drama, “Squid Game.” Contrary to expectations, there are little to no squids involved in the show."}, {"text": "From getting overhyped on Tiktok to becoming Netflix’s number one show in over 94 countries, “Squid Game” is now the most-watched show in the world, according to NBC. While the show contains similar ideas to other dystopian shows, such as “Hunger Games” and “Battle Royale,” it has put a twist to that genre. The director, Hwang Dong-hyuk, set the show in present-day Korea and used a series of Korean children’s games to bring cultural awareness to Korean customs and critique capitalism."}, {"text": "Being avid watchers of the most popular shows on Netflix, we were quick to start watching this new show that was for weeks only word-of-mouth. We began watching with high hopes but were quickly met with a wave of disappointment."}, {"text": "Sophomore Faith Hu shared our experience. She said, “I could barely keep my eyes open as I forced myself to finish watching the first two episodes.”"}, {"text": "But getting through the first few episodes was needed to set the framework for the entire show, so we continued watching. And we must say, we are very glad we did."}, {"text": "The show quickly redeemed itself as the games started. They consisted of four games: red light, green light; tug of war; ddakji, a game that involves paper squares; and dalgona, a game about carving melted sugar molds. The consequence of losing these games is death, which creates suspense and tension to keep watchers hooked. After the games started, we couldn’t avert our eyes from the television until we finished the whole show."}, {"text": "“Lots of action–I really enjoyed it,” said sophomore Kanisnk Neerumala."}, {"text": "The actor Lee Jung Jae plays the charming protagonist: Seong Hi-Hun. His role is that of a common person: a father, a friend, a middle-aged man in debt, and a gambler. Due to his severe debt, he and many others accept the offer of entering the Games, lured by the money award. This calls attention to the financial problems of all players and the lengths they will go to win the prize. As Hu put it regarding the motivation of characters in the show, “It’s always got to do something with the money.”"}, {"text": "Although the show itself was outstanding, we couldn’t help but feel a bit irritated by the language barrier. The show is in Korean, so you either have to watch it with English subtitles, forcing you to look at the screen every second, or with a dubbed version, which many see as emotionless."}, {"text": "We recommend watching the show in Korean with English subtitles for an experience as close to those who understand Korean would get–a good rule to follow for watching future K-dramas."}, {"text": "Matthew Coburn, an American History 1 and 2 teacher and 2024 class advisor, said, “I thought it was a very unique storyline, for sure. There have been movies, in the past, that have come out, like “Battle Royale,” with a very similar premise. But I thought it was very interesting.”"}, {"text": "“Squid Game” is a one-of-a-kind show and we would recommend it to anyone over the age of 13, as some scenes may be unsuitable for younger audiences."}, {"text": ""}], "file_structural_elements": {"title": "Squid Game: Is it worth the hype?", "date": "November 16, 2021", "writer": {"arVyKy5gQKK0nVfft2Bk": {"name": "Deepa Srinidhi", "year": "2021"}, "NOlffvh7x2ouyJpAMrkO": {"name": "Arishtha Dey", "year": "2021"}}, "description": "     After a long day of school, many students rush home to turn on Netflix and watch the popular Korean drama, “Squid Game.” Contrary to expectations, there are little to no squids involved in the show.\n     From getting overhyped on Tiktok to becoming Netflix’s number one show in over 94 countries", "image": null}}