{"tree_elements": [{"text": "It is said that the key to a happy life is a harmonious mind and soul. According to Romeo Vitelli, a psychology doctorate from York University, too much stress can “lead to negative emotions such as depression or anxiety [and] can also have a negative impact on the cardiac, endocrine, metabolic, and immune process in the body.” To avoid these negative effects on the body and mental health, it is important to manage our stress."}, {"text": "Whether it is due to spending countless hours studying for a test, staying up to complete work, or simply feeling like time is going by too fast to enjoy it, both students and teachers alike face stress and are looking for ways to help reduce it."}, {"text": "“I definitely feel like mental health and stress are very important aspects of high school students, especially considering all the work we have to do and the amount of time we have to complete this work in,” said junior Aaheli Konar. “It is hard for students to complete their work, maintain their grades and do extracurricular activities.”"}, {"text": "Overwhelming stress can lead to temporary, or even permanent, mental health problems."}, {"text": "“Through our lifetime we all have been through mental health problems,” said MaryAnn Giambagno, one of the nurses at South who is in support of promoting mental health around the school. “That’s one of the most important things. It affects everybody. We all go through it and we shouldn’t feel like there’s a stigma to mental health.”"}, {"text": "Throughout the years, a dangerous stigma has developed against people suffering from mental health disorders and it can stop them from getting the medical attention that they need to overcome these disorders."}, {"text": "According to David Satcher, the U.S. Surgeon General in 1999, stigma is “perhaps the biggest barrier to mental health care; this stigma manifests particularly in a phenomenon known as social distancing, whereby people with mental issues are more isolated from others.”"}, {"text": "Lack of general knowledge and support for mental health disorders has caused a barrier between people in need of help and access to this help."}, {"text": "“Recently, encouraging mental health has become more of a priority in schools because of how it affects so many people of every race, gender, and age,” said Ms. Giambagno. “Schools are becoming more aware of mental health and we promote it more.”"}, {"text": "In order to help shed light on mental health and ultimately destroy the stigma around it, resources are offered for South students."}, {"text": "“There is the Child Study Team, who work with students who are in the Special Education program. They are fantastic, knowledgeable support and resources,” explained Chelsea Allen, Student Assistance Counselor."}, {"text": "“I am available to work with any student in the building on non-academic issues. I talk with students about everything from a concern about a friend, to family issues, to what healthy relationships are, to drugs and alcohol.”"}, {"text": "A lesser known resource for students is the relaxation chair in the back of the nurse’s office, where a student can go for a few minutes of peace and quiet to calm down and destress their mind."}, {"text": "There is also a full-time therapist from Rutgers, Mary-Kate Harty, who is available in the Main Office.\nThe school nurses, teachers, trusted adults and friends are great people to talk to. It is important to remember that regardless of what stress you are going through, there is always someone willing to help."}, {"text": "“I believe that the more supportive we can be of each other, the better the high school experience will be,” said Ms. Allen. “When we offer support and acceptance, we are helping to create a more positive school climate and culture, and an overall healthier community. It sounds like a simple thing, but it can do a lot of good.”"}], "file_structural_elements": {"title": "Staying in the right headspace: the importance of mental health", "date": "February 13, 2020", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "It is said that the key to a happy life is a harmonious mind and soul. According to Romeo Vitelli, a psychology doctorate from York University, too much stress can “lead to negative emotions such as depression or anxiety [and] can also have a negative impact on the cardiac, endocrine, metabolic, and", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/Untitled431_20200211121742-900x876.jpg"}}