{"tree_elements": [{"text": "While many countries celebrate the new year on Jan. 1, many countries in East Asia observe the turn of the new year between late January and early February. Households are decorated with red and golden banners and lanterns, dishes are prepared, and family members have hopes of good luck and success to celebrate the Lunar New Year, or Chinese New Year as it is commonly called. This year saw the Chinese community gathered with their families on Jan. 31 and celebrated the Lunar New Year on Feb. 1. During this holiday, families and friends celebrate Chinese culture with a variety of traditions, pay respects to their ancestors, and wish good fortune and prosperity to each other."}, {"text": "When asked about their reasons for celebrating, senior Julie Zhou said, “The same reason people celebrate the new year in general: spending time with close ones, appreciating and acknowledging new beginnings and endings, etc. The Lunar New Year is more important to me culturally, but in reality, I hold it to a similar standing as regular New Years.”"}, {"text": "Sophomore Benjamin Liang said, “It’s a holiday, like Christmas or Easter. Christmas is a Christian holiday but non-Christians still celebrate it, so non-Asians can celebrate Lunar New Year.”"}, {"text": "Traditionally, most families meet together on New Year’s Eve. After New Year’s day, families that follow stricter traditions spend several days  continuing the celebrations, such as attending the Lantern Festival and personal family activities."}, {"text": "“When I get to go back to China, we make dumplings together and 放烟花 (fàng yānhuā/light fireworks),” junior Naomi Lyu said in both English and simplified Chinese. “We watch the spring festival gala together. 初一要摆果盘，因为会有亲戚来访 (on the first day of the new year, we set out a plate of fruit for visiting relatives).”"}, {"text": "Among those traditions is a reunion dinner that takes place during New Year’s Eve. During this dinner, family members feast on various Chinese dishes that each represent blessings for the New Year. One of the most common dishes are oranges, which are considered lucky fruit because of their rich golden color and roundness, as well as the similarities in the Mandarin word for orange and success (橙chéngzi and 成chénggōng)."}, {"text": "“We prepare many different types of food,” Chinese teacher Jume Shen said. “Most food has some symbolic meaning, like if you eat fish (鱼 yú), you will have extra (余 yú).”"}, {"text": "In other words, fish is known for bringing surpluses of everything in the new year. Noodles symbolize long life because of their length, and dumplings bring greater wealth because of the shape they share with Chinese gold ingots."}, {"text": "“It’s sort of like a new point in the year where it’s common for us to get a new start,” junior Arthur You said."}, {"text": "*link to='https://www.travelchinaguide.com/intro/social_customs/zodiac/tiger/'*Travel China Guide*/link*"}, {"text": "“The tiger is mighty and strong,” Ms. Shen said. “So wishing everybody the Year of the Tiger will bring you a very strong year. Strong in every aspect.”"}, {"text": "Though the separation is difficult, families have harnessed their strength to continue celebrations with their loved ones, joining video calls with their relatives, participating in smaller-scale activities, and exchanging good wishes with each other."}, {"text": "Freshman Julie Cai said, “The importance of celebrating Lunar New Year with my friends and family is to appreciate how lucky we are to have each other so that we can celebrate together.”"}, {"text": "IMAGE BY ISHANI KONAR"}, {"text": ""}], "file_structural_elements": {"title": "Strength in Celebration: the Lunar New Year", "date": "March 17, 2022", "writer": {"x0qtq92usjgRms9hU9NA": {"name": "Alexander Chang", "year": "2021"}}, "description": "    While many countries celebrate the new year on Jan. 1, many countries in East Asia observe the turn of the new year between late January and early February. Households are decorated with red and golden banners and lanterns, dishes are prepared, and family members have hopes of good luck and succ", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/image1.png"}}