{"tree_elements": [{"text": "Ever since March 13, 2020 the first day of quarantine, everything has changed. Students and staff went from in-person to online classes overnight. School-wide events, like pep rallies, used to take place at the gym, but now take place over a computer screen."}, {"text": "Despite the circumstances, the South community has been working hard to make the best of this situation. The student council specifically has been working day and night to make this year count."}, {"text": "“We’ve tried to make sure that this year is as fun and exciting as the past years have been and we hope that this is the case as the year goes by,” said junior student council representative Sayee Naresh."}, {"text": "Although it has been tough, the student council has been doing their best to keep school spirit alive during the pandemic."}, {"text": "“So far the freshman council has done a Halloween costume contest, class rally, and talked to all the ninth grade language arts classes!” said freshman class president Henna Sharma. “The Student Council has also done a trivia night.”"}, {"text": "Similar to other extracurricular activities, a lot has changed for the student council since beginning in this virtual environment."}, {"text": "“Since we’re virtual, we have Zoom calls for our meetings and discuss anything important,” said Naresh. “Trivia night was a new event. We’ve never done this, at least in the three years I’ve been a student council representative.”"}, {"text": "Adjusting to these new changes has been a challenge for everyone. But, the student council has been working hard to keep school spirit alive."}, {"text": "“As a student council representative, we must keep the spirits of our fellow peers up high all the time!” said junior student council representative Ovya Kumar. “And so, as of right now, we are planning out another fun event very much similar to trivia night, but I won’t spoil anything!”"}, {"text": "“This year due to the pandemic a lot of things have changed, especially the way things are now done in student council,” said Kumar. “But after all, we are [the] student council, and we know how to overcome tough situations and make the most out of every situation.”"}], "file_structural_elements": {"title": "Student Council: Maintaining socially distanced South spirit", "date": "January 12, 2021", "writer": {"yCkJnR93m7cf2NvYleFK": {"name": "Mahek Upadhyay", "year": "2020"}}, "description": "\nRelated Stories\nNovember State of Ship Address summary\n\n\n\n     Ever since March 13, 2020 the first day of quarantine, everything has changed. Students and staff went from in-person to online classes overnight. School-wide events, like pep rallies, used to take place at the gym, but now take place o", "image": null}}