{"tree_elements": [{"text": "We have our burdens. Whether family issues or academic stressors, the loads we carry follow us through the doors of South. If left unattended, they’ll weigh us down, relentlessly pulling our attention away from tests, conversations, and daily lives."}, {"text": "Luckily, for South students, there is an unloading spot right at the center of our school. In the guidance office sits Ms.Allen, our school’s very own student assistance counselor who specializes in shedding some of this heavy burden."}, {"text": "“I’m trained to work with students on social and emotional things, so the way I say it is the non-academic things that are impacting students’ ability to focus and do what they want to be able to do in school,” Ms. Allen said."}, {"text": "When she was a student at Princeton High School, she felt, firsthand, how important this role was to students."}, {"text": "“I was a student when I was in high school who could have really benefited from having someone to talk to and I found that person in my art teacher. I knew how much she mattered to me and I really felt safe with her. So thinking back on my own high school experience, knowing I might be that person for some kids really drew me to this,” Ms. Allen said."}, {"text": "Ms. Allen went on to study Sociology as an undergraduate student where she then narrowed down her passions to two tentative requirements: working with teenagers and working in a school."}, {"text": "Fortunately, after studying School Counseling and Student Assistance Coordinating in Graduate school, she found her niche as a student assistance counselor where she continues to help students address their relationship issues, manage overwhelming stress and anxiety, coping with grief and loss, or handling drug and alcohol problems."}, {"text": "But despite Ms. Allen’s extensive knowledge of providing support, a lot of students don’t seem to take advantage of this."}, {"text": "“There are more times than I would like where I meet a 12th grader for the first time, and they tell me that they have been wanting to make an appointment with me since 9th, 10th or 11th grade, but for whatever reasons have not done so,” said Ms. Allen."}, {"text": "Due partly to South’s competitive nature and an innate tendency to maintain self-sufficiency, a lot of students do not seek outside help as often as they should. A lot of students opt for closer connections such as their friends and families when it comes to overcoming personal obstacles or life challenges. But sometimes, there may be a better option."}, {"text": "“It’s important to have friends and family that you can talk to, that you can support and be supported by. But sometimes, it can be super useful to talk to someone who’s not emotionally attached and can be a neutral listener,” Ms. Allen said."}, {"text": "If you go to Ms. Allen’s office for help, you will find that she is more than just a listener but also someone who can provide direction."}, {"text": "“I can help people figure out what’s in their control, what’s not in their control, and focus on their own path as opposed to always feeling that comparison,” Ms. Allen said, “I really try to work with students on what they enjoy doing, what is realistic for them, what are the other things in their lives that are going on, and how they can set themselves up to do well both academically and also emotionally.”"}, {"text": "Help is never too far out of reach. If you take a seat in Ms. Allen’s room, you might just be surprised by the amount of clarity and comfort a simple conversation can bring. As Ms. Allen said, “every single human benefits from talking about what’s going on in their lives.”"}, {"text": ""}], "file_structural_elements": {"title": "Student Assistance Counselor: Ms. Chelsea Allen", "date": "November 17, 2022", "writer": {"oZGSQKPCWdIpU60HDHNu": {"name": "Vivian Xie", "year": "2022"}}, "description": "     We have our burdens. Whether family issues or academic stressors, the loads we carry follow us through the doors of South. If left unattended, they’ll weigh us down, relentlessly pulling our attention away from tests, conversations, and daily lives.\n     Luckily, for South students, there is an", "image": "https://thepirateseye.org/wp-content/uploads/2022/11/2021-2-rotated.jpg"}}