{"tree_elements": [{"text": "Tired after soccer practice, hungry after debate club, or just craving mangoes? The students of South have a new place to relax: dessert restaurant Mango Mango."}, {"text": "Mango Mango, at 64 Princeton Hightstown Rd, opened this August, and the place has become popular among teenagers. “I know there’s a rush right after school, and a lot of students come then,” said waitress Katherine Young. The proximity to South, decor and uniqueness of Mango Mango seemed to be the frontrunners while we explored what makes this restaurant so special."}, {"text": "As we walked in, we entered a lively atmosphere, filled with bright modern furniture, catchy music, and striking decor. Almost immediately, Katherine presented us with eye-catching menus, complete with pictures of colorful and appetizing desserts and drinks."}, {"text": "When Mango Mango opened, Natasha Chaturvedi (‘25) said, “Everyone started talking about it.” She said it quickly became the ‘we have to go there’ place which is what drew her to the restaurant. ”People go on dates and stuff over there.” Overall, students spoke quite highly of the restaurant and pointed out certain noteworthy aspects of it."}, {"text": "“I like how close it is to South. Pretty easy to get to. [And] it’s with a lot of other restaurants,” said Ben Trokenheim (‘23)."}, {"text": "But, the quick walk from South isn’t the only allure of Mango Mango. Sharanya Mittal (‘26) said, “The atmosphere, I feel like was the best part of the restaurant” Many students agreed that one of the main reasons they went to Mango Mango was its ambience. Sophie Tsai (‘26) said,“The decor was really pretty. It was a very welcoming environment–it was really cutesy.”"}, {"text": "While the “cutesy” mango chair outside the restaurant might bring customers in, does the food keep them there?"}, {"text": "Students seem to have mixed opinions about this. Grace Kang (‘26) said,“[It’s] a good restaurant to me,” and said she liked most of the dishes she ordered. But Yash Mittal (‘26) said “the food was overpriced."}, {"text": "After listening to the views of others, it was time for us to see what Mango Mango really was for ourselves."}, {"text": "We ordered three dishes: brown sugar milk tea, special mango juice sago & pomelo with mango ice cream, and mango mille crêpe cake, all crowd favorites according to our waitress."}, {"text": "The first detail we noticed about the food when it arrived, was its elaborate presentation. Each plate was distinctly decorated and definitely Instagram worthy."}, {"text": "Being boba fanatics, we had high expectations for the Brown Sugar Milk Tea, and it did not disappoint. Although it was more milky than other boba places in the area, it was still thoroughly enjoyable. Living up to its name, the sugary drink set the bar high for the other desserts."}, {"text": "Next was the Special Mango Juice Sago & Pomelo with Mango Ice Cream, also known as the A1– one of their signature desserts. Unique and overflowing with the flavor of mango, this dish was a blast of fruity flavor in our mouths and was the perfect mix of sweet mango ice cream and slightly sour mango chunks."}, {"text": "At first, we were skeptical of the various ingredients used, but after taking a bite, we just couldn’t put our spoons down."}, {"text": "We moved on to the bestseller, the Mango Mille Crêpe Cake. Out of three, the presentation of the crêpe was the most impressive, and the variety of textures made for an adventure in our mouths. Though it was a little heavy and definitely too much for one person, it was the highlight of our meal."}, {"text": "Mango Mango has earned its spot next to everyone’s favorites, Woo-ri Mart and Aljons. Not only is it a great place to hang out after school, but it also serves top-notch dishes and has an inviting environment."}, {"text": "Although there are several other popular dishes which we didn’t get to try, such as the Mango with Sticky Rice, the Mango Mochi and the other bobas, we will definitely go back to have them. Receiving frequent visits from South students, including us, and other residents, Mango Mango is sure to see a good future in West Windsor."}, {"text": ""}], "file_structural_elements": {"title": "Taste of Mangoes", "date": "November 17, 2022", "writer": {"rX3hx9WOOLdUxxe9lrqF": {"name": "Nirati Iyer", "year": "2022"}, "5Sse8M0fpDIfezMBAk38": {"name": "Vrinda Chandnani", "year": "2022"}}, "description": "     Tired after soccer practice, hungry after debate club, or just craving mangoes? The students of South have a new place to relax: dessert restaurant Mango Mango.\n     Mango Mango, at 64 Princeton Hightstown Rd, opened this August, and the place has become popular among teenagers. “I know there’s", "image": "https://thepirateseye.org/wp-content/uploads/2022/11/Mango-Mango-900x489.jpg"}}