{"tree_elements": [{"text": "“I love you, a bushel and a peck,” Nathan Detroit said in a heavy New York accent, and added frustrated, “that lousy Joey Biltmore.”"}, {"text": "On March 5–7, South held the spring musical, “Guys and Dolls,” a comedy written in the 1950s. The musical is about the main character Nathan Detroit, a gambler played by junior John Kiernan. Detroit, despite his fiancée not being too keen on his craps games, makes a bet with Sky Masterson. Masterson is known for winning bets, yet Detroit makes one with him because he is desperate to make money. He needs this money to pay for a place to play one of his craps games. Detroit bets that Masterson won’t be able to take Sarah Brown, an uptight missionary, on a date, but Masterson wins. Brown is upset when she finds out about the bet, and Masterrson ends up paying the money to Detroit even though he won."}, {"text": "Freshman Hope Pandolpho, assistant student producer, said, “The musical highlights Nathan’s 14-year long engagement with Adelaide, Sarah and Sky’s growing love for each other, and so many romantic and serious moments.”"}, {"text": "In preparation for the performances, students spent a week working tirelessly to perfect the play. The week is known as “tech week,” short for technology week. Everyday after school, students spend hours working as late as 10 p.m. and attended rehearsals held on Saturday during that week."}, {"text": "Sophomore Mary Nielsen, a member of the props department in the backstage crew, said, “Tech week is when everything starts to come together: the show is run with the Pit Orchestra, while the Lighting/Sound crew and A-Team (backstage crew) work out any issues that arise.” Sophomore Isabella Wolohan, assistant stage manager, said, “It’s like crunch time when we just run the show over and over again to smooth out transitions and give the new actors a real time example of how an actual show would run.”"}, {"text": "Pandolpho said, “We have to manage schoolwork at the same time and only have our free time during rehearsal to work on it.”"}, {"text": "Preparations leading up to the performances are hectic, but, Wolohan said, “I love it. In the end, it’s all worth it.”"}], "file_structural_elements": {"title": "Technology week: a hectic time in preparations for South’s musical", "date": "May 13, 2020", "writer": {"we7vkttcBDgDzl3L9ds6": {"name": "Apsara Saraswat", "year": "2019"}}, "description": "     “I love you, a bushel and a peck,” Nathan Detroit said in a heavy New York accent, and added frustrated, “that lousy Joey Biltmore.”\n      On March 5–7, South held the spring musical, “Guys and Dolls,” a comedy written in the 1950s. The musical is about the main character Nathan Detroit, a gamb", "image": null}}