{"tree_elements": [{"text": "Imagine this. You wake up, put your headphones on and open Spotify, not to listen to music, but to your daily morning podcast while heading to school. This is what many people in our community undertake to start their morning. Not only do they love to listen to podcasts, but they have podcasts of their own."}, {"text": "Podcasts, which is shorthand for Personal on Demand Broadcast, are audio files on the internet which are easily accessible on different media websites. 144 million Americans listen to podcasts, according to the statistica.com. Compared to 2018, today 20 million more Americans listen to podcasts. Podcasts are hosted by an individual or a group of people who lead a conversation, report news, share stories and opinions. Podcasts can be enjoyable since they create a personal connection through the audio experience–the hosts voice and background music–something that is lost in visual media."}, {"text": "According to an article in the May 2020 issue of Vogue by Devika Manghnani, “A good podcast can help you deal with a lot of issues and if you’re looking for one that can help you unwind and relax, calming podcasts can help.”"}, {"text": "Meditation, sports, and comedy podcasts can help reduce stress in your brain. According to Medical News Today, studies show that oxytocin can reduce stress and anxiety. Making meditation podcasts a perfect way to ease up."}, {"text": "An article from Vast, ‘The Benefits Of Listening to Podcasts’ proves that podcasts stimulate mental imagery more intensely than watching or reading, and cause listeners to have to pay more attention. This allows listeners to be able to visualize and use their imagination to their highest capability."}, {"text": "Biology teacher Ms. Jennifer Bridgewater said, “Podcasts that I listen to can impact my brain because I’m learning new things, hearing new perspectives, challenging what I know, and hearing about the journeys, perspectives and stories of diverse groups of people."}, {"text": "One podcast is “Let’s break it down” hosted by Freshman Dharma Rajesh and Saanvi Puri, spontaneously started this podcast so they can discuss riveting topics. “We discuss women entrepreneurs in certain fields, how they got to where they are today and give advice to teenage girls,”Rajesh said."}, {"text": "This is an impressive way to spread awareness on something that may not be talked about as much as it should be. I personally have always liked to listen to podcasts, especially ones that include personal anecdotes. I shared this with my best friend, Ahana Joshi, and she thought the same. At that time, we wanted a platform to share our thoughts and ideas. When we found an ad on Spotify about podcasts, we decided to give it a go. We started our own podcast called “This is Life By Sana Manchanda and Ahana Joshi.”"}, {"text": "We started about a year ago. We continued it for about five months but unfortunately got busy with schoolwork so we took a break. This January, after almost a year, we decided to come back to it and take it a lot more seriously."}, {"text": "We wanted to focus on like feminism, one of our episodes, where we got to talk about a topic we were passionate about."}, {"text": ""}, {"text": "Now, we can continue to discuss topics we want to share with others because it is fun and enthralling."}, {"text": "My co-creator said about our podcast, “It’s a power outlet where I get to talk about different issues with my best friend which is so cool.”"}, {"text": "Podcasts are a way to connect with people and boost your mood. They release oxytocin and help you relax while listening to a meditation podcast, give you an adrenaline boost from your favorite true crime podcast or boost your endorphins with a comedy podcast."}, {"text": "“I may not listen to many podcasts but now I can’t wait to start!” said freshman Isla Levy."}, {"text": "DRAWING BY SANA MANCHANDA"}], "file_structural_elements": {"title": "The era of audio: Podcasts", "date": "March 30, 2022", "writer": {"ZSFFpdQWjszDdCIoro8x": {"name": "Sana Manchanda", "year": "2021"}}, "description": "    Imagine this. You wake up, put your headphones on and open Spotify, not to listen to music, but to your daily morning podcast while heading to school. This is what many people in our community undertake to start their morning. Not only do they love to listen to podcasts, but they have podcasts o", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/Screenshot-2022-03-30-2.22.11-PM.png"}}