{"tree_elements": [{"text": "A 10-minute drive northwest of South, on Nassau Street and tucked in an alleyway is a local gem called Milk & Cookies. A haven for cookie connoisseurs, it has been attracting young and old since it opened in the fall of 2016 with its tempting smell of freshly baked cookies."}, {"text": "With the holidays just around the corner, Milk & Cookies is just the place to visit, a place  with festive cheer and delicious holiday treats."}, {"text": "“It’s a pretty, quaint, little shop,” said Rakiya Hassan, a sophomore,  who recently took her first trip to Milk & Cookies. “It felt pretty cozy.”"}, {"text": "Lauren Ariev Gellman, founder, owner and baker of Milk & Cookies, combined her love for baking and wanting to create a place to touch people’s hearts with  the nostalgic snack of milk and cookies. Gellman developed her passion for baking at a young age. “My grandmother was a very good baker. I’d bake with her,” Gellman said ."}, {"text": "With her early training with her grandmother’s, Gellman today has created a menu that offers cookie flavors for everyone: from classics like the chocolate chip to some more unusual one, such as lavender, Mexican hot chocolate, sunbutter, and lemon poppy. As the holiday season arrives, Milk & Cookies also offers a variety of holiday-themed treats, such as confetti and peppermint bark."}, {"text": "“You can just tell that there is a lot of care put in their work and the presentation on them is amazing, too,” said Hassan."}, {"text": "Less than four years after founding her business, Gellman found herself facing the coronavirus pandemic. She was living the nightmare of every small business owner. Her shop was empty, with few orders coming in, leading to a significantly decreased profit with no end in sight. Unable to pay rent, Gellman asked for help."}, {"text": "“I did get some payment protection loans and some specific COVID grants,” said Gellman."}, {"text": "Gellman was one of the many small business owners who were helped by the first round of government-provided stimulus packages to help alleviate the effects of the pandemic. Businesses like Gellman’s are going to further receive help.  According to NBC News, on Dec. 20, Congress reached an agreement on a $900 billion relief package, $284 billion of which was dedicated to businesses around the nation."}, {"text": "Determined to not let the pandemic damage her business, Gellman installed hand sanitizers, drastically reduced her store’s capacity and provided the option of contactless payment. “No one is eating in the shop,” said Gellman."}, {"text": "Hassan said that only one group is allowed to enter the store at a time to pick their order up to lower the spread of COVID-19. In response to customers reluctant to enter the shop, Gellman offers curbside pickup."}, {"text": "Hassan said, “There are ways that you can safely shop. So you can support these businesses and get a little bit of something out of it for yourself while staying safe.”"}, {"text": "So far, with the help from the government and the community, Gellman was able to retain her entire staff, keep her shop open and continue to spread holiday cheer even through the pandemic."}, {"text": ""}], "file_structural_elements": {"title": "The season of giving…. and cookies", "date": "December 24, 2020", "writer": {"q6Q38H1MOB4iX1yvzBi4": {"name": "Dahria Charadnichenka", "year": "2020"}, "yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "     A 10-minute drive northwest of South, on Nassau Street and tucked in an alleyway is a local gem called Milk & Cookies. A haven for cookie connoisseurs, it has been attracting young and old since it opened in the fall of 2016 with its tempting smell of freshly baked cookies.\n     With the holida", "image": null}}