{"tree_elements": [{"text": "When I created my social media accounts in middle school, I became one of 854.5 million accounts on Instagram, one of 249 million Snapchat users and one of 2.7 billion accounts on Facebook. Social media became an easy outlet to connect with friends and display important moments of my life. I would rely on social media to keep myself updated with friends’ and celebrities’ lives, entering the bubble of late-night scrolling before sleep and unknowingly accumulating my daily screen time."}, {"text": "Many teenagers face the same problems and have become more reliant on social media. With the rise of technology use, younger generations are beginning to develop unhealthy relationships with technology: this is a social dilemma."}, {"text": "Currently, 84 percent of all teenagers have a cell phone. In a 2020 survey by the Stata corporation, a modern leader in data analysis and statistical software, found that Snapchat was the most popular social media app among teens and roughly three billion “snaps,” pictures or videos, were sent daily."}, {"text": "Netflix’s original documentary “The Social Dilemma” highlights the algorithms of social media and underlying motives tailored towards users on social media platforms such as YouTube, Instagram, Facebook and Snapchat. The documentary, published in Jan. 2020, includes interviews with famous web developers who share covert information about the logistics involved in creating social media apps and the addictive nature of these apps."}, {"text": "At first, social media seems beneficial, automatically linking people with old friends and sharing important memories. However, social media can become harmful once it exploits its users. As explained in the documentary, social media acts as a mass surveillance service, monitoring users online and trying to profit off of them."}, {"text": "An interview with Tristan Harris, a former design ethicist for Google from the “Social Dilemma” documentary, said, “If you are not paying for the product, you are the product.” In other words, on social media, there are advertisers who compete to grab users’ attention in an attempt to sway them to purchase an item or change their viewpoints."}, {"text": "The digital footprints that people leave are closely tracked through microphones in phones and computers and can be used to the seller’s advantage. Junior Rebecca Han said, “One time I talked about getting a dog with my family. So, I searched up pictures of dogs that were cute. The very next day I saw dog adoption advertisements all over my Instagram.”"}, {"text": "Professor Shoshano Zuboff, author of the book The Age of Surveillance, explained this phenomenon in the film.  He described social media as a marketplace that was specifically trading human attention and money."}, {"text": "When told about social media’s algorithm in attempting to maintain the user’s attention, Han said, “I was unaware of all the hidden impacts of social media. I’ll have to be more alert from now on.” After working for the most successful and wealthy technological companies, many employees are astonished to hear the brutal truth behind their employer’s choices. Harris claims that people are unaware that Silicon Valley tech companies are competing against each other for people’s attention, a valuable prize in today’s day and age. In fact, Harris said, “Social media isn’t a tool that’s just waiting to be used. It has its own goals and it has its own means of pursuing them by using your psychology against you.”"}, {"text": "According to the Washington Post, teens spend an average of seven hours and twenty-two minutes every day on their phones, not including homework time."}, {"text": "Senior Claire Yin said, “I’m on my phone for three hours every day and although I wish to reduce my screen time, at least my time is below the national average.” Similar to Claire, many South students have reported using their phones for longer durations during quarantine."}, {"text": "South students need to recognize that there is so much more to life than just the feed of other people’s lives on a phone screen. Keeping up with social media can be an excellent outlet to connect with others, especially during the pandemic; however, social media use should be monitored."}, {"text": "Not only has social media become time-consuming, but social media has also been shown to deteriorate teenagers’ mental health. In the documentary, NYU professor Jonathan Haidt found an increase in depression and anxiety among pre-teens because of the constant comparisons they make between themselves and the people they see on their social media feed."}, {"text": "“I definitely have compared myself with others, but at the end of the day, I think it’s important to know that posts on social media are people’s best versions of themselves,” said senior Saru Daway.  “People just have to learn to have self-love and know their self-worth. It takes time to do that and it can be very harmful to kids who are still younger.”"}, {"text": "Understanding that social media represents only a small facet of somebody’s life can reduce the negative effect of this social dilemma."}, {"text": "Although Yin has not watched “The Social Dilemma” yet, she is motivated to limit her screen time and use her social media time for other activities."}, {"text": "Despite the benefits of social media and connecting with friends online, knowing how to manage your digital use is beneficial not only to your physical health but also to your mental health."}, {"text": "“The Social Dilemma” is one of the most informative films of 2020, revealing the truth behind social media platforms that so many students use daily. Even in this virtual setting, we must remember to value our lives outside the screen."}, {"text": ""}], "file_structural_elements": {"title": "The Social Dilemma: Reminding us that there is more to our lives than just a screen", "date": "March 11, 2021", "writer": {"IEgx27jeMWPMtV0BxA2O": {"name": "Melissa Liu", "year": "2021"}}, "description": "     When I created my social media accounts in middle school, I became one of 854.5 million accounts on Instagram, one of 249 million Snapchat users and one of 2.7 billion accounts on Facebook. Social media became an easy outlet to connect with friends and display important moments of my life. I wo", "image": null}}