{"tree_elements": [{"text": "No idea what to do this summer? Here are our six recommendations to ensure that this summer is one for the books. Enjoy and live the summer to the fullest!"}, {"text": ""}, {"text": "1. Camden Aquarium"}, {"text": "Home to the largest collection of sharks on the East Coast, Camden Aquarium is a fan favorite. You can enjoy exhibitions like Little Blue Beach, home to some of the cutest penguins in the world. This family-friendly attraction features exhibits where visitors can come face-to-face with turtles, stingrays, and many more!"}, {"text": "2. American Dream Mall"}, {"text": "American Dream Mall is truly a dream! Its attractions include DreamWorks Water Park, Nickelodeon Universe Theme Park, Mini Golf, an ice skating rink, Legoland, and even a wave pool! If your mom wants to go shopping but you want to go swimming, this mall is the the one for you!"}, {"text": "3. Six Flags"}, {"text": "Located in Jackson, New Jersey, Six Flags is one of the most visited and popular attractions among not only adolescents but also adults. With over 800 rides, 120 roller coasters, and specialized events like Fright-Fest, this amusement park has something for everyone. Despite the heat and occasionally long lines, it is definitely worth the wait!"}, {"text": "4. Cape May County Park and Zoo"}, {"text": "With over 550 birds and animals from nearly 200 different species, Cape May County Park and Zoo is the perfect place to hit up this summer, especially for families. Enjoy a peaceful picnic in the zoo’s"}, {"text": "well-maintained and extensive gardens or head to the nature trails and bike paths for some amazing sights. And of course, have a great time as you explore more than 85 acres of beautiful exhibits."}, {"text": "5. Lucy the Elephant"}, {"text": "If you want to experience a special elephant, visit Lucy the Elephant. Lucy is the eleventh tallest statue in the country, standing at 65-feet tall and is considered a national historic landmark. Additionally, this wonder is located right by the beach, so you have ample time to cool off by the ocean breeze after spending some time with Lucy!"}, {"text": "6. Thomas Edison’s House"}, {"text": "Ever visited the house of the guy who invented the lightbulb? Well, this is your summer to do it! Thomas Edison’s house is located less than 20 minutes away from South. Although one is not permitted to enter due to different tenants residing inside at the moment, the house is a historical wonder and is worth appreciating from the outside."}], "file_structural_elements": {"title": "Things to do over the summer", "date": "July 7, 2022", "writer": {"NOlffvh7x2ouyJpAMrkO": {"name": "Arishtha Dey", "year": "2021"}, "h9Cb7CTjUobs8x6jzw69": {"name": "Pranavi Sagi", "year": "2021"}}, "description": "     No idea what to do this summer? Here are our six recommendations to ensure that this summer is one for the books. Enjoy and live the summer to the fullest!\n \n1. Camden Aquarium\nHome to the largest collection of sharks on the East Coast, Camden Aquarium is a fan favorite. You can enjoy exhibitio", "image": null}}