{"tree_elements": [{"text": "What better way to pass a Friday after school with friends than at the new Thomas Sweet Cafe? I decided to do just this with my friend, sophomore Sayee Sanjana Naresh."}, {"text": "The ice cream cafe opened in early June in Windsor Plaza, which also includes PJ’s Pancake House, Aljons, Woo-Ri-Mart and other stores. The Plaza is a popular location for South students to hang out with their friends, especially after school and during lunch because it’s a walking distance from school.\nThomas Sweet opened in Princeton in 1979. Ever since, it has been a public favorite for its ice cream. 79 percent of all South students who have been to Thomas Sweet at West Windsor and Princeton said that they order ice cream or sundaes from the shop."}, {"text": "The Thomas Sweet at West Windsor offers more food options than the original shop at Princeton, such as salads, soups, sandwiches, baked goods and beverages. But the ice cream is its main draw.\nWhat makes Thomas Sweet ice cream so popular?"}, {"text": "Harrison Calvin, a staff worker at Thomas Sweet said, “We make our ice cream in store at Princeton. We put in a lot more pure ingredients and it makes the ice cream higher quality and creamier.”\nWith a variety of flavors to choose from, Naresh and I couldn’t decide on the ice cream flavors for our sundaes and opted to taste test some flavors."}, {"text": "We first began with a taste of Midnight Jersey Shore which, according to Calvin, was the most popular flavor. On our first bite, we were pleased and surprised by how delicious it tasted. Pieces of brownies were mixed in with chocolate ice cream."}, {"text": "As we tried more flavors, we relished the rich and creamy texture. Flavors such as vanilla and chocolate were not too sweet. Naresh said that the ice cream tasted homestyle."}, {"text": "Plain Chocolate was sweet yet slightly bitter. Flavors with toppings, like chocolate chip and Midnight Jersey Shore, were more bland because the ice cream flavor came from the toppings."}, {"text": "Of all the flavors we tasted, Naresh preferred Nutella ice cream and said it paired well with the other flavors in the sundae."}, {"text": "I liked the strawberry ice cream best. The flavor was a perfect blend of sour and sweet and there were pieces of strawberry embedded in the ice cream. These tart pieces contrasted pleasingly with the sweet ice cream."}, {"text": "But even better than the strawberry flavor was plain vanilla. Since I was a kid, when I went to an ice cream shop, I almost always ordered vanilla. Most vanilla ice creams are plain, overly sweet and have a watery texture. But Thomas Sweet’s vanilla was not very sweet and the flavor had hints of tartness. The texture was really rich, creamy and reminded me of my childhood."}, {"text": "As for the cost of the sundaes, for high school students the sundae was a little expensive, but it had three heaping scoops of ice cream, a hot and a cold topping of choice and perfect to share with a friend.\nThomas Sweet is a great place to go to relax and enjoy ice cream, especially after a long day at school."}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Thomas Sweet Cafe opens in West Windsor Plaza", "date": "November 1, 2019", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "What better way to pass a Friday after school with friends than at the new Thomas Sweet Cafe? I decided to do just this with my friend, sophomore Sayee Sanjana Naresh.\nThe ice cream cafe opened in early June in Windsor Plaza, which also includes PJ’s Pancake House, Aljons, Woo-Ri-Mart and other stor", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/Ice-cream-Cone.jpg-klfdas.jpg"}}