{"tree_elements": [{"text": "It is 3:17 a.m. and many students are still wide awake. They sit at their desks, their ten unfinished assignments haunting them while the seconds tick by. As seconds become hours, their slight anxiety turns into full-blown panic. “How am I going to finish all this work by tomorrow?” they wonder."}, {"text": "Ever since schools have reopened in September, students nationwide have been struggling with their workload. Although this was typical for high school students prior to quarantine, virtual learning has made procrastination worse. The sheer amount of applications such as Zoom, Google Meet, Google Classroom, G-Mail and others have been overwhelming to students. However, managing time better can help struggling students complete their work in a timely manner."}, {"text": "Freshman Vedant Makkar said, “Virtual learning makes us slack here and there, such as going on a phone during class when we’re supposed to be doing work.”"}, {"text": "In addition to allowing for distractions during class, virtual learning has also produced an excess of schoolwork, which some students are having a hard time completing. All assignments feel like more work since students are taking their classes virtually at home. “It’s so hard to keep up with all the homework,” said freshman Jaspreet Soni."}, {"text": "Even through the schoolwork, distractions and emails students have been trying to adapt and learn the importance of managing their time. “Time management, in general, is an important skill because there are a lot of things that we have to do, but only so much time to do them,” said senior Tinney Mak. “This is particularly important during virtual learning because there are a lot more distractions at home than there are at school.”"}, {"text": "Many students have also learned the importance as Mak did and reached out to staff members for help."}, {"text": "“Some skills to work on to help manage time include organization, prioritizing what needs to get done, setting clear goals, communication, effective planning and managing stress,” said guidance counselor Michelle Walsh."}, {"text": "Along with the advice of teachers and counselors, students have found their own methods that have helped them stay on track."}, {"text": "“I like to work for 30 minutes, then take a ten-minute break,” said Makkar. “Doing this allows me to stay motivated since I look forward to the time off.”"}, {"text": "Similar to Makkar’s method, other students have shared what they use in order to best accomplish their individual goals."}, {"text": "Gathering advice from counselors and upperclassmen, here are five ways to manage time better during this virtual learning period:"}, {"text": "“Almost all of these tips have worked for me, especially keeping an agenda,” said Soni. “It makes my life so much easier since I always know exactly what homework I have to complete.”"}, {"text": "Staying up till 3:17 a.m. shouldn’t be the norm. Like Soni, using these five methods can support and ensure the production of effortless virtual learning. As Ms. Walsh said, “Work smarter not harder!”"}, {"text": ""}], "file_structural_elements": {"title": "Time management tips for virtual learning", "date": "January 12, 2021", "writer": {"NOlffvh7x2ouyJpAMrkO": {"name": "Arishtha Dey", "year": "2021"}}, "description": "\nRelated Stories\n Coping with school-related stress during the pandemic\n\nMental health during quarantine\n\n\n\n     It is 3:17 a.m. and many students are still wide awake. They sit at their desks, their ten unfinished assignments haunting them while the seconds tick by. As seconds become hours, their s", "image": null}}