{"tree_elements": [{"text": "During the holidays, students and staff members were eager to reenact what is an annual tradition in many households: dressing in winter PJ’s, holding a cup of hot chocolate with marshmallows, snuggling on the couch with a warm blanket and watching their favorite holiday classics. Below is a list of the South’s top ten holiday classics of all time."}, {"text": "1. Home Alone"}, {"text": "A perfect holiday movie from 1990, “Home Alone” not only combines humor with the Christmas spirit, it appeals to children, parents, and grandparents. “Just a fantastic movie that’s on TV way too much!” said coach Bryan Fisher. This movie and its sequels are overwhelmingly loved during the holidays."}, {"text": "2. The Grinch"}, {"text": "What a pity that Netflix only brings back “The Grinch” around the holiday season because it would be a hit all year round. Originally a children’s book by Dr. Seuss, the movie version of the book tugs viewers’ emotions and leaves them content at the end. Viewers also develop sympathy with minor characters such as Cindy Lou."}, {"text": "3. Polar Express"}, {"text": "This movie takes the viewers on a wild adventure to the North Pole and back. The film was impressively the first all-motion capture film ever made, although many viewers weren’t delighted with this animation. “Although I liked the plot of the movie, I couldn’t get past the animations, which were almost zombie-like,” said freshman Anjali Goswami. Nonetheless, with the theme of making younger kids believe in Santa, this movie has become a timeless holiday classic."}, {"text": "4. Elf"}, {"text": "An iconic movie like “Elf” can only be described as a one-of-a-kind comedy that is sure to bring a smile to everyone’s face. The story follows a lone elf wandering about the streets of New York City in hopes to spread Christmas cheer, is more heartwarming than any Christmas bonfire. Students fondly recalled nostalgic memories of watching this movie. “I remember watching this movie with my sister when I was five and that was probably one of my favorite memories with her ever,” said senior Eva Zecchini."}, {"text": "5. The Nightmare Before Christmas"}, {"text": "Considered a scary movie for children but a favorite among teenagers and young adults, this movie is the perfect transition from the spooky season of Halloween to the coziness and joy of the holidays. But, for some, the transition is not smooth enough. “I never really felt like it looked Christmasy enough,” said teacher Kerry Kemo. Regardless, it goes without saying that director Tim Burton’s distinctive eerie style of portraying his characters adds an even spookier touch to the film. If you’re not feeling the Christmas spirit, take a trip to Christmas Town with Jack Skellington and welcome Christmas back to your home!"}, {"text": "6. Miracle on 34th Street"}, {"text": "Although this movie is wonderful, its basic plotline execution did not stand a chance among the movies on our list. But, this movie has left its mark on the world as it has become a tradition to air it on television after Macy’s annual Thanksgiving Parade."}, {"text": "7. A Christmas Carol"}, {"text": "Based on the book by Charles Dickens, “A Christmas Carol” manages to tug on our heartstrings and really teach us the importance of being kind to each other. In this film, Jim Carrey plays the miserable Ebenezer Scrooge, who believes Christmas isn’t a special holiday and berates anyone (including his own nephew) for believing otherwise. After a wild encounter with ghosts, Scrooge is taken on a journey of self discovery. “All time favorite, gotta watch every year,” said Mr. Fisher. This movie will remain on every list, even as newer movies are released, due to its connection to the book and everlasting legacy."}, {"text": "8. Princess Switch"}, {"text": "Although this trilogy may have only become popular due to the inclusion of Vanessa Hudgens, the movie made a name for itself without her as well. Similar to “Parent Trap,” this series creates organized chaos by consistently increasing the amount of roles played by Hudgens, with the most recent addition to the series having her play three different roles. This movie, however, appeals mostly to the younger generation and struggles to keep older generations engaged. This movie is a favorite for many and will continue to remain on the list for years to come!"}, {"text": "9. Christmas Chronicles"}, {"text": "With its twists and turns, this movie is sure to bring a smile to your face. After two siblings’ plan to capture Santa Claus on camera goes awry, they pull the ultimate all-nighter to save Christmas. With its fast-paced plot, this movie is sure to keep viewers engaged. Yet at times, the flow of the movie appears to falter as some scenes seem to be cut short while others are never-ending. But, the movie is still one of the best on Netflix and we highly recommend that you give this iconic flick a watch."}, {"text": "10. Noelle"}, {"text": "This movie — although not as memorable as the others on this list — is a tale of love, adversity and the power of the holiday spirit. Serving as a sequel to “Miracle on 34th Street,” this movie fell short of the charm of the original. If it had included Kris Kingle in some form, the movie may have ranked higher. Even so, “Noelle” is a beautiful new movie which navigates complicated family relationships."}, {"text": "IMAGE BY VIVIAN XIE"}, {"text": ""}], "file_structural_elements": {"title": "Top 10 holiday movies", "date": "January 18, 2022", "writer": {"NOlffvh7x2ouyJpAMrkO": {"name": "Arishtha Dey", "year": "2021"}, "h9Cb7CTjUobs8x6jzw69": {"name": "Pranavi Sagi", "year": "2021"}}, "description": "During the holidays, students and staff members were eager to reenact what is an annual tradition in many households: dressing in winter PJ’s, holding a cup of hot chocolate with marshmallows, snuggling on the couch with a warm blanket and watching their favorite holiday classics. Below is a list of", "image": "https://thepirateseye.org/wp-content/uploads/2022/01/IMG_1006-900x600.jpg"}}