{"tree_elements": [{"text": "Before the coronavirus pandemic, “Homecoming was just amazing,” senior Aaheli Konar said. “Every day, you’d look forward to going to the pep rallies and at the end of the week, you’d stay after school and watch races. I’m going to miss this event even after I leave South.”"}, {"text": "In a typical year, in the week leading up to the Homecoming dance, the school organizes fun events like Spirit Week and voting for the Homecoming Court. But this year, not only were Spirit Week and Homecoming Court (changed to Captain’s Crew) virtual, but the Homecoming dance was canceled."}, {"text": "Undaunted, the Student Council worked hard to make this year memorable and keep students and staff at South smiling."}, {"text": "The four grade levels had a heated competition for who had the most spirit during Spirit Week. This year’s themes were movies such as Harry Potter and Monsters Inc."}, {"text": "Student Council president Vinayak Nair announced each day’s results in the morning announcements. This year, the seniors came in first place, the freshman second, juniors third and the sophomores last."}, {"text": "Another event that usually contributes to the overall Spirit Week scores is pep rallies."}, {"text": "During pep rallies, grade levels compete with each other to be crowned the winner. “We had different types of races in the gym,” said Konar. “It was amazing because it was more than just a race–the whole school came together.”"}, {"text": "The pep rally and Homecoming football game were canceled this year to ensure the safety of students and staff."}, {"text": "Another tradition that looked different this year was hallway decorations. Ordinarily, before Homecoming, each grade decorated the school with colored butcher paper, posters and chalk, to make the school festive with their class color."}, {"text": "“The decorations are mind-blowing. The amount of effort that students put into it is so great. Like the whole school changes. It feels like walking into Disneyland,” said Konar."}, {"text": "The hallway decorations were still a big component of Homecoming. Students of all grade levels, both hybrid and virtual,  if they chose, came into school and created amazing drawings inside and on the glass doors of the building."}, {"text": "Like the decorations, the Homecoming Court was different compared to prior years."}, {"text": "Matthew Coburn, social studies teacher and student council adviser, explained that  Homecoming Court, which traditionally had a king and queen, would be called Captain’s Crew to allow more students to be celebrated and recognized. On Nov. 20, the winners of the Captain’s Crew were announced. They were seniors Harrison Young, Joshua Samuel, Ana Stucker and Vinayak Nair."}, {"text": "Senior Trisha Murali reflected on her memories about high school and Homecoming, “Even if you don’t know each other, you get to talk with other kids and sometimes even make friends! Homecoming means unity and friendship to me. We might not know each other but we’re all South pirates!”"}, {"text": ""}, {"text": "PHOTO COURTESY OF STUDENT COUNCIL."}], "file_structural_elements": {"title": "Virtual Homecoming", "date": "December 22, 2020", "writer": {"h6LJRFoJDlU8899sJKNW": {"name": "Ishani Konar", "year": "2022"}, "aqqY9AKHEOy9aI6zwCiS": {"name": "Kavya Katkuri", "year": "2021"}}, "description": "     Before the coronavirus pandemic, “Homecoming was just amazing,” senior Aaheli Konar said. “Every day, you’d look forward to going to the pep rallies and at the end of the week, you’d stay after school and watch races. I’m going to miss this event even after I leave South.” \n    In a typical yea", "image": "https://thepirateseye.org/wp-content/uploads/2020/12/Homecoming.jpg"}}