{"tree_elements": [{"text": "“The best part about virtual learning is that I don’t have to wait in line for the copier machines anymore,” American Studies teacher Matthew Coburn said."}, {"text": "As we are in the midst of a different school year, both hybrid and virtual classrooms are thrown into a new state of adapting, learning and bonding. The South community has found new ways to adapt well-loved traditions, like Homecoming and Halloween. Students and teachers are adjusting to the changes and technological challenges, simultaneously trying to maintain a sense of normalcy in the middle of a pandemic. Teachers in particular are facing unique challenges and are working hard to ensure that students’ quality of education are not compromised. Because of their current situation, teacher perspectives are important now, more than ever."}, {"text": "Since most classes are on Zoom, World History teacher Sydney Miller feels that technology is essential but can be finicky during lessons. “It can be really difficult to help a student who cannot connect to the Zoom call while also continuing a lesson.” Miller said."}, {"text": "Along with Ms.Miller, Mr. Coburn finds that technology is often troublesome and the problems he encounters often include dysfunctional microphones or glitchy screens."}, {"text": "Another challenge for teachers is keeping students engaged. “Students struggle the most with getting to have the connections with their teachers and peers they have grown so accustomed to in previous years,” said Mr. Coburn. “You cannot recreate the school classroom atmosphere and everything that goes on within it in the virtual world.”"}, {"text": "AP Psychology teacher, Mary Jenoriki, feels the same way. “It is very hard to gauge whether or not they are understanding the new concepts. When I’m in the classroom, it is much easier to assess whether students understand, whereas on Zoom, I’m finding it really difficult.” Jenoriki said."}, {"text": "Teachers also feel that there are fewer opportunities to interact with their students in a virtual setting. International Business and Culture and American Studies teacher, Brad Borsuk, is one of the teachers who feels that this has impacted his teaching experience. His favorite aspects about teaching, like socializing and creating bonds with his students, have become less attainable. Mr. Borsuk said, “It is much harder to know students, because there isn’t a chance of seeing kids interact with each other, and there isn’t an opportunity to just walk around and start up random conversations.”"}, {"text": "Geometry and Precalculus teacher, Jeannine Yorke, agreed. “For as much as we try to build a connection with them virtually, I feel as though I can foster a much stronger student-teacher relationship while having them present in class.  I miss the noise, the interactions, the participation (that is not just typing in the chat) and seeing the excitement on their faces when a concept that they’ve been struggling with ‘clicks.’”"}, {"text": "Despite these challenges, teachers are working hard to maintain an effective learning environment for students."}, {"text": "“Students should know that teachers were not trained to do this, but we have taken initiative to learn how to do our best during this time,” Concert Band teacher Jesse Argenziano said. “Integrity is very important for all of us and teachers are here to help show you how to survive in today’s world.”"}, {"text": "Mr. Coburn agrees that students and teachers should strive to understand each other. “Teachers have been teaching for a long time and put a ton of effort into their lessons. Now, being virtual, we are forced to re-learn our profession and re-do our work. Be patient and be understanding. It’s all new to everybody.”"}, {"text": "Mr. Borsuk described our circumstances with an analogy: “We are simply making lemonade out of lemons.” And he said one day, the pandemic will be over."}, {"text": "When in-person school is the norm again, teachers like Ms. Miller and Mr. Borsuk look forward to forming stronger connections with students and getting to see their faces.  But until that time comes, we have to persist in virtual/hybrid learning."}, {"text": "How do we cope with this new normal? “Stay positive, focused, ready in the morning so you are in the right mindset to learn, no matter how redundant things may become.” said Mr. Argenziano."}, {"text": "Mr. Coburn said,  “COVID will eventually end, so don’t lose sight of the light at the end of this pandemic tunnel. We are all in this together and therefore we will all get through it together. No one is alone.”"}, {"text": "Image by Karen Yang"}], "file_structural_elements": {"title": "Virtual schooling through the eyes of teachers", "date": "December 7, 2020", "writer": {"mmPM0AAOdiQuDZH4MUVF": {"name": "Karen Yang", "year": "2022"}}, "description": "      “The best part about virtual learning is that I don’t have to wait in line for the copier machines anymore,” American Studies teacher Matthew Coburn said. \n     As we are in the midst of a different school year, both hybrid and virtual classrooms are thrown into a new state of adapting, learni", "image": "https://thepirateseye.org/wp-content/uploads/2020/12/Screen-Shot-2020-10-11-at-2.08.30-PM-888x900.png"}}