{"tree_elements": [{"text": "Anthony Jones is the first Diversity, Equity and Inclusivity Coordinator in our district. In the following Q & A, I interviewed Mr. Jones to learn more about him and the newly created position."}, {"text": ""}, {"text": "What is your role in our community as the Diversity, Equity and Inclusivity Coordinator?"}, {"text": "Students, community members, parents, teachers and faculty want to have a voice. My role from day one has been to listen to people and the questions they have about race, ethnicity, religion, gender, socioeconomic status, disability, mental health, whatever it is.  I think my role is really to listen."}, {"text": "The second part of the role is curriculum and professional development. For example, I examine some of the curriculum practices of Language Arts or Social Studies departments and figure out how they could best represent the community. That could mean, for example, adding more books representing South Asian, African-American, Latinx and LGBTQ voices."}, {"text": "The current perception of what is being read is that you’re constantly being fed the classics and it’s only coming from one point of view. There’s this Ted Talk I recommend watching called “The danger of a single story” by Chimamanda Ngozi Adichie.  Adichie shows how when you come at life from just one perspective, it can be really dangerous because you’re not really seeing the other person’s perspective."}, {"text": "And then there’s professional development: I think one of the things that teachers have expressed, especially if they’re not coming from certain communities, is, “How do we actually teach it?”  My role is not only to offer that professional development but also to offer the faculty and staff a place where they can feel safe and talk about race."}, {"text": "And that is something I’m really concentrated on working towards. If you consider yourself South Asian but you’re not seeing anything in the curriculum that represents you, not only does it hurt you, but I think it also hurts everyone else because then they don’t know about the culture of the people that make up this community."}, {"text": ""}, {"text": "Have you ever held a position like this before?"}, {"text": "I’ve been an educator for the last 15 years. So, coming from New York City, I was very blessed and privileged to be able to grow up in a very diverse community: my classmates were white, Indian and East Asian. One of the byproducts of growing up in New York is that it’s a lot different than the suburbs. So for me, it’s something that I’ve always been comfortable with."}, {"text": "The role that really shaped me was working at Columbia University, where I worked with students that were not typically in the majority. My students were African-American, Latinx, coming from situations that looked different than their classmates."}, {"text": "I worked in a program where we would bring in high school and middle school students to the Columbia campus. Usually, they were first-generation students: their parents came from different countries and they didn’t know what college was about. This is an example of what equity work looks like–offering opportunities to parents and students for whom English was not their first language."}, {"text": "I’ve also worked at Rutgers Camden, Rutgers Newark and Trenton for different organizations. I think all of those areas have shaped me for this role at WWPRSD of fighting for the underdog, fighting for students and parents that don’t have a voice."}, {"text": "And the greatest part of that role is when you see a student that you’ve had in high school or middle school again, and they say, “Hey, Mr. Jones, thank you so much.”  Hearing that, you know you really have changed their trajectory."}, {"text": "So that’s why I’m passionate about diversity, equity and inclusivity."}, {"text": ""}, {"text": "Are there upcoming events that we can look forward to as students, staff and faculty?"}, {"text": "First and foremost, I want to use the district website and other media to create a space where students can go to find out about events related to equity, diversity and inclusivity."}, {"text": "I also want to create a video of student voices, since it’s important to hear students perspectives.  There was a convocation video at the start of the year, and I would love to do a part two and talk about where we are at the start of the end of the year."}, {"text": "A lot of my goals are centered around professional development with teachers: How are they talking about mental health? How are they talking about race in schools? And giving them more tools to be able to do that."}, {"text": "I also want to do a conference — that’s an important goal of mine — where it’s student-led and where we as faculty and staff can come in and learn from the younger generation."}, {"text": "I also work with alumni. There are some alumni from WWPRSD who’ve expressed interest in mentoring and talking to high school and middle school students, not only about their college experience but also about identity and any issues related to the work that we’re all interested in."}, {"text": "If someone wants to  learn more about racial justice, what resources would you recommend to them?"}, {"text": "Always start from a reflection of where you’re at. I think sometimes it’s always important to look within your own culture and see who has made that mark in the area of social justice, like Dr. Martin Luther King and Mohandas K. Gandhi."}, {"text": "But, I think it also transcends race and religion. What Gandhi or King did were amazing things, but who did Gandhi and King learn from? These ideas came from somewhere."}, {"text": "So continue to read books and reach out to different teachers and see what they say as well. One of the most popular books is “How to Be Antiracist” by Dr. Ibram X. Kendi. The book “So You Want to Talk about Race” by Ijeoma Oluo is also very informative."}, {"text": "Another good place to start with is looking at it from different lenses. Some people might not identify with the African-American experience. They might identify with the Caribbean experience or with the Indian experience. Some with a woman’s experience.  So try out different lenses to enrich your perspective."}, {"text": ""}, {"text": "What do you picture for WWPRSD’s future?"}, {"text": "I hope for a future where students can come back in five years and say, “Hey, I set the groundwork for mental health, or introduced more literature that represents the WWPRSD student body and really see it in place.”  I want students to come back and say, “This is what I worked on and implemented and it’s affecting the younger generation.”"}, {"text": "Conflict is normal, especially in high school, but you want to be able to have these conversations regarding racial and social conflicts. That’s an important piece."}, {"text": "Do you have any advice for WWPRSD students?"}, {"text": "I always say to WWPRSD students that this is everybody’s work. I want everyone to feel invested in the work and continue to have a voice. It could be through poetry, singing, or basketball. I think everybody has a platform to discuss the issues or challenges that they go through."}, {"text": "For example, there are a few athletes that have actually started to come out and say, ” I struggle with this.” I think that showing that vulnerability helps so many other people open up, too. So my advice would be: Just continue to use whatever platform you have as students, continue to strive. Also know that there are people rooting for you and that, if there’s anything bothering you or you want to talk, there’s always someone that you can go to."}, {"text": "Photo courtesy of Anthony Jones."}], "file_structural_elements": {"title": "Welcome, Anthony Jones!", "date": "February 4, 2021", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "     Anthony Jones is the first Diversity, Equity and Inclusivity Coordinator in our district. In the following Q & A, I interviewed Mr. Jones to learn more about him and the newly created position.  \n \nWhat is your role in our community as the Diversity, Equity and Inclusivity Coordinator?\n     Stu", "image": "https://thepirateseye.org/wp-content/uploads/2021/02/BEA31C68-EDB1-4ECF-800B-465ADF91B03A-900x529.jpeg"}}