{"tree_elements": [{"text": "A lot has changed since we went into quarantine on March 13: hangouts are on Google, traveling is non-existent and “closed” signs are displayed in windows of restaurants, malls and other businesses all across the state. But in this time of wearing surgical masks, thorough hand washing, constantly using hand sanitizer and keeping six-feet apart, we must remember that this, too, shall pass."}, {"text": "It’s a simple yet wise phrase that caught my eye when I read psychotherapist Ashley Davis Bush’s “The Little Book of Inner Peace” in February. Bush is an author, a grief counselor and a Reiki master with more than 30 years of experience in the mental health field. In her book, she provides many ways for her audience to relax, unwind and adopt a more peaceful lifestyle. Out of all the methods she presents, “this too shall pass” was one of the techniques that stuck with me the most, and I have used it to create a space of calm during this unusual time."}, {"text": "The origin of “this too shall pass” is commonly thought to come from the Bible. But, historians believe that the phrase actually originates from 13th century Persia, where it was sung by Sufi artists like Rumi and Attar. The saying comes from a story about a king who grieved his wife and firstborn’s death. Desperate, he asked the men in his court to find him a ring that would guide him through the ups and downs of his life."}, {"text": "One day, a wise man presented him a ring inscribed with the phrase “this too shall pass.” Bush writes,“The king kept the ring and reflected upon the inscription when he was in triumph, so that his ego was not too large. When he was in trouble, he read and reflected on the words, so that his heart was not too heavy. These words did, in fact, provide a guiding light for him as he ruled. . .”"}, {"text": "Just as the phrase helped the Persian king find sustenance after great loss, so too can this evergreen phrase guide us through times like these."}, {"text": "Bush suggests using this phrase as a mantra for reflection. Here is her technique in four simple steps:"}, {"text": "Bush’s technique has helped me during quarantine. When I miss my friends or want to physically be in and enjoy school, I follow Bush’s lead and read the short and powerful chapter about this phrase."}, {"text": "“Everything is changing all the time,” Bush says. “The problems of your present will fade into the past. And the joys you experience will change over time, too.”"}, {"text": "These are words I will remember as our world begins to slowly open up again."}, {"text": ""}], "file_structural_elements": {"title": "Words of wisdom: “This too shall pass”", "date": "June 15, 2020", "writer": {"22LFbhDaaLDkiDFX4uv8": {"name": "Tanvi Singh", "year": "2020"}}, "description": "A lot has changed since we went into quarantine on March 13: hangouts are on Google, traveling is non-existent and “closed” signs are displayed in windows of restaurants, malls and other businesses all across the state. But in this time of wearing surgical masks, thorough hand washing, constantly us", "image": null}}