{"tree_elements": [{"text": "Lil Uzi Vert, famous American rapper, singer and songwriter, announced his retirement  from music on Jan. 11, 2019 via his Instagram account, leaving fans startled."}, {"text": "Many believe the two-time Grammy nominee’s early retirement was the result of the rapper’s struggles with his label Atlantic Records. The rapper’s decision to step down from music has impacted his large fan following, and will lead to the disappearance of a prominent and innovative musician."}, {"text": "Lil Uzi explained his rationale on Instagram with the caption “I wanna take the time out to say I thank each and every one of my supporters but I’m done with music…I deleted everything. I wanna be normal…I wanna wake up in 2013.”"}, {"text": "His 2016 single “Money Longer” has been certified platinum two-times in the United States along with “The Perfect Luv Tape” certified Gold by the Recording Industry Association of America. Complex Magazine called him “one of those names to pay attention to in 2016”; in 2018, the rapper was nominated for two Grammys- ‘Best New Artist’ and ‘Best Rap Performance.’"}, {"text": "Seniors Nikitha Gadangi and Manya Mehta were lucky enough to see Uzi before his retirement at a Travis Scott concert where he performed as a guest. Gadangi describes Uzi as “a pioneer for new school rock that brought a lot to the table for rappers.” She says seeing him perform live was “amazing” and describes the the rapper as have a special kind of energy. She’s continues “I have never felt that energy from any rapper before at a concert.”"}, {"text": "Mehta says “[E]ven though he was a [guest]  performer, it felt like his concert while he was on stage.”"}, {"text": "The rapper seemed to have his career well under control, showcasing his talent to the world, but Uzi’s career was far from perfect."}, {"text": "Uzi has been outspoken about the tensions with his label— specifically starting in April 2017 when he expressed concern about  the delayed release of his album, “Luv Is Rage 2”. Towards the end of last year, Uzi alluded to his troubles with Atlantic Records in a song with rapper Shabazz PBG’s single “Shells.” Many have interpreted the line “Tryna figure out how I’m gon’ get out my deal” as an allusion to the struggle between the rapper and the label."}, {"text": "In his retirement announcement, Lil Uzi Vert further elaborated on his career complications. “You think I don’t wanna drop music?” he writes on his Instagram story. “You just gotta understand, when people don’t love you, they’ll hold your life if you sign a [contract]…hold it against you.”"}, {"text": "Despite Uzi’s remarks about feeling creatively restricted by Atlantic Records, they have not spoken out regarding the issue or his retirement in general."}, {"text": "The early retirement of Uzi has been a shock to fans. Senior Aditi Pal, a long time fan, shares what the news was like to hear. “Hearing about [Uzi] quitting music was really crazy. Especially because I had been waiting for his album for so long.” She said, “I think Atlantic Records is at fault and is keeping an artist from doing their job.”"}, {"text": "Yet despite quitting the industry, Lil Uzi made a surprise appearance to perform at Lil Baby’s Philadelphia show on Jan. 26. Though the appearance made fans hopeful for his return, Uzi restated that his exit from the music world  was not a publicity stunt. “Still retired only come out for the guys,” he explained on Instagram."}, {"text": "But fans are waiting to see if the artist will make a return eventually."}], "file_structural_elements": {"title": "XO retirement life: Lil Uzi quits music", "date": "March 28, 2019", "writer": {"818DmKSTZB84ddo0ViFd": {"name": "Maanya Narain", "year": "2018"}}, "description": "     Lil Uzi Vert, famous American rapper, singer and songwriter, announced his retirement  from music on Jan. 11, 2019 via his Instagram account, leaving fans startled.\n     Many believe the two-time Grammy nominee’s early retirement was the result of the rapper’s struggles with his label Atlantic ", "image": "https://thepirateseye.org/wp-content/uploads/2019/03/lil-uzi-vert-777x900.png"}}