{"tree_elements": [{"text": "“I learned I’m a lot tougher than I think,” said Eugenia Ma (‘20) reflecting on her role as co editor-in-chief (EIC) of the Pirate’s Eye. It was stressful at times, but also a rewarding experience. “Deadlines and assignments will weather you down, but you’re tough enough to push through.”"}, {"text": "I recently reached out to last year’s Pirate’s Eye Editor-In-Chiefs (EICs) Gauri Nema and Eugenia Ma  and asked what advice they’d give to high school students."}, {"text": "Nema attends Boston University and follows the hybrid model, but most of her classes are held virtually. She is currently in West Windsor for Thanksgiving break. Inspired by her experiences growing up and her experience at South, Nema is majoring in International Relations. She explains that she often moved when she was young."}, {"text": "“Moving around made me realize how much I liked learning about different cultures and regions.” Even as a high school student, she loved history classes such as Advanced Placement United States History and Comparative Government. She also joined the staff of the Pirate’s Eye since her freshman year."}, {"text": "Reflecting back on her years on the Pirate’s Eye, Nema said that the collaborative editing process helped prepare her for college."}, {"text": "“I think at college it definitely helped me in a lot of my writing classes and all of the essays that I have to write for school,” Nema said. “Peer-editing was a big part of some of my classes in college” She also plans to write for her college publication, The Daily Free Press, in her next semester. For the first part of the year, she wanted to focus on managing her routine."}, {"text": "Nema urges incoming college freshmen to take the time to adjust to the new environment."}, {"text": "“Make sure you’re not overloading yourself on extracurricular activities, because you want to give yourself time to adjust and take in every moment that you’re experiencing,” Nema said."}, {"text": "Ma attends Wellesley College in Massachusetts and is staying on campus, but will return home for winter break and study online afterward. She has not chosen her major but is interested in English."}, {"text": "Ma notes that her experience staying on campus has not changed very much since the pandemic has taken effect, but her college has taken measures to ensure students are safe."}, {"text": "“Seating in classes is spaced out so we’re all six feet apart, we have the option to learn online and we have to wear masks outside of our rooms,” Ma said."}, {"text": "Regarding her experience as an EIC for the Pirate’s Eye, Ma explains that it helped her learn more about herself and her work ethic. She was able to push herself to complete deadlines."}, {"text": "“I was stressed but everything worked out.”  Ma said, “Trust yourself!”"}], "file_structural_elements": {"title": "Year in review: Catching up with the 2019-20 EICs", "date": "December 22, 2020", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "    “I learned I’m a lot tougher than I think,” said Eugenia Ma (‘20) reflecting on her role as co editor-in-chief (EIC) of the Pirate’s Eye. It was stressful at times, but also a rewarding experience. “Deadlines and assignments will weather you down, but you’re tough enough to push through.”\n    I ", "image": null}}