{"tree_elements": [{"text": "Lilly Singh, also known as IISuperwomanII, has evolved from being a Youtube megastar with twelve million subscribers to a host on her own late-night talk show on NBC, “A Little Late With Lilly Singh,” which airs at 1:35 a.m. for 30 minutes."}, {"text": "Lilly Singh, one of the original YouTubers, started posting comedy sketches on Youtube in 2010, only five years after Youtube was launched in May of 2005."}, {"text": "Nine years and thousands of videos after her debut, NBC chose her to replace Carson Daly’s late-night talk show following his retirement. Singh is the first bisexual woman of color to host a late-night show. The opening episode aired Sept. 16."}, {"text": "Trisha Murali, a junior at South, believes that Singh’s wants to use her late-night platform to make “people feel represented.”"}, {"text": "Murali said that she feels connected to Singh. “Her jokes are relatable, and they’re funny even if some are not relatable” because of her talent as a comedian. Comedy bridges differences."}, {"text": "However, Singh has faced backlash over some of her jokes about her heritage and other racial jokes.\nJunior Vividha Venkatrajan said, “I see how her comments could have been insensitive, but I don’t think that she made these comments with any malicious intent.”"}, {"text": "Murali said that Singh is still learning how to present herself on a professional talk show, which is a less scripted platform than Youtube. “I think when it comes to some parts of the show, it’s just awkward. But she just started with her show. She’s still learning,” said Murali."}, {"text": "Both Murali and Venkatrajan, believe that Singh has a long way to go in perfecting her show, but that she is on the right path."}, {"text": "Both juniors learned about Singh by watching her on Youtube.\nMurali has been watching Singh on Youtube for the past year and a half and was eager to watch Singh’s show once it premiered in September."}, {"text": "When Murali saw “A Little Late With Lilly Singh,” she decided that she liked Singh’s Youtube videos better because her content was so creative."}, {"text": "“In the show, she’s trying to follow guidelines of running a proper late-night show, but on her channel, she expresses herself more and has that sense of individuality,” Murali said."}, {"text": "Venkatrajan, on the other hand, has been watching Singh’s videos since 6th grade. Venkatrajan was especially drawn to Singh’s personality."}, {"text": "“I loved how blunt and honest she is about life. She has the guts to say and do the things that no one else does,” said Venkatrajan. Some examples of her bold personality are her YouTube videos such as, “A Therapy Session For Homophobic People,” and “The Truth About YouTubers in 2017,” where she explains the sponsorship deals some YouTube influencers have made."}, {"text": "Venkatrajan believes Singh should return to YouTube. “I think that she is more relatable and funny in her videos than in her talk show and should continue to explore her YouTube career,” said Venkatrajan.\nSingh has many titles: a YouTuber, an influencer, a motivational speaker, a talk-show host. All of them come with the responsibility of representing her complex identities–she is an Canadian-American of Punjabi heritage and, recently, she came out as bisexual."}, {"text": "“Singh herself is full of personality,” said Murali. This will attract both former YouTube fans and new viewers across America."}, {"text": "IMAGE BY ISHITA JADON"}], "file_structural_elements": {"title": "YouTube to NBC: Will Lilly Singh be able to maintain her success?", "date": "November 1, 2019", "writer": {"PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "Lilly Singh, also known as IISuperwomanII, has evolved from being a Youtube megastar with twelve million subscribers to a host on her own late-night talk show on NBC, “A Little Late With Lilly Singh,” which airs at 1:35 a.m. for 30 minutes.\nLilly Singh, one of the original YouTubers, started posting", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/Final-Lilly-Singh-Mug-824x900.jpg"}}