{"tree_elements": [{"text": "*link to='https://thepirateseye.org/2200/opinion/a-pre-covid-style-holiday/'*A Pre-Covid Style Holiday*/link*"}, {"text": "My traditional holiday experience includes a large family-style feast, bundling up with friends and family around the fireplace and giving my grandparents a big kiss on the cheek after opening my presents. But this year, due to the pandemic, we all need to follow safety regulations to keep everyone safe."}, {"text": "This year, WW-P students will have their winter break from Dec. 24 to Jan. 2. Our diverse community has students celebrating many holidays this December such as Christmas, Kwanzaa and Hanukkah. Already, South students have joined in on quarantine efforts during the holidays."}, {"text": "Senior Skyler Simon said, “During the holidays, I usually go to my relative’s house but this year I am staying in and socially distancing with my friends.”"}, {"text": "In order to keep socially distant but still have fun, some families will be celebrating the holidays via Zoom. Because of their high popularity during the holiday season, Zoom will be lifting their 40-minute limit so families can celebrate without paying for the premium membership."}, {"text": "Senior Mia Fremder said, “For the holidays, my family and I are going to be eating a big feast while using Zoom so it feels like we are actually eating with them.”"}, {"text": "Other families are having small gatherings while practicing social distancing to maintain some normalcy during the holiday season."}, {"text": "*link to='https://www.mayoclinic.org/diseases-conditions/coronavirus/in-depth/covid-19-holiday-safety-tips/art-20503363'*Mayoclinic*/link*"}, {"text": "“During Christmas day and New Year’s Eve I am going to be staying in and watching movies with my mom, dad and sister,” Simon said. “Other years I would go out with my friends on New Year’s Eve but I am trying to stay safe from contracting the virus.”"}, {"text": "*link to='https://www.cdc.gov/coronavirus/2019-ncov/daily-life-coping/holidays.html'*CDC*/link*"}, {"text": "Because the winter weather can be cold and unpredictable, it can be difficult to celebrate the holidays outdoors. Nonetheless, many families host holiday celebrations under pop-up air tents that have proper ventilation and heat."}, {"text": "“Whenever I have friends or family over, we use our clear pop up tent outside to keep people warm,” said Fremder. “The tent keeps the heat in and is circulated throughout the tent. We had our Hanukkah celebration with family outside with our tent.”"}, {"text": "Even with the modifications put in place to stay safe this holiday season, we can still make gingerbread houses, build snowmen, decorate a Christmas tree and light a Hanukkah Menorah; we can still have reunions via Zoom, send holiday cards and wish our friends and family a happy holiday season!"}, {"text": ""}], "file_structural_elements": {"title": "A COVID-19 style holiday", "date": "December 24, 2020", "writer": {"t1wNGC5vCu2m5zKSZgLI": {"name": "Sophia Englezos", "year": "2020"}}, "description": " \nRelated Stories\nA Pre-Covid Style Holiday\n\n\n\n    My traditional holiday experience includes a large family-style feast, bundling up with friends and family around the fireplace and giving my grandparents a big kiss on the cheek after opening my presents. But this year, due to the pandemic, we all ", "image": null}}