{"tree_elements": [{"text": "Before the COVID-19 pandemic, families were able to have large gatherings with other family members and friends, go out on vacation to exotic places, and go to amusement parks without a second thought. However, since the coronavirus pandemic started, lockdowns have been enforced, masks are required in public spaces and social distancing rules have been put in place since last March."}, {"text": "The holidays this year are very different from those of the previous years: people are social distancing, wearing masks, using hand sanitizers and staying at home more often than usual. Despite the restrictions this year, the holidays can still be celebrated in many ways and we can make the most of these two weeks before returning to school in the new 2021 year on Jan. 4."}, {"text": "With winter break coming up, South students were asked about their celebration of the holidays this year. How are the celebrations of this year’s holidays different from the previous years? When asked if the holidays will be celebrated virtually,  sophomore Aryan Deb said, “I’m not celebrating the holidays virtually. I’m spending time with my family at home.”"}, {"text": "Some South students are limiting gatherings as well. Sophomore Erica Lee said, “I am giving and receiving gifts from family and friends and probably dinner, too.”"}, {"text": "Sophomore Radhika Deshpande said, “I am just relaxing and you can’t really do much this year so I will probably just spend time with family and perhaps see some friends. Also, just take the time to focus on yourself and relax.”"}, {"text": "When asked about how the celebration of the holidays is different this year from previous years, Lee said, “It’s not much different but sometimes we travel to other countries.”"}, {"text": "When Lee was asked if she was enjoying the holidays this year or not, Lee said that she is enjoying the holidays this year because her parents feel bad for her and are pampering her by giving her everything on her Christmas list."}, {"text": "*link to='https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html'*measures*/link*"}, {"text": "*link to='https://stanfordhealthcare.org/doctors/w/dean-winslow.html'*Dean Winslow, MD*/link*"}, {"text": "Even though the holidays this year are restricted, it does not mean that the holidays cannot be enjoyed. South students are finding safe and innovative ways to celebrate the holidays with their loved ones.  Here are some examples of ways to make the holidays special even during the coronavirus pandemic: 1. You can bake delicious treats with your family members who stay at home with you; 2. you can virtually meet with family and friends via Zoom or any other technology that you use at home to virtually connect; 3. just remember to have fun and be grateful for what you have because the holidays are about giving and bringing happiness to everyone around you."}], "file_structural_elements": {"title": "A Pre-Covid Style Holiday", "date": "January 6, 2021", "writer": {"qwSEbaCBnPbIwsO0WXu3": {"name": "Prisha Priyadarshini", "year": "2022"}}, "description": "\nRelated Stories\nA COVID-19 style holiday\n\n\n\n     Before the COVID-19 pandemic, families were able to have large gatherings with other family members and friends, go out on vacation to exotic places, and go to amusement parks without a second thought. However, since the coronavirus pandemic started,", "image": null}}