{"tree_elements": [{"text": "On the spookiest day of the year, high schoolers face the question, “Am I too old to trick-or-treat?”"}, {"text": "I have great memories of Halloween from being a little kid going with my parents, to being with friends and running around all night on a sugar high. The streets were filled with all sorts of costumed kids on that same quest for candy."}, {"text": "Halloween is popular among children. But for teenagers, Halloween’s appeal has either changed or is still preserved as we get closer to adulthood each day. As I’ve gotten older Halloween has become less of a special occasion and more of an ordinary day."}, {"text": "Last year, according to USA Today online, Americans spent $10.14 billion on all things Halloween, costumes and decorations. The money spent is used to have a lasting effect for the next few weeks or even years for those that decide to celebrate Halloween."}, {"text": "On Oct. 31 plenty of people dressed up in some form. Mr. Matthew Coburn, a history teacher, said, “It’s a chance to be something that you normally are not and dress up as someone that you aren’t and just be different and there’s no risk to it because it’s the expectation.”"}, {"text": "Trick-or-treating has become a less important part of the holiday for many of us as  Halloween is now more of a special occasion to hang out with others and just enjoy the festivities of the evening."}, {"text": "“I haven’t participated in years,” Tristan Madampil (‘24) said, “but I’m probably gonna tag along with friends at the very least.”"}, {"text": "Mr. Coburn said “It’s like a culminating piece before you get to Thanksgiving break, where things start to slow down, because after that, and then you’re in November, sports starts to taper off, and you get that void between the fall and winter seasons. And really school just becomes traditional school thereafter.”"}, {"text": "As we mature and get closer to finishing high school, some of us have preserved our anticipation for October 31st. This feeling helps us connect to our younger selves and gives us an opportunity to escape and just have fun for a night with our friends."}, {"text": ""}], "file_structural_elements": {"title": "Are we too old for Halloween?", "date": "November 17, 2022", "writer": {"DQxuMRIBHUmdxqFGbMS4": {"name": "Connor Florendo", "year": "2022"}}, "description": "     On the spookiest day of the year, high schoolers face the question, “Am I too old to trick-or-treat?” \n     I have great memories of Halloween from being a little kid going with my parents, to being with friends and running around all night on a sugar high. The streets were filled with all sort", "image": "https://thepirateseye.org/wp-content/uploads/2022/11/p-e1668712970848-900x501.png"}}