{"tree_elements": [{"text": "More than 2 billion people worldwide are addicted to video games. 150 million of those are in the United States according to the Recovery Village, an addiction treatment center in Umatilla, Florida."}, {"text": "During the pandemic, gaming significantly increased globally as people had to be at home because of the pandemic. This increased boredom leading people towards different pastimes Some used gaming as a pastime or a way to connect with friends. Last year, South started an esports club. Video games, the ongoing addiction worldwide, is considered by most to have negative effects on health. But some hold the view that video games, played in limitation, are not all bad and can in fact have some social, emotional and also health benefits"}, {"text": "A common concern that parents share is the association of gaming and obesity, according to Dr. Ginspoon in his article “The health effects of too much gaming.” He explains that the association “ is due to the obvious phenomenon that if a teen is sitting in front of a screen for hours every day, he or she isn’t getting much exercise.” This also applies to watching television, and being on a phone or laptop for a long time."}, {"text": "Another common concern about playing video games is how it affects the gamer’s eyes. Dr. Ginspoon states in his article, “The most common vision problem is eye strain, which can lead to headaches and poor concentration.”"}, {"text": "“\n“You’re not going to become obese playing an hour of video games a day, you’re not going to lose your eyesight playing an hour of video games a day. But you’re going to be injured by anything if you do it in extreme.”\n— Dr. Heavers \n\n\n."}, {"text": "“You’re not going to become obese playing an hour of video games a day, you’re not going to lose your eyesight playing an hour of video games a day. But you’re going to be injured by anything if you do it in extreme.”"}, {"text": "— Dr. Heavers"}, {"text": "Doing anything extreme can cause injury. Video games can be detrimental but not if they are done in moderation. But is it possible that they can be good for us?"}, {"text": "How can video games be beneficial?"}, {"text": "There are some ways in which video games can help people. The first is that they are a way to connect with friends."}, {"text": "“I always felt like a sense of community with my friends being able to play with them online, hang out with them, talk to them,” said physical education teacher and advisor for the Esports club Mr. David Colon. “Back in the day people used to come over just to play video games and I still do that to this day.”"}, {"text": "Video games can help improve hand dexterity–ability of moving hands in a skillful and coordinated way to grasp and manipulate objects. The US National Library of Medicine National states that control-based games can be really good for hands."}, {"text": "Gamers also tend to be very good problem solvers. “You can learn different things with it,” said freshman Fairiah Begum FNU. “For example, patience and different skills like focusing, remembering and thinking fast.”"}, {"text": "*link to='https://www.apa.org/news/press/releases/2013/11/video-games'*American Psychological Association*/link*"}, {"text": "“Children who play strategy-based games show improvement in problem solving skills”"}, {"text": "“They increase the connections between dendrites and axons, you will be making all these connections, you will be physically making connections where your hands have to do something, your eyes are coordinating so you could definitely increase your eye and hand coordination,” said Dr. Heavers."}, {"text": "Gaming can be beneficial but moderation is the key. Freshman, Krivi Saikia, said, “If you’re playing video games all the time, of course it can be mentally detrimental.”"}, {"text": ""}, {"text": "IMAGE BY SHEFALI SAXENA"}], "file_structural_elements": {"title": "Are video games all bad?", "date": "May 5, 2022", "writer": {"XETo63LBGDzjNVJ1rC0Q": {"name": "Shefali Saxena", "year": "2021"}}, "description": "More than 2 billion people worldwide are addicted to video games. 150 million of those are in the United States according to the Recovery Village, an addiction treatment center in Umatilla, Florida.\nDuring the pandemic, gaming significantly increased globally as people had to be at home because of t", "image": "https://thepirateseye.org/wp-content/uploads/2022/04/Pink-and-Purple-Memphis-Gaming-Channel-Youtube-Channel-Art-1-900x506.png"}}