{"tree_elements": [{"text": "What comes to mind when you first think of Halloween? Costume parties? Scary movies? Delicious candy? For most, it’s trick-or-treating. But high school students are starting to wonder,”How old is too old to go trick-or-treating?”"}, {"text": "I believe high school students are too old to take part in this tradition, and others at South agree."}, {"text": "“I stopped going a few years ago,” said sophomore Rahul Datta. “I guess it just started to feel childish. I think after you reach high school, you start gaining responsibility, which is why I think that’s when it’s time to stop trick-or-treating.”"}, {"text": "Halloween has origins in Ireland and Scotland in a festival called Samhain. On this holiday, people put on costumes and light bonfires to ward off ghosts. Children go “souling,” visiting the houses of wealthy families in order to receive pastries or gifts. Souling is the traditional form of trick-or-treating and was reserved for children. Since souling was only for children, why isn’t this true for trick-or-treating today?"}, {"text": "While the debate regarding age restrictions on trick-or-treating has been ongoing in the U.S., some countries have made legal age restrictions for this activity. In 2005, cities in Canada banned teenagers over the age of 14 from trick-or-treating. Recently, this policy underwent revision, making the age restriction 16 and adding a fine for any violations."}, {"text": "As of 2018, towns across the U.S. have begun to adopt this regulation as well. In Chesapeake, Virginia, anyone over 12 caught trick-or-treating could face a fine or even a misdemeanor charge. Similar policies have been introduced in other towns, such as Meridian, Mississippi; Bishopville, South Carolina; and Boonsboro, Maryland."}, {"text": "West Windsor, Plainsboro, and neighboring areas don’t have such policies in place, but many teenagers have already stopped trick-or-treating. Those who still trick-or-treat plan stopping in the near future."}, {"text": "“I feel that I will stop trick-or-treating whenever I feel like I’ve outgrown it,” said freshman Naina Cheniara."}, {"text": "Cheniara isn’t the only one who feels this way. Senior Anitej Thamma said of freshmen, “I think [they] still have a few years before it becomes awkward. I plan on stopping when I graduate.”"}, {"text": "Whether or not you decide to stop trick-or-treating this year is up to you. But, current trends indicate that your trick-or-treating days may be coming to an end."}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Are high schoolers too old to trick-or-treat? – CON", "date": "November 1, 2019", "writer": {"LpDIeLwdu280NdPILdWj": {"name": "Ashna Garikapati", "year": "2020"}}, "description": "What comes to mind when you first think of Halloween? Costume parties? Scary movies? Delicious candy? For most, it’s trick-or-treating. But high school students are starting to wonder,”How old is too old to go trick-or-treating?”\nI believe high school students are too old to take part in this tradit", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/HalloweenWebsite.png"}}