{"tree_elements": [{"text": "Trick-or-treat!"}, {"text": "On Halloween, many kids go from door to door and fill their bags with candy. Neighbors see one another dressed up in costumes as the Halloween spirit is now in full swing. Amid the celebrations of the popular holiday, high schoolers are asking: Am I too old to trick-or-treat?"}, {"text": "Although some people believe that teens are too old to be trick-or-treating, this Halloween activity should be enjoyed by high schoolers and children alike. To put it simply, “there is no age limit for this holiday,” said junior Akshata Padalkar."}, {"text": "Halloween is a holiday to laugh with friends, spend time with family and interact with the community⁠— it is a celebration. High schoolers should be allowed to choose whether to go trick-or-treating or not. Senior Ryan Lee said, “Let people grow out of it themselves, it’s their choice.”"}, {"text": "Those who take part in trick-or-treating, whether giving out candy or collecting it, should not be restricted from the activity they enjoy."}, {"text": "“I think it is really fun to go trick-or-treating with my friends because I get to spend time with them,” said senior Anagha Brahmajosyula."}, {"text": "Why should the stigma of age stop high schoolers from having fun, the very purpose of the holiday?"}, {"text": "Trick-or-treating allows high schoolers to enjoy their free time and is designed to be stress-free."}, {"text": "Junior Vicky Liu said, “[It helps] take your mind off of other things and help[s] reduce stress by running around with friends and getting free food.”"}, {"text": "Trick-or-treating encourages “fun” and allows teens to have a moderate amount of eustress, good stress, in their system. According to Greater Good Magazine, a science-based magazine from UC Berkeley’s Greater Good Science Center, Halloween triggers shots of cortisol which enables eustress, positive stress, to produce."}, {"text": "Trick-or-treating not only allows adolescents to get candy and de-stress, but it also allows teens to be creative and be a kid."}, {"text": "Teens get a chance to put together their own costumes and they can choose to wear them at their school’s Halloween parade or during “trick-or-treating” hours."}, {"text": "Padalkar said, “Your costume add[s] to the basic idea of the night and disguising yourself for a night is just something fun to experience.”"}, {"text": "Not only is dressing up part of the tradition of Halloween, but so is sorting and trading the sugary treats. “We usually have some cake and other food, and then trade candy and chocolate,” said Liu."}, {"text": "Trick-or-treating unites communities through the Halloween spirit as doors are open for all trick-or-treaters."}, {"text": "Streetlights shine brightly as kids, parents and adolescents walk through their neighborhood and ring doorbell after doorbell for treats."}, {"text": "Neighbors open doors with costumes on or just as themselves, ready with a bowl of candy in their hands."}, {"text": "Many high schoolers who do not want to trick-or-treat, can still enjoy the Halloween spirit by giving out candy. “I do like handing out candy and making kids happy,” agreed Lee."}, {"text": "The Halloween festivities provide opportunities for all ages to have fun—no one should be excluded from the holiday, including high school students."}, {"text": "Padalkar said, “Age does not matter when it comes to trick-or-treating.”"}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Are high schoolers too old to trick-or-treat? – PRO", "date": "November 1, 2019", "writer": {"L2tabycjXwSAHtJCW6yQ": {"name": "Grace Choe", "year": "2019"}}, "description": "Trick-or-treat!\nOn Halloween, many kids go from door to door and fill their bags with candy. Neighbors see one another dressed up in costumes as the Halloween spirit is now in full swing. Amid the celebrations of the popular holiday, high schoolers are asking: Am I too old to trick-or-treat?\nAlthoug", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/CandyWebsite.png"}}