{"tree_elements": [{"text": "DEAR PENNY THE PIRATE: As a senior, it’s been really hard balancing college applications and my ACT, and it feels like all my tests are falling on the same day. It’s been very stressful. How should I balance my work or just relax in general?"}, {"text": "From, STRESSED"}, {"text": "DEAR STRESSED: College applications are obviously stressful and it’s impossible for teachers to accommodate to every student’s deadline. But you can always ask a teacher for an extension or making due dates earlier or later depending on what works out for you. I’ve tried asking teachers for extensions and some of them have agreed to that. As far as relaxing goes, try to manage your time as best you can and not cram everything into one day. Having your tasks spread through the week to make them more manageable. Make sure to also get sleep because it’s the best type of relaxation. Take college applications seriously, but also don’t overwork yourself. Remember that you are doing all of this to reach the final goal: going to college!"}, {"text": ""}, {"text": "DEAR PENNY THE PIRATE: There are a lot of clubs and activities that I want to join, but I’m worried that I might be biting off more than I can chew. What do you suggest?"}, {"text": "From, Concerned"}, {"text": "DEAR CONCERNED: South offers many opportunities to get involved outside of school and it can be a bit overwhelming. Keep in mind that grades in school are just as important as extracurricular activities. I have seen many of my friends join more cubs than they can handle, and their grades have suffered as a result. They ended up having to drop out of some of the clubs they joined. The best thing to do is to pick one or two clubs that you are truly passionate about so that you don’t spread yourself too thin."}, {"text": "*link to='/cdn-cgi/l/email-protection'*[email protected]*/link*"}, {"text": ""}, {"text": ""}, {"text": ""}], "file_structural_elements": {"title": "Ask Penny the Pirate", "date": "November 20, 2018", "writer": {"": {"name": "Penny the Pirate", "year": ""}}, "description": "DEAR PENNY THE PIRATE: As a senior, it’s been really hard balancing college applications and my ACT, and it feels like all my tests are falling on the same day. It’s been very stressful. How should I balance my work or just relax in general?\nFrom, STRESSED\nDEAR STRESSED: College applications are obv", "image": null}}