{"tree_elements": [{"text": "Hi Penny,"}, {"text": ""}, {"text": "I’ve noticed some of my friends haven’t been talking to me as much as before and whenever I approach them, they suddenly change the topic of conversation. I’m worried they’re upset with me about something, but I’m not sure what it is because no one has confronted me. I think I should talk to them in person, but I find it difficult and get nervous when I have to confront a group of people. On the other hand, I feel that texting the group will only cause more problems. What should I do?"}, {"text": ""}, {"text": "From,"}, {"text": "Unsure"}, {"text": ""}, {"text": ""}, {"text": "Hey Unsure,"}, {"text": ""}, {"text": "In situations involving large groups of people, the best approach may be to confront one person individually and bring up your concerns with them before approaching the group as a whole. This way, you will be able to get your point across and understand the source of the conflict."}, {"text": "School counselor Chelsea Allen has some suggestions. “I think a good idea is to reach out to people to set up a time to talk, as opposed to trying to approach them at lunch when it’s loud, and people won’t be receptive and focused on the issue.” This can be done through text or in person."}, {"text": "However, when confronting the group as a whole, texting will not provide the clarity you’re looking for, but talking in person is the best option. Ms. Allen suggests preparing for confrontation by making a mental note of the things you would like to say."}, {"text": "It’s important to be open-minded, cool-headed and respectful when approaching people about an issue. Simply tell them how you feel and allow them the time to respond. If you are worried that you will not be able to prevent a yelling match, try asking a counselor or teacher to mediate the conversation. “This way, you wouldn’t necessarily have to call someone out, rather, it would be an adult bringing some people to the table,” Ms. Allen said."}, {"text": "Confrontation is challenging for many people and for many reasons. “I think we’re afraid of rejection,” Ms. Allen explained. “I think we have egos – that’s human nature – and we’re afraid of our ego being jeopardized.” There are  steps you can take to get over this fear of rejection. Ms. Allen suggests “dealing with things when they happen as opposed to letting them build up.” When you start to bottle up your emotions regarding past conflicts, they tend to accumulate. And when they are finally addressed, they usually do not get resolved. Ms. Allen said, “Go into it with the ‘rule of good will’ in mind – assume that your friends didn’t mean to upset you, and give them the benefit of the doubt.”"}, {"text": ""}, {"text": "From,"}, {"text": "Penny"}], "file_structural_elements": {"title": "Ask Penny the Pirate: trouble with friends", "date": "May 21, 2019", "writer": {"ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}, "": {"name": "Cathy Xiang", "year": ""}}, "description": "Hi Penny, \n \nI’ve noticed some of my friends haven’t been talking to me as much as before and whenever I approach them, they suddenly change the topic of conversation. I’m worried they’re upset with me about something, but I’m not sure what it is because no one has confronted me. I think I should ta", "image": null}}