{"tree_elements": [{"text": "Black combat boots. Multi-colored scrunchies. Denim skirts and jackets. Mini backpacks in all shapes and sizes. Chokers, bomber jackets and shiny platform sneakers."}, {"text": "Walking through South, these are the fashion trends you see everyday — signs of the return of ‘90s fashion that has become more popular among Generation Z in the past few years."}, {"text": "Why this flash back to the ‘90s? The cycle of fashion is a result of what is known as the “nostalgia pendulum,” which is a theory where past trends repeat themselves every 20 to 30 years."}, {"text": "There has been a lot of debate about what this cycle means for our society, but most people find the ‘90s fashion comeback to be a trend that is both fun and eye-opening."}, {"text": "Junior Vividha Venkatrajan said that she is not usually an active trend follower, but became aware of the comeback through fashion bloggers and Youtubers on social media."}, {"text": "“I love Doc Martens and platform shoes and flannels, which are all ‘90s trends. But I am not a big fan of wide jeans,” she said. “So, I guess I picked up aspects from this trend that were best suited to my personal style.”"}, {"text": "Besides allowing teenagers to find fashion styles that they are interested in, this trend has also impacted society by helping the younger generation gain more insight into past culture."}, {"text": "“Introducing past fashion trends leads to people not only becoming more appreciative of past trends, but also the history behind them,” said junior Mishal Shafique."}, {"text": "‘90s fashion was first influenced by rock bands like Nirvana and Soundgarden that were popular at the time. Because of this trend, the fashion industry began selling more items that mimicked the “grunge,” or more unkempt, style of the band members. Outfits such as flannel shirts over band t-shirts and floral dresses paired with combat boots quickly became iconic."}, {"text": "By breaking free of the typical fashion mold, the “grunge” style became a symbol of self-expression. Rather than being well-groomed, people favored mixing and matching low-budget items with vintage styles to create a type of fashion that valued comfort and casualness."}, {"text": "In doing so, ‘90s fashion was able to reflect many people’s desire of non-conformity and the ability to live life the way they wanted. With the return of this trend, teenagers today will also be able to make their own fashion statements with a philosophy that is still relevant to our current society."}, {"text": "At the same time, others have argued that this cycle of repeating past trends shows how our society is becoming less creative and running out of innovative ideas."}, {"text": "*link to='https://www.thecut.com/2015/10/fashions-moving-too-fast-thats-a-bad-thing.html'*an online article from The Cut*/link*"}, {"text": "As a result of this lack of time, some people think that companies have resorted to creating items based on previous trends since they have been successful in the past, rather than coming up with brand new ideas."}, {"text": "However, sophomore Avi Agarwal believes this repetition is important for building a strong foundation to stabilize certain industries in our society."}, {"text": "“If you focus on revitalizing certain trends over periods of time, that can lead to more growth and make sure that there’s always a base to return back to if something doesn’t really work,” he said."}, {"text": "Venkatrajan also thinks that bringing past fashion items back does not necessarily show a decline in creativity."}, {"text": "“The trends tend to put a twist on some old fashion items, which one might say is a creative transformation,” she said, citing examples of various brands that have taken advantage of this rise in ‘90s fashion popularity."}, {"text": "One example is Juicy Couture, a brand known for their monochromatic tracksuits, that partnered with Urban Outfitters to release a new velour hoodie and wide-leg pants collection. Similarly, Nike and luxury brands have been selling redesigned, modern platform sneakers to fit in with current trends."}, {"text": "Taking into account the successful revamping of fashion items by many brands and the new favorites that teens have found amid this surge of past trends, it is clear that this comeback of ‘90s fashion has impacted our society in a positive way."}, {"text": "“Of course, there are some things that aren’t exactly fashion forward that come out of these trends, but I think those items tend to filter themselves out and we are left with fashion trends that are worth having,” Venkatrajan said."}, {"text": ""}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Back to the 90’s: a fashion comeback", "date": "February 13, 2020", "writer": {"7QmjWOmuijWLnsmxiDbP": {"name": "Tinney Mak", "year": "2019"}}, "description": "     Black combat boots. Multi-colored scrunchies. Denim skirts and jackets. Mini backpacks in all shapes and sizes. Chokers, bomber jackets and shiny platform sneakers.  \n      Walking through South, these are the fashion trends you see everyday — signs of the return of ‘90s fashion that has become", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/platform-shoe-e1581622095161.jpg"}}