{"tree_elements": [{"text": "“Lose weight! Purify your body! Reduce stress!” These are promises made by rapidly growing health brands endorsed by celebrities on social media."}, {"text": "In today’s social media-obsessed society, companies, and health companies in particular, have a readily available forum to advertise to consumers. Consumers, however, should be wary."}, {"text": "Health products promise a healthier life, but many of them end up having the opposite effect."}, {"text": "There are millions of people who use social media every day, making them the perfect targets for this type of health product misinformation. These advertisements are usually brought to you by celebrities."}, {"text": "Celebrities get paid to endorse the company’s products. Usually the celebrity stands in front of the camera posing with the product along with a caption convincing viewers that it will improve their lives. The hopeful promise of a better life that the picture brings is what draws people in."}, {"text": "For example, a product that is quickly gaining popularity lately is Fit Tea, a detox tea blend. Their advertisements claim to have all natural ingredients and antioxidants, along with being a “healthy lifestyle drink.”"}, {"text": "These claims are far from the truth. According to the National Institutes of Health, the laxative herb used in detox teas like Fit Tea has no real evidence for providing weight loss. Of concern are the findings that if someone uses it for two weeks, the tea starts to cause unusual bowel functions and can lead to heart problems as well as liver damage."}, {"text": "Fit Tea mainly gained popularity from the Kardashians and Jenners, who endorsed it on their instagram pages by posting with the product."}, {"text": "People see these posts and think that if they buy the product they will look like the celebrity. This is what drives them to buy the product."}, {"text": "Another health product quickly gaining popularity is an appetite suppressant lollipop by Flat Tummy Co. They contain an active ingredient called Satiereal, which is extracted from natural plants. This ingredient is supposed to make people feel more full. Overall, the lollipop is supposed to help control food intake and suppress cravings."}, {"text": "The lollipop has mostly sugar-7g. In reality, the lollipops don’t produce the benefits it advertises. True, the lollipop keeps you from eating, but this is simply because eating the lollipop distracts your immediate hunger."}, {"text": "“When you have any lollipop in your mouth, you won’t go get other higher calorie munchies,” said People magazine’s dietitian and nutritionist specialist Dawn Jackson Blatner. It does not matter if it’s a Flat Tummy Co. lollipop or a Dum Dums lollipop, it basically does the same thing: distracts you."}, {"text": "There is also hidden danger when it comes to the Satiereal in the lollipop. Satiereal is a weight loss ingredient derived from saffron. “We don’t know what continued use of Satiereal at unknown doses will do,” said Blatner. “There are too many unknowns to make this a good idea — yet.” This is what makes these products risky."}, {"text": "These lollipops are also endorsed by Kim Kardashian and other instagram models. In a recent instagram post, Kardashian snapped a picture with an appetite suppressant lollipop in her mouth and called them “literally unreal.”"}, {"text": "It is unethical for celebrities to endorse these unhealthy products. It sends people the message that the best way to get fit is by starving yourself. This is especially a dangerous message to send teens and younger children. Teens want to look like their favorite star and buy these unhealthy alternatives to do so."}, {"text": "“Even though they’re [teens] not doing it consciously, there’s constant comparing, so when a quick fix pops up they take it,” said Lisa Hayden, a health teacher at South."}, {"text": "The incentive celebrities have to post these advertisements is transparent. According to CNBC, Kylie Jenner makes $1 million for every sponsored Instagram post."}, {"text": "But the money doesn’t make it acceptable for a celebrity to promote false information."}, {"text": "“It comes down to a person’s morals,” said Ms. Hayden, “Celebrities don’t really understand or even think about the power they have to really do good or not.”"}, {"text": "The Kardashians have received major backlash for all of the suspect health products they endorse, yet they still continue to promote these products. Following Kim Kardashian’s appetite suppressant lollipop post, fans and other celebrities expressed their disapproval. People started tweeting that Kardashian was promoting eating disorders to her young fans."}, {"text": "However, things seem to be looking up because, with easy access to information on the internet and social media, consumers have become smarter. According to Forbes, people today are a lot less likely to buy products that are endorsed by their favorite celebrities."}, {"text": "Ideally, these celebrities will notice when people lose respect for them because of the products they endorse. Hopefully, the loss of fans and gain of negative attention will be an incentive to stop endorsing products that are bad for people’s health."}, {"text": "That being said, it’s important that people know how to spot an unhealthy product. “If it looks too good to be true, it probably is,” said Ms. Hayden."}], "file_structural_elements": {"title": "Celebrity health advertisements", "date": "April 1, 2019", "writer": null, "description": "   “Lose weight! Purify your body! Reduce stress!” These are promises made by rapidly growing health brands endorsed by celebrities on social media.\n      In today’s social media-obsessed society, companies, and health companies in particular, have a readily available forum to advertise to consumers", "image": "https://thepirateseye.org/wp-content/uploads/2019/04/FITTEACOLORED.png"}}