{"tree_elements": [{"text": "Champion, the now iconic sports and athleisure clothing brand, has turned 100 years. Over time, the company has innovated comfortable athletic wear, having a devoted commitment to the “team.” A century later, Champion looks the same but sells differently."}, {"text": "Champion’s success started with their reverse weave fabric that prevents athletic clothing from shrinking during the washing process. After patenting the fabric in 1938, many sports teams adopted their brand."}, {"text": "Another innovation that Champion is responsible for are  breathable mesh jerseys, a fabric more comfortable for athletics, that have become an industry standard for almost every sport. But Champion found its boom in the ‘80s when it was picked up by popular culture. The hip hop and punk scene adopted the comfortable wear."}, {"text": "In 2017, a red Champion reverse weave hoodie was placed in the Museum of Modern Art, establishing the brand’s impact on modern culture."}, {"text": "Now, Champion is a fashion staple with the rise of its popularity in athleisure and celebrities like Kylie Jenner donning the classic logo."}, {"text": "Unfortunately, Champion’s prices have grown with its popularity."}, {"text": "Online, their hoodies retail for upwards of 35 dollars, which is an increase from the 15-25 dollar price range  a few years ago. In addition, their newer styles can cost over 60 dollars."}, {"text": "Of course, brands have the liberty to value their products however they’d like, but from a design standpoint, the newest looks by Champion are uncreative and don’t seem worth the price."}, {"text": "The brand known for innovating and setting the standard seems to be caught in the tide of logo hype."}, {"text": "Although it’s smart for a company to profit off this trend, coming out with new sweatshirts that feature the same style, with slight shade changes or  multiple dotted “C”s is unimpressive, especially when the prices don’t seem to be worth it."}, {"text": "Their most recent collaboration features the Powerpuff Girls surrounding the large Champion logo. Here, the brand stays precisely on trend playing into the nostalgia of the ‘90s and iconic cartoons.The sweatshirt is 60 dollars, which some might be willing to pay, but overall its not worth the price."}, {"text": "Champion should be careful with their major success as they follow trends and fill racks in more fashionable stores like Urban Outfitters. Just like when every purse was plastered with the high-end fashion brand Coach’s “C”s, the iconic Champion logo could go out of style when it’s seen on every corner."}, {"text": "It would be a shame to see an innovative, high quality and previously affordable brand suffer from the ups and downs of fashion trends that it has begun to depend on."}], "file_structural_elements": {"title": "Champion’s new trendiness", "date": "April 1, 2019", "writer": null, "description": "     Champion, the now iconic sports and athleisure clothing brand, has turned 100 years. Over time, the company has innovated comfortable athletic wear, having a devoted commitment to the “team.” A century later, Champion looks the same but sells differently.\n      Champion’s success started with t", "image": null}}