{"tree_elements": [{"text": "Should men have to pay on a first date? If he does, is he being chivalrous or sexist? If a woman suggests they split the bill, is she a flaming feminist or just paying her share?"}, {"text": "To answer these questions, we must first define what chivalry is."}, {"text": "Chivalry, in its historical sense, refers to the code of knighthood during the European medieval era and stems from moral terms set by Christian ethics. According to the Catholic church in the 11th century, men were supposed to follow a habitus, a noble code of conduct based on six ideals: loyalty, self-control, bravery, generosity, honor and benevolence towards the weak."}, {"text": "In everyday language, chivalry refers to polite behavior. More specifically, as dictionary.com describes, chivalry is “courteous behavior, especially that of a man towards a woman.”"}, {"text": "The gender dynamics inherently associated with the word in our culture creates challenges to the way chivalry is viewed today. In fact. many people think chivalry is offensive and sexist."}, {"text": "But we argue that chivalrous behavior is just one person trying to be nice to another. We believe that modern chivalry is not something defined by gender dynamics."}, {"text": "When we asked senior Matthew Heyman about how societal standards affect his actions, such as pulling out a chair or holding the door open for female students or teachers, he said, “I think nowadays there’s not as much pressure on guys,”  and that acting chivalrously means “treating others the way you want to be treated.”"}, {"text": "Junior James Jett feels that he is chivalrous when he “calls out people using slurs.”"}, {"text": "These examples of chivalry at South don’t suggest that the other gender is lacking physical ability or is fragile."}, {"text": "Those who find acts of chivalry sexist or patronizing, such as when a person picks up a pile of books another person has just dropped, are misreading these gestures of kindness."}, {"text": "Acts of chivalry are not meant to be condescending or hurtful."}, {"text": "Many of these gender-specific views can be traced back to the medieval period. During that time, society followed a strict gender binary, where women’s main role was as wife and mother and men’s were as fighters and protectors."}, {"text": "History is not only to blame for our perception of chivalry. As children and young adults, we have seen sexist actions depicted as chivalrous in the media, which has created misconceptions of what chivalry truly is."}, {"text": "A popular movie that depicts this stereotype is the 2016 Oscar-winning movie “La La Land.” Throughout the movie, the main male lead, Sebastian, imposes his opinions on his love interest, Mia, and mansplains ideas to her, such as what jazz is. This practice in Hollywood has perpetuated negative gender associations with chivalry."}, {"text": "But times have changed.  Chivalry can no longer be a practice in which men view women as less capable.  Modern chivalry is the practice of uplifting each person."}, {"text": "So, despite the negative associations with chivalry, we need to recognize the intention behind chivalrous actions, which are not usually rooted in malicious intent."}, {"text": "However, if someone commits overly aggressive acts of kindness that make you uncomfortable: tell them. “If [someone] is doing something so much that it’s become a nuisance,” explained senior Justin Cheung, “then it’s not chivalry anymore.” When you let them know, be tactful."}, {"text": "Chivalry is a practice that we need to redefine and see as something respectful, not biased or misogynistic. Times are changing, so should how we practice and perceive chivalry."}], "file_structural_elements": {"title": "Chivalry redefined", "date": "April 1, 2019", "writer": {"SbITCtXVmWYkqTpn6l43": {"name": "Eugenia Ma", "year": "2019"}, "bXXGgMig9e1Wk6o1Nt2M": {"name": "Gauri Nema", "year": "2019"}}, "description": "     Should men have to pay on a first date? If he does, is he being chivalrous or sexist? If a woman suggests they split the bill, is she a flaming feminist or just paying her share?\n     To answer these questions, we must first define what chivalry is. \n     Chivalry, in its historical sense, refe", "image": "https://thepirateseye.org/wp-content/uploads/2019/04/IMG-2824-e1554134760238-900x900.jpg"}}