{"tree_elements": [{"text": "In study hall and classrooms, students have Chromebooks propped open as they type away earnestly. With the implementation of the 1:1 Learning Initiative starting with the class of 2021, the seniors were left out of the program. But this year, they also received Chromebooks."}, {"text": "Chromebooks help high schoolers in their studies with technological resources. Monali Mohapatra said, “This is the digital age.”"}, {"text": "Having a Chromebook means having access to resources on the internet. “Chromebooks are lifesavers,” said senior Saanika Kulkarni. “[There are] many resources, which we can access easily through our laptops.” With the push of a button seniors are now able to access Google Classroom, class assignments and databases with ease."}, {"text": "Chromebooks allow the seniors to have help and interact with teachers through digital platforms, such as Google Drive and Google Classrooms."}, {"text": "The Chromebooks are convenient. Senior Atiriya Kollipara said, “I can finish my work during study hall, without having to go to the library and using the computer there or using my phone.”"}, {"text": "Kulkarni agreed. “Unlike previous years where I rushed to the library computer to finish an assignment, I can have this handy device with no panicking and zero stress.”"}, {"text": "Not only are they convenient for students, but teachers, too. Mohapatra explained, “[Teachers] don’t have to drag around the Chromebook carts to each of their classes when they are doing research projects.”"}, {"text": "“Chromebooks reduce complications for teachers,” agreed Kollipara. This is especially true during sub-study, when a teacher is absent. “Teachers can easily give assignments to students [through Chromebooks],” said Mohapatra."}, {"text": "Chromebooks save trees. Kollipara said, “There’s also an issue with wasting a lot of paper. Giving devices out definitely alleviates that problem.” Since materials, like textbooks, needed for class can now be found online, the classroom setting becomes both environmentally friendly and technologically advanced."}, {"text": "Individual Chromebooks for seniors also reduce the weight which they carry in their backpacks. Kulkarni said, “Students don’t need to worry about forgetting handouts at home or how heavy their backpacks are.”"}, {"text": "The devices enable seniors to accomplish more than they could before."}, {"text": "Kulkarni said, “Chromebooks are a win-win scenario for both students and teachers.”"}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Chromebooks: seniors benefit from new edition", "date": "November 1, 2019", "writer": {"L2tabycjXwSAHtJCW6yQ": {"name": "Grace Choe", "year": "2019"}}, "description": "In study hall and classrooms, students have Chromebooks propped open as they type away earnestly. With the implementation of the 1:1 Learning Initiative starting with the class of 2021, the seniors were left out of the program. But this year, they also received Chromebooks.\nChromebooks help high sch", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/ChromeBookWebsite.png"}}