{"tree_elements": [{"text": "*Spoiler alert for movies “Five Feet Apart,” “The Fault in Our Stars,” “Me Before You,” “P.S. I Love You,” “To All The Boys I’ve Loved Before,” and “The Perfect Date.”*"}, {"text": "Clichéd movie plots are a thing of the past, but it doesn’t seem that Hollywood got the memo."}, {"text": "Justin Baldoni’s brand new rom-com “Five Feet Apart” had fans leaving movie theaters with tears running down their faces."}, {"text": "The emotional story centers around two teenagers whose personalities are polar opposites–Stella Grant, played by Haley Lu Richardson and Will Newman played by Cole Sprouse."}, {"text": "Stella, a young girl who plays by the rules, and Will, who does anything but, both suffer from cystic fibrosis (CF)."}, {"text": "This genetic disease affects a person’s ability to breathe because of excess mucus accumulated in their lungs. CF patients are not allowed to interact with other CF patients and are supposed to stay six-feet apart so they do not spread a possible infection."}, {"text": "The title is a reference to a scene towards the end of the movie. The two grow closer and inevitably fall in love. They literally move within five feet of one another, as their own way to rebel against the rule of staying six-feet apart."}, {"text": "Does this summary ring any bells? Maybe because the plot of this film was all too similar to “The Fault in Our Stars.”"}, {"text": "Fans were quick to point out the constant similarities between the two movies. It seemed that someone decided to take “The Fault in Our Stars,” change the name and substitute in a different illness to create this movie."}, {"text": "“The Fault in Our Stars”, released in 2014 and directed by Josh Boone, also featured a young couple who both suffered from cancer in the past. They fall in love, obviously, and then one of them passes away."}, {"text": "Junior Ananya Kondragunta reviewed the movie, saying that “ [‘Five Feet Apart’] was good, and the scenes were really well shot, but I honestly felt as if I had just watched ‘The Fault In Our Stars’ all over again.”"}, {"text": "The fact is that people love terminal romances. Two people have a time limit on life, they meet, they fall in love and one of them eventually dies."}, {"text": "Sophomore Jackie Rima has watched both movies and also agreed that they are similar. Rima said of the movie industry today,“I think they have become very predictable and unrealistic.”"}, {"text": "The first movie to come to mind for many is “The Fault in Our Stars,” but to look beyond that, we see movies like “Me Before You,” “P.S. I Love You” — the list goes on."}, {"text": "It seems that Hollywood has created this movie mold that appeals to most viewers, and has repeatedly filled the mold with different characters and different illnesses, but the same heart wrenching, agony filled cliché plot."}, {"text": "The dying significant other at the end? Not that much of a plot twist anymore."}, {"text": "In 2017, fans of Nicola Yoon were pleased to see one of her most popular books, “Everything Everything,” come to life on the big screen. The movie, directed by Stella Meghie, tells the story of a young girl who lived a sheltered life in the confines of her home because of a rare illness she suffered from: immunodeficiency, also known as SCID."}, {"text": "Less than a year later, the movie “Midnight Sun” came out, which also told the story of a young girl who lived a sheltered life in the confines of her home because of a rare illness she suffered from, xeroderma pigmentosum."}, {"text": "While the diseases were different, and although “Midnight Sun”, directed by Scott Speer, featured a girl that could leave the house at night, and “Everything Everything” featured a girl that was never allowed to leave the house, both movies were too similar to go unnoticed."}, {"text": "Movies also have a tendency to let similar characters and personas show up in different films, sometimes even paired with similar themes."}, {"text": "In August  2018, Netflix released a movie based on the book by Jenny Han, “To All The Boys I’ve Loved Before.” It featured Lana Condor as Lara Jean Covey and Noah Centineo as Peter Kavinsky, who are supposed to act as if they were dating for their own personal gains. This backfires on them when they, you guessed it, fall in love with each other!"}, {"text": "The new movie, “The Perfect Date,” stars Noah Centineo. His character, Brooks Rattigan, and his best friend, played by Odiseas Georgiadis, create an app that allows people to essentially “create a date,” by putting in requirements that Centineo’s character adheres to. Pretending to be a boyfriend seems to be a common trend here."}, {"text": "Theses two movies were a hit with the teen crowd, especially “To All The Boys I’ve Loved Before,” because of the spotlight on Lana Condor,a brand new Asian actress coming to the big screen. And fans also quickly fell in love with Noah Centineo, which is why he was practically begged back to act in newer, albeit similar, movies."}, {"text": "Sophomore Srishti Subash said, “Movies nowadays seem way too clichéd. Every time I watch a movie, I feel like I’m seeing plots I’ve already seen a million times before.”"}, {"text": "These movies are just a few recent examples of clichéd story lines. It doesn’t seem like Hollywood will break out of stereotypical plots anytime soon. We can only hope that a new generation of filmmakers will tell  stories that transform the romantic comedy genre."}, {"text": "How would audiences react if movies dared to defy the cliché?"}], "file_structural_elements": {"title": "Cliché storylines produce lackluster teen rom-coms", "date": "May 21, 2019", "writer": {"uCLiBSNVw88B8cvjzOCS": {"name": "Naqsh Mitra", "year": "2018"}}, "description": "*Spoiler alert for movies “Five Feet Apart,” “The Fault in Our Stars,” “Me Before You,” “P.S. I Love You,” “To All The Boys I’ve Loved Before,” and “The Perfect Date.”*\n    Clichéd movie plots are a thing of the past, but it doesn’t seem that Hollywood got the memo. \n     Justin Baldoni’s brand new ", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/IMG_1616-654x900.jpg"}}