{"tree_elements": [{"text": "Wake up at 5 a.m., attend strength and conditioning, go to class, practice with team, eat, sleep, then do it all again the next morning. This is the life of a college athlete."}, {"text": "College athletes have a relentless schedule trying to balance their intense sport schedules with school and have little to no down time. The debate over whether or not college athletes should be paid has been going on in full force since the 1950’s.\nTo understand the debate, what must be recognized is how much of a financial impact college sports has in America."}, {"text": "College sports brings in billions of dollars in revenue, yet these athletes see none of the money."}, {"text": "This is because of rules made by the NCAA (National Collegiate Athletic Association). In 2017, the NCAA made $1 billion, but none of it went to student athletes."}, {"text": "Student athletes would greatly benefit from this because they do not have time to work to support their college education between practice and school."}, {"text": "Language Arts teacher Melissa Hilton rowed Division 1 at Rutgers University and she experienced the same challenges with managing her time when she first started. “It was a struggle to remain balanced and get to class in the beginning. I saw my full-time job as being a student and my part-time job as being an athlete,” said Ms Hilton."}, {"text": "According to the NCAA, only 1 percent of college athletes get a full scholarship when they get recruited. This leaves a lot of them and their families struggling financially to pay for their education and athletics."}, {"text": "According to a recent article in US News, the average cost of tuition student athletes have to pay for after a typical scholarship is between $21,629 to $35,676. Paying student athletes would mimic a work-study program, which provides part-time jobs for students with financial need."}, {"text": "The NCAA also stated that less than 2 percent of college athletes play professionally. This means that it is unlikely that the students will be able to quickly pay off college."}, {"text": "“College athletes should definitely be getting paid,” said senior Meghan Krabbe.” It’s not fair because even if they wanted to work, they don’t have the time to because of their sport.”"}, {"text": "Paying student athletes would also help stop the dishonesty that goes on in college athletics."}, {"text": "The NCAA has a certain set of rules that each college team has to follow in order to ensure that education comes first, and sports come second for student athletes."}, {"text": "However, a lot of schools break these rules."}, {"text": "According to The Washington Post, when a college finds a high school athlete that they really want, they will recruit them using illegal monetary incentives. For example, the school will offer athletes cash bonuses to ensure they won’t accept an offer from a rival school."}, {"text": "Even though paying college athletes would provide a lot of benefits, some think that there are too many negative effects.\nAccording to the NCAA, the reason college athletes are not currently being paid is because it would eliminate the line between amateur and professional sports."}, {"text": "If this happens, then it would provide the students with little incentive to continue their education."}, {"text": "“I think kids need to have an intrinsic value for education,” said Ms Hilton. “It could be great if (college athletic money) helped the athletes but it is a slippery slope to move from scholarships to paychecks.” She asked, “Where does one draw the line?”"}, {"text": "Because professional sports career is not guaranteed, education should be the primary focus of attending college, even if the students are attending the school to play a sport."}, {"text": "According to Forbes, 80 percent of retired NFL players go broke within three years, and 60 percent of NBA players go broke within 5 years of retirement."}, {"text": "“Paying college athletes would put them at a professional level and I don’t think that’s the best idea,” said senior Vibhu Gandikota. “The money can easily go to their heads.”"}, {"text": "Despite the critics, the movement to start paying college athletes is starting to gain a lot of momentum."}, {"text": "In September of this year, California passed a law (effective Jan 1, 2023) allowing college athletes to earn compensation for the use of their name and image, sign endorsement deals and hire agents to represent them."}, {"text": "Although California’s new law goes against what the NCAA believes, they are warming up to the idea of compensating the student athletes."}, {"text": "“California’s law is a big step in the right direction for colleges in all states,” said Krabbe."}, {"text": "Following California’s announcement, the NCAA has announced that they intend to follow in California’s footsteps and allow college athletes to be compensated."}, {"text": "“We must embrace change to provide the best possible experience for college athletes,” said NCAA board chair Micheal Drake, when interviewed by NPR."}, {"text": "The NCAA came to the conclusion that they would release further decisions about it in April 2020."}, {"text": "Ms. Hilton said, “We went to Rutgers because we came from families that couldn’t afford to send us to higher tuition schools. So for us to get money to row would have been amazing, but I think it would have shifted the power dynamic between why we were at Rutgers in the first place,education,and what our coach wanted, to win.”"}, {"text": "Even though there is no immediate change nationwide, the movement to pay college athletes is clearly underway. Between California’s new law, and the NCAA’s plans, college athletes are on track to receive compensation for all their hard work."}], "file_structural_elements": {"title": "College sports generate billions: why are athletes not paid?", "date": "December 20, 2019", "writer": {"": {"name": "Alyse Dunn", "year": ""}}, "description": "Wake up at 5 a.m., attend strength and conditioning, go to class, practice with team, eat, sleep, then do it all again the next morning. This is the life of a college athlete.\nCollege athletes have a relentless schedule trying to balance their intense sport schedules with school and have little to n", "image": null}}