{"tree_elements": [{"text": "$1.6 trillion. This is how much student loan debt there is in America today. Young adults are practically drowning in it. Imagine being able to alleviate every penny of that and pay for all prospective college students’ tuition moving forward."}, {"text": "It almost sounds too good to be true. That’s because it is."}, {"text": "“Having the government pay for college sets a precedent that allows for teenagers and parents to become complacent. Students will be unmotivated to work for scholarships and parents wouldn’t have to work to save up money,” said senior Aditiya Rao."}, {"text": "With the 2020 presidential race heating up, more Democratic candidates are pushing for free college education for all. But is this really possible? Nothing is free. The money has to come from somewhere and, in this case, that money would come from taxpayers. It’s unrealistic for the government to grant American students free college tuition."}, {"text": "“Having the government pay for college is like giving free money out at the cost of other American citizens. Taxpayers shouldn’t be forced to pay for someone else’s college tuition,” said senior Drishti Devnani."}, {"text": "It’s important to think about the root of the free college for all argument. The idea is that since more jobs require a college degree, the more young adults America educates the more job opportunities they will have. The mindset is that a college education is an automatic fast track to financial and social success. However, this is not always accurate."}, {"text": "America has a labor shortage in blue-collar jobs such as skilled trades, such as auto mechanics. Blue-collar jobs like these involve manual labor and typically don’t require a college degree. If everyone has a college degree, there will be no one left to do these jobs that are needed to keep our society functioning."}, {"text": "People who believe in free college for all or government subsidized college often argue that if other countries like Germany and France do it, why can’t America? The problem with these countries’ systems is that the money for college is not given to the student, but to the institution, making everything heavily regulated."}, {"text": "The government can control how many people are admitted and set standards the students must follow in order to return to that university for another year."}, {"text": "“People think it’s just easy to emulate how other countries pay for college but if their system was implemented in America there would be too many complications,” said Rao."}, {"text": "This raises another question: Is college a right or a privilege for young Americans? While everyone should have the opportunity to attend college, it should still be earned. College is a choice, and if the government starts offering free college to everyone, it becomes a right."}, {"text": "This is exactly what Democratic candidate Bernie Sanders is campaigning for. “Higher education should be a right,” Sanders said during a 2019 speech. Sanders has a plan to relieve all college graduates of their withstanding debt and pay for all aspiring student’s college tuition."}, {"text": "Sanders is proposing the College for All Act. This act will provide $47 billion per year to eliminate undergraduate tuition and fees at public colleges and universities. He also proposed to pay off the $1.6 trillion in student debt from young Americans."}, {"text": "The government has to find a way to collect this large sum. Sanders is proposing that the government put a tax on Wall Street. Putting a Wall Street tax in place would mean that anyone who participates in stocks, bonds and derivatives will be taxed a certain small percentage. According to Sanders, this tax will generate $2 trillion in 10 years."}, {"text": "This seems like it could be an easy solution to paying for students’ college, but in reality, this will instead hurt the economy."}, {"text": "Sanders isn’t the only candidate in the 2020 elections who is pushing for a free college education. Democratic candidate Elizabeth Warren plans to relieve college debt as well as reduce the cost of college tuition for low income students."}, {"text": "Warren plans to introduce a bill that will cancel up to $50,000 in student loan debt for every household income under $100,000. Warren plans to come up with this money by enforcing an Ultra-Millionaire Tax. This taxes the wealthiest Americans and applies to people living in houses worth $50 million or more."}, {"text": "Again, this plan seems like it would work. However, there are a lot of flaws with implementing this tax. For example, is taxing the rich the answer? There is also the issue of how an individual’s assets will be appraised. Appraisals are used for taxation purposes in order to determine the selling price for an item or property."}, {"text": "Research by the Tax Policy Center shows that increasing taxes on the wealthy will not likely deliver the end goal and it is unlikely that this attempt would be any different."}, {"text": "Realistically, Sanders’ and Warren’s plans for free college and debt-free futures have faults. While student loan debt and the high cost of college is a major problem in America today, the chance of someone finding a solution to the problem that won’t hurt the economy and taxpayers is slim."}, {"text": "In the meantime, there are other ways for financially struggling high school students to afford college. The FAFSA, (The Free Application for Federal Student Aid) grants students with money for college based on their family’s income."}, {"text": "There are also websites where students match with thousands of different scholarships and easily apply for them too like Fastweb.com, Niche.com and Scholorshipowl.com. “I think it’s great that there are so many scholarship opportunities available for students. With just a quick internet search students can apply for as many as they want. These websites make it easy,” said senior Phoebe Elias."}, {"text": "In addition to the thousands of scholarships that students can apply to, there are also popular schools that will match what a student can’t pay. Some of these schools include Amherst College, Brown University, Columbia University, Harvard University and Princeton University."}, {"text": "While student loan debt and the rising price of college in America is getting worse, there is no current feasible way for the government to spend trillions of dollars on college students."}], "file_structural_elements": {"title": "Con: Should the U.S. government pay for college?", "date": "February 13, 2020", "writer": {"": {"name": "Alyse Dunn", "year": ""}}, "description": "    $1.6 trillion. This is how much student loan debt there is in America today. Young adults are practically drowning in it. Imagine being able to alleviate every penny of that and pay for all prospective college students’ tuition moving forward.\n     It almost sounds too good to be true. That’s be", "image": null}}