{"tree_elements": [{"text": "During holidays in America, companies experience massive increases in sales as consumers flood stores to find gifts for friends and family. Shelves are filled with cards and decorations, and a price is put on the holiday spirit. But this practice undermines the whole point of the holidays."}, {"text": "According to Statista, The Statistics Portal, “The United States’ retail industry generated over three trillion U.S. dollars during the holidays in 2013.” The source also shows that out of all sales at game and toy stores in 2017, 30.1 percent were made during the holiday season."}, {"text": "The National Retail Federation also found that 19.6 billion dollars were made from purchases for Valentine’s Day in 2018. Candy and greeting cards made up most of the sales."}, {"text": "To understand the impact of consumerism, it is important to look back at what the holidays were like before elaborate light displays and expensive gifts. Traditionally, the winter holidays were celebrated entirely with family. For Christmas, families would attend church services and sing carols, which were meant to spread joy during the festive season. Hanukkah traditions included making latkes and playing with dreidels."}, {"text": "Now, participation in these traditions are waning for many. It seems like the culture of consumerism has taken over the holiday season and completely masked religious and national holidays."}, {"text": "Valentine’s Day is also traditionally a religious holiday that celebrates St. Valentine. When the Roman emperor Claudius banned marriage to allow his soldiers to focus on war, St. Valentine rebelled and officiated weddings for many soldiers and the women they loved. In essence, Valentine’s Day is about celebrating the importance of women in the lives of others."}, {"text": "Now, this powerful message is masked by heart-shaped chocolate boxes and spray-painted roses."}, {"text": "Since childhood, society teaches kids that the one thing to look forward to during the holidays is gifts. “When I was in kindergarten, I remember my parents hiding gifts in a scavenger hunt, so that we could find our presents in a fun way,” sophomore Varshini Vimal said. “It was so much fun when we finally found our gifts.” There are still practices, such as this one, that continue to encourage the spending of money during the holidays."}, {"text": "At South, a common holiday activity is Secret Santa. Students form groups and exchange gifts, and the identity of the gift-giver is only revealed when the recipient gets the gift. Sophomore Sanya Nair said, “I participate in Secret Santa because I like giving people gifts, and receiving them myself.”"}, {"text": "However, Brad Borsuk, who teaches international business and consumerism at South, pointed out some of the drawbacks of such practices. He said that not only is today’s society focused on the receiving of gifts, but it has also fallen victim to “the pressures of giving presents.” This leads to peer pressure, forcing families and friends to give the nicest gifts to their loved ones to avoid feeling judged by others and to impress those who seem to be competing and comparing their own presents."}, {"text": "This mindset is partly to do with the money-driven media. In holiday movies, the plot usually revolves around presents under the Christmas tree, furthering a consumerist theme. Holiday songs warn children not to be naughty in order to avoid coal in their stockings, and advertisements urge parents to buy the nicest toys for their kids. Borsuk said,“Society is being brainwashed because the media in America is essentially for profit.” Advertisements also contribute to the pressure to spend money during the “consumerist holidays.”"}, {"text": "Online shopping is also making it easier and more convenient for people to spend money during holidays. Consumers are able to sit in the comfort of their homes and browse the internet for the best deals on gifts and decorations."}, {"text": "“One thing I look forward to the most during any holiday is the sales and discounts at stores that would otherwise be more expensive ,” said Ranjini Nair, my mother and a parent of the WWP community."}, {"text": "It is unfortunate that Black Friday has become the mark of the official start to the winter holiday season. In fact, Christmas decorations start to appear in stores promptly after Halloween, as companies compete against each other to make the most profit."}, {"text": "According to Borsuk, the true spirit of any holiday can only be shown through “the giving of time, love and kindness to our fellow humanity.”  But if consumerism continues to overshadow these family traditions during the holiday season, the coming generations will have nothing to look forward to except disposable presents and short-lived memories."}], "file_structural_elements": {"title": "Consumerism is ruining holidays in America", "date": "January 23, 2019", "writer": {"ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}}, "description": "     During holidays in America, companies experience massive increases in sales as consumers flood stores to find gifts for friends and family. Shelves are filled with cards and decorations, and a price is put on the holiday spirit. But this practice undermines the whole point of the holidays. \n   ", "image": null}}