{"tree_elements": [{"text": "Without Dr. Seuss’s “How the Grinch Stole Christmas” the season wouldn’t feel complete. Released in 2000, the popular and much-loved movie has brought classrooms and living rooms with Whoville festivities and a reminder of Christmas’s true values. The movie ends with a celebration of love, family, and community and shows the Grinch’s once shriveled heart grow three sizes. In the end (spoiler alert!), he abandons his isolation in the North mountains to live with the jolly Whos."}, {"text": "While I certainly felt happy for the Grinch at the end, I found myself despising Whoville’s irritating dedication to the pressure of loving Christmas. The Grinch’s commitment to preserving his anti-Xmas beliefs was impressive considering the pressure he must have felt to follow the conventions of the Christmas-crazy town around him. So when the movie ended with him joining the Whos, I couldn’t help but grieve for an alternative ending, an ending where the Grinch transforms Whoville into accepting him for who is. This year, after watching the movie for the seventh time, I’m more convinced than ever that the real antagonist is not the Grinch, but the Whos."}, {"text": "Before you continue reading, I want to be upfront that this article is not an attempt to exonerate the Grinch of his misdeeds. To be clear, I don’t condone home burglaries committed by using an all-powerful vacuum, nor do I support the gross exploitation of pets by making them haul a colossal sled up a steep mountainside."}, {"text": "Rather, I want to take a closer look at Dr. Seuss’s classic holiday movie, and expose something far more concealed than the Christmas-is-about-being-together message: the dangers of conformity."}, {"text": "Strip away the narrator’s whimsical description of the Whos various traditions, remove the notion of Whoville being the setting for a children’s story, and you will be left with a town that resembles a cult with residents living every day with a hive mentality."}, {"text": "The narrator said so himself, “There is no place like Whoville around Christmas Day.” And indeed there isn’t. As the town’s giant clock ticks another minute closer to Christmas Day, passersby turn around in horror as if the reminder of the fastly-approaching day has sent a shiver down their backs. The Whos’ panicked reaction gives us a glimpse into the town’s true identity: not one that has been defined by their love for the spirit of Christmas, but one that has been trained to buy, and buy plenty, on this big day."}, {"text": "These expectations, perhaps, prevent many citizens of Whoville from expressing their own perspective and wishes. Maybe someone in the town would like to celebrate Kwanzaa or Hanukkah and try some candied yams and Latkes instead of the traditional Who rare roast beef, a custom that is neither vegetarian-friendly nor considerate of those who prefer their meat well-done."}, {"text": "No one is expected or encouraged to question the status quo—a fact that is established when the narrator tells us to “please don’t ask why” the Grinch disobeys the norms—stifling any type of individual expression or opinion and perpetuating this Christmas cult’s longevity."}, {"text": "The only person in the movie who strays away from these Christmas-dominant standards is the Grinch, whose disdain for holiday, motivated by childhood trauma suffered at the hands of Who classmates, is in fact completely understandable. However, the expression of the Grinch’s differing views don’t make Whoville any more inclusive. Rather than trying to accept the Grinch for his onion-loving self, the Whos ostracize the Grinch and force him to change himself in order to fit their mold."}, {"text": "In a series of uncomfortable and violating events— nonconsensually redressing the Grinch in a generic Christmas sweater when he already came prepared in a unique Ginger-breadman overall, along with force-feeding him a mixture of beef and pudding until his mouth is grotesquely overfilled—the Grinch finally succumbs to forced assimilation and brainwashing by the small town. As the Grinch joins hands with Cindy Lou Who and sings the Christmas song around the tree, all hopes of making Whoville more inclusive are lost."}, {"text": "Dr. Seuss’ “How the Grinch Stole Christmas” is a cautionary tale about the perils of conformity. If Dr. Seuss had written an ending where the Whos had taken time to accept and understand the Grinch’s viewpoint about the holiday, the Whos would have had a holiday celebration that was more accepting and inclusive, one that recognizes diverse traditions the reflects today’s America. And they would have been exposed to a greater variety of delicious foods beyond rare roast beef. This holiday season, let’s make an effort to understand the Grinchs out there."}, {"text": "IMAGE BY VIVIAN XIE (’23)"}], "file_structural_elements": {"title": "Deconstructing the Grinch", "date": "January 5, 2023", "writer": {"oZGSQKPCWdIpU60HDHNu": {"name": "Vivian Xie", "year": "2022"}}, "description": "     Without Dr. Seuss’s “How the Grinch Stole Christmas” the season wouldn’t feel complete. Released in 2000, the popular and much-loved movie has brought classrooms and living rooms with Whoville festivities and a reminder of Christmas’s true values. The movie ends with a celebration of love, fami", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/IMG_1116.jpeg"}}