{"tree_elements": [{"text": "Your favorite media franchise is being brought to the movies. That should be something to rejoice over, right? Well, not necessarily."}, {"text": "The originally cute Pocket Monsters — more commonly known as Pokémon — have been morphed into a live-action movie called “Pokémon Detective Pikachu,” starring Ryan Reynolds as Pikachu. The movie is based on  the Pokemon video game."}, {"text": "This trend does not end with Pokémon. SEGA’s “Sonic the Hedgehog” is being brought to the big screen, featuring Ben Schwartz as Sonic and Jim Carrey as Dr. Eggman."}, {"text": "Even “Dora the Explorer” is getting this treatment through a big-screen continuation of the series, featuring a high school-aged Dora on a quest to save her parents."}, {"text": "When do attempts to revitalize an old show or media franchise become excessive, or in extreme cases, damaging to the franchise?"}, {"text": "Reboots are a way for newcomers to become familiar with the franchise, but this practice is unnecessary and unwanted. These attempts to breathe new life to old things often go awry. A more welcome approach would be getting newcomers into the franchise through re-runs of original shows and movies."}, {"text": "“Dora and the Lost City of Gold,” a sequel to the classic children’s show “Dora the Explorer,” is  a movie made to cash in on the success of other action-adventure movies but targeted towards a younger audience."}, {"text": "The Sonic trailer release on April 30 was more like a very late April Fool’s Day prank rather than  an actual trailer. Critics have said that Sonic’s redesign looks almost nothing like the source material; the backlash was so strong that Paramount Pictures, the producer of the “Sonic” movie, released an official statement addressing the redesign."}, {"text": "Director Jeff Fowler posted a tweet stating that  “the message is loud and clear… you aren’t happy with the design & you want changes. It’s going to happen. Everyone at Paramount & Sega are fully committed to making the character the BEST he could be…”"}, {"text": "It doesn’t seem like the criticism has stopped, however."}, {"text": "“I’m just going to pretend that the Sonic movie doesn’t exist,” said sophomore Niraj Ramesh. Like others, Ramesh dislikes the direction Paramount  chose in Sonic’s design."}, {"text": "Hundreds of fan-made edits of Sonic’s design have been posted online. Thousands of negative comments litter YouTube’s comment section. Dozens of articles written from multiple sites like The Guardian refer to the movie with headlines like “The Sonic the Hedgehog movie trailer is a 200 mph slap in the face.” The actual article is not much nicer."}, {"text": "On a more positive note, “Pokémon Detective Pikachu” actually looks very good. It helps that Pokémon is easier to translate to live action and CGI compared to other possible shows, but just because a reboot can be made does not mean it needs to be."}, {"text": "Movies like “The Godfather,” and “The Princess Bride” can be remade and rebooted, but they haven’t been because these movies are already so good. Why attempt to fix something that is already well-written and well made?"}, {"text": "“Monsters University,” “Detective Pikachu” and others alike are good examples of movie reboots that were not needed but were well-received on first viewing. “Monsters University” received a 80% fresh rating on Rotten Tomatoes, an acclaimed review-aggregation website. 94% of Google users said that they enjoyed the movie."}, {"text": "Detective Pikachu has met almost universal approval anywhere it is mentioned, with 95% of Google users approving of the movie."}, {"text": "But just because some movies successfully handled a reboot does not mean that every movie can."}, {"text": "In the end, all that can be done is to wait and see what the movies will be like. But in the time being, feel free to overanalyze reboot trailers and spam the comment sections with as many disses as you desire."}], "file_structural_elements": {"title": "Detective Pikachu: yet another childhood favorite forced to attempt movie theater stardom", "date": "May 21, 2019", "writer": {"hAatcVs9qdRuA5BzCBPf": {"name": "Damien Moshman", "year": "2018"}}, "description": "     Your favorite media franchise is being brought to the movies. That should be something to rejoice over, right? Well, not necessarily.\n     The originally cute Pocket Monsters — more commonly known as Pokémon — have been morphed into a live-action movie called “Pokémon Detective Pikachu,” starri", "image": null}}