{"tree_elements": [{"text": "“In this room, we will not tolerate the use of any words or actions that put down people because of their race, religion, sex, sexual orientation, or disability.” This motto hangs in classrooms in our high school, encouraging students to be accepting and respectful of others."}, {"text": "In recent years, the mainstream media has started to represent Asian-Americans with progressive movies such as Crazy Rich Asians. However, this past November, a series of culturally insensitive advertisements released in China by Dolce and Gabbana demonstrated how easy it is for the cultural conversation to swing in ways that are hurtful to others."}, {"text": "On Nov. 18, 2018, Dolce and Gabbana, a luxury Italian fashion brand, released three short video advertisements on a Chinese social media site called Weibo. The purpose of the advertisements was to promote the brand’s fashion show in Shanghai, called “The Great Show.”"}, {"text": "The advertisements feature a Chinese woman wearing an extravagant red Dolce and Gabbana dress and showy gold jewelry. The woman is shown cluelessly attempting to eat different Italian delicacies – first a pizza, then a cannoli, then spaghetti – using chopsticks."}, {"text": "Reacting to the concept, sophomore Laura Ma said, “When I first watched the advertisements, I was kind of confused because, first of all, people in China don’t eat pizza with chopsticks.”"}, {"text": "In the background, Chinese folk music plays as a voiceover of a man speaking Mandarin mocks the woman as she predictably fails to eat the food. The voiceover also pronounces the name of the brand to imitate a Chinese accent."}, {"text": "Many viewed the advertisements as insensitive and a mockery of Chinese culture. “It’s just annoying that people don’t know anything about your culture,” said sophomore Irena Chen, who is of Chinese heritage."}, {"text": "This is not the first time the brand has faced criticism about social insensitivity."}, {"text": "In 2016, the brand released a gladiator-style sandal called the “Slave Sandal.” Most stores that sold the sandals did not use this name, but it was still featured on the brand’s website. After harsh criticism, the sandals were renamed “Decorative flat sandal.”"}, {"text": "On Nov. 20,  just one day before “The Great Show” was set to take place, an Instagram account from Shanghai called “diet_prada” released screenshots of a direct message conversation between another account called “michaelatranova” and Stefano Gabbana, a co-founder of the brand. In it, Gabbana made comments that put down China and its culture."}, {"text": "The brand proceeded to claim that the direct messages were a result of Gabbana’s account being hacked, a response that was met with skepticism. Sophomore Carol Sun said, “Playing the blame game is so petty and honestly makes it harder to believe that [he] did not do it.”"}, {"text": "Given the controversy and backlash, on Nov. 21 “The Great Show” was canceled. Many Chinese retailers stopped offering Dolce and Gabbana products, and many consumers returned their items from the brand."}, {"text": "On Nov. 23, Gabbana and Domenico Dolce, the other founder of the company, released an apology video on the brand’s YouTube channel where they concluded by saying “sorry” in Mandarin in unison. In the video, Gabbana and Dolce took turns speaking and seldom looked at the camera. Many social media users commented that the video was insincere and that they did not buy any of the “we love China” remarks."}, {"text": "Large companies have a social responsibility."}, {"text": "School counselor Chelsea Allen said, “I think when [people] are exposed to racist behavior, it can become ‘normalized’ and can be perceived by some as less problematic.” The media has power when it comes to shaping the perceptions people have of others."}, {"text": "Companies such as Dove, Nivea, and Heineken have released advertisements that have been insensitive and racially charged. Many of these advertisements are endorsed by celebrities, who have a huge influence on their fan bases — and this propagates and normalizes racist behavior in day-to-day life."}, {"text": "The advertisements released by Dolce and Gabbana contributed to the acceptance and tolerance of culturally insensitive behavior both in the media and the real world. If companies with such a large influence continue to spread insensitive messages, then the coming generations will have to face long-lasting consequences."}, {"text": "PHOTO COURTESY: GRACE CHOE"}], "file_structural_elements": {"title": "Dolce and Gabbana advertisements: insensitive or not?", "date": "January 23, 2019", "writer": {"uCLiBSNVw88B8cvjzOCS": {"name": "Naqsh Mitra", "year": "2018"}, "ejT8eIFC22HFHKCSbhPm": {"name": "Ankita Nair", "year": "2020"}}, "description": "     “In this room, we will not tolerate the use of any words or actions that put down people because of their race, religion, sex, sexual orientation, or disability.” This motto hangs in classrooms in our high school, encouraging students to be accepting and respectful of others. \n     In recent ye", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/DOLCE.png"}}