{"tree_elements": [{"text": "With a new year comes the excitement of being able to watch long-anticipated movies. As we count down the days toward the newest releases and rewatch trailers, we should also acknowledge how far the American movie industry has come in the last decade."}, {"text": "Amid societal, political, and cultural shifts in our country, one of the most positive evolutions in recent movies has been an increased diversity in the cast and characters we see on screen."}, {"text": "This long overdue change has increased the representation of minorities in lead roles. Sophomore Eva Hu cited two movies from 2018, “The Hate U Give” and “A Wrinkle in Time,” as big steps forward toward more diverse representation in the movie industry. Both movies had a mostly African-American and Asian starring cast. Amandla Stenberg and Anthony Mackie starred in “The Hate U Give.” Storm Reid, Oprah Winfrey and Mindy Kaling starred in “A Wrinkle in Time.”"}, {"text": "Other examples include the 2018 blockbuster “Black Panther” and the first movie to feature a predominantly Asian cast since “The Joy Luck Club” in 1993, “Crazy Rich Asians.”"}, {"text": "These changes have paved the way for the upcoming release “In the Heights,” which explores life in a New York City Latino neighborhood. Disney’s live-action version of “Mulan” is also set to release in 2020."}, {"text": "However, the entertainment company at the forefront of this movement is arguably Marvel."}, {"text": "Marvel’s next round of movies will incorporate diversity both onscreen and offscreen. Of the five movies the studio announced at Comic-Con this year, three of them will be directed by people of color."}, {"text": "“Shang-Chi and the Legend of the Ten Rings” starring Simu Liu will be the first Marvel movie to focus on an Asian superhero. “Thor: Love and Thunder” will feature Valkyrie, played by Tessa Thompson, as the first LGBTQ superhero in the MCU. In addition, “The Eternals” will have a cast full of diverse actors, including Kumail Nanjiani, Ma Dong-Seok, and deaf actress Lauren Ridloff."}, {"text": "Junior Ilsa Qadir thinks that diversity has increased because “people want more representation and companies want to cater to people’s interests,” which is shown in the success of recent movies with multicultural casts at the box office."}, {"text": "Increasing representation in films is also positive for our society. “Children look up to these characters and when they see that these characters are just like them, they feel accepted and they feel like they can easily relate to them,” said Qadir.\nJunior Chihao Tong agreed, saying that movies such as “Wonder Woman,” which had a female star and minority actors in lead roles, were successful due to this relatability factor. “After the movie was released, it ranked first place in the box office nationwide,” he added."}, {"text": "However, Tong thinks that there is still room for improvement because the earliest Hollywood films reflected racial and cultural prejudices in America."}, {"text": "For example, in the 1961 movie “Breakfast at Tiffany’s,” Mickey Rooney, a comedic actor, played the role of Mr. Yunioshio, a Japanese character, with all the worst stereotypes. According to an article on McClatchy online, Dr. Christine Fa of Asian American Media Watch said the movie is “arguably the most racist Anti-Asian film in American cinematic history.” Other movies during that time, and many afterwards, portrayed minorities with these racist clichés."}, {"text": "“Despite recent changes, Hollywood still has much more work to do in order to get rid of all those negative stereotypes,” Tong said."}, {"text": "With a growing number of companies embracing this inclusive evolution in the movie industry, we can expect to see an increase in representation in successful movies in the future."}, {"text": "“This is a signal that America is opening its heart to accept and respect all other races and different kinds of people,” said Tong."}], "file_structural_elements": {"title": "Editorial: increasing diversity a positive evolution in cinema", "date": "December 20, 2019", "writer": null, "description": "With a new year comes the excitement of being able to watch long-anticipated movies. As we count down the days toward the newest releases and rewatch trailers, we should also acknowledge how far the American movie industry has come in the last decade.\nAmid societal, political, and cultural shifts in", "image": null}}