{"tree_elements": [{"text": "As you look across the gallery view during your third-hour class, your eyes drift to a student devouring a full-course meal, another arguing with their sibling while unmuted and the third texting on their phone, not paying attention. Welcome to school via Zoom."}, {"text": "The 2020-21 school year opened on Sept. 6 with a virtual/hybrid model to ensure the safety of students and staff. As teachers and students adjust to the new virtual learning environment, members of the South community can do their part to prevent potential awkward situations and make this transition as smooth as possible by learning some basic Zoom etiquette."}, {"text": "The first step to creating an authentic classroom environment is learning how to use your microphone and camera. Located in the bottom left corner of your Zoom screen, these seemingly complicated features will greatly aid your learning experience. For starters, learn to use them!"}, {"text": "When you first join the call, the mic and camera buttons will likely have a red line across them indicating that they are turned off. In order to get rid of these lines, simply hover your mouse over the buttons and click on them. To turn the features back off, just click on the buttons again."}, {"text": "Turning the camera on is an important way for teachers and students to connect with each other in a virtual setting. After all, teaching a class of black squares labeled with names isn’t exactly the best way of creating an engaging learning community. This can also make communication more difficult."}, {"text": "Language arts teacher Ms. Rose Leonard said, “I often can’t tell who is speaking and search the screen for what seems like hours and I know I look foolish!”"}, {"text": "To promote a more interactive learning experience, be sure to keep your camera on as long as you feel comfortable doing so. You can also add a fun background from the options provided by Zoom. Simply click on the small upwards arrow next to the “Start Video” button. Click on the “Choose Virtual Background” option and select one of the provided images. You can also download your own images if you prefer."}, {"text": "If you choose not to turn your camera on, make sure your profile picture is school-appropriate and your display name is accurate."}, {"text": "Additionally, when you speak up, make sure your audio level is tolerable for other students in your class. Senior Mayank Chauhan said, “Sometimes when people wear headphones, their volume skyrockets when they forget to talk softly since they are at a closer proximity to their microphones.” So, use your inside voice to avoid startling your peers."}, {"text": "Once you have mastered the mic and camera functions, be sure to help others if you notice that they’re having trouble. If a person had something stuck in their teeth, a good friend would politely let that person know in order to avoid an embarrassing situation. The same logic can be applied to Zoom."}, {"text": "For example, Ms. Leonard said she often forgets to unmute herself. In cases like this, let others know to unmute their mic."}, {"text": "Similarly, if someone’s audio is choppy or lagging, don’t wait for them to finish talking before politely telling them that there is an issue, especially if they start to sound like Flash, the sloth from Zootopia. The solution is often as simple as putting a comment in the chatbox instead of saying it out loud."}, {"text": "In addition, remember basic classroom rules."}, {"text": "For example, don’t speak when others are speaking. On a Zoom call, this means being aware of your mic settings, whether you are talking or not. If you are aggressively typing or playing loud music, it’s definitely not a good idea to have your mic on."}, {"text": "“Interrupting or talking over someone while on a Zoom call, whether done intentionally or unintentionally, can get really annoying,” said Chauhan. “Zoom presents a funky mixture of what both people said as the end result which would normally not happen in an in-person setting.”"}, {"text": "Another thing that wouldn’t normally occur in a classroom environment is dismissing yourself early. Ms. Leonard said, “My biggest pet peeve is students leaving Zoom meets and pretending they are still in class.” The teacher should be the last one to leave class, even in a Zoom setting."}, {"text": "Additionally, an important aspect of in-person learning is participating in group activities. Breakout rooms, the medium for online collaboration among South students, consist of awkward silences, blank stares and some confusion. Now is the time to change that."}, {"text": "To facilitate effective breakout room discussions, make sure to participate and don’t be afraid to start the conversation. In most cases, a simple question or comment is enough to get the discussion going. Try to turn on your camera if you can because talking to a screen of floating heads is much preferred to the plain Zoom background."}, {"text": "Finally, be courteous and polite. Turn your phone notifications off if your mic is on, try to mute before your dog starts barking at a squirrel outside and always, always bring your pets into view of the camera. Yes, they are cute and yes, we all want to see them."}, {"text": "Remember to be patient with others and with your device. We may not be together physically, but we are all learning how to use Zoom side by side. Next time you log onto your virtual classes, turn your camera on, double check your mic and be ready to participate in all of your classes via Zoom."}], "file_structural_elements": {"title": "Editorial: The Pirate’s Eye guide to proper Zoom etiquette", "date": "November 13, 2020", "writer": null, "description": "     As you look across the gallery view during your third-hour class, your eyes drift to a student devouring a full-course meal, another arguing with their sibling while unmuted and the third texting on their phone, not paying attention. Welcome to school via Zoom.\n     The 2020-21 school year open", "image": null}}