{"tree_elements": [{"text": "Vaping is an epidemic spreading in schools. One in four teenagers have vaped, 1,500 vaping-related illnesses have been reported and 33 deaths according to the Centers for Disease Control as of Oct. 21, 2019."}, {"text": "“I think vaping is a big issue in school right now,” said senior Romelo Collier. “A lot of kids try to hide it.”"}, {"text": "How did young people start vaping?"}, {"text": "The first commercially successful vape, a device that allows the user to inhale nicotine as vapor, was created in 2003. Although companies that manufacture vaping products claim that it is made for adults, teens have taken to this harmful trend because of the mistaken belief that vaping is safer than smoking cigarettes. Electronic-cigarette sales skyrocketed from $20 million in 2008 to $10 billion in 2017. This increase in revenue is largely due to teenagers’ interest in the product."}, {"text": "Vaping companies attract young customers by producing flavors that make the product seem like choosing candy.\n“They have a large variety of flavors and some of them are very appealing to young people,” said a sophomore who did not want to be identified."}, {"text": "According to a study by the Centers for Disease Control and Prevention and the Food and Drug Administration, 31 percent of those who use e-cigarettes do so because of the variety of flavors, like cotton candy, buttered popcorn, and cucumber."}, {"text": "A junior told The Pirate’s Eye staff that peer pressure is among the top reasons why teens vape. But the pressure to look “cool” in front of friends can be a dangerous choice."}, {"text": "Because of marketing techniques that specifically target young adults, teenagers are now more likely to start vaping than adults. While 2.8 percent of U.S adults use e-cigarettes, a staggering 20 percent of high schoolers vape. Social media has played a major role in popularizing vaping. In fact, when JUUL launched in 2015, they spent over 1 million dollars advertising their products on Twitter and other media platforms."}, {"text": "The use of vaping products among teenagers is still on the rise."}, {"text": "An FDA study last year found that 3 million high school students vaped in 2018, a marked increase from 1.7 million the year before."}, {"text": "Many people are unaware of the health effects of vaping. An informal survey conducted by the Pirate’s Eye staff found that about 73 percent of South students don’t know the dangerous consequences of vaping."}, {"text": "Young adults who have begun to vape are likely to develop irreversible health effects because of their age and vulnerability to toxic substances that can damage the lungs. Side effects include nosebleeds, dry skin, dizziness, and nicotine addiction."}, {"text": "Is there a solution?"}, {"text": "Last year, pressured by the FDA, JUUL stopped selling of flavored e-cigarettes in retail stores. The Trump administration announced in mid-September that it plans to ban vapes with flavors in response to the vaping crisis among teenagers that has resulted in vaping-associated injuries to the lungs."}, {"text": "Educational measures have been taken by South school administration to solve the problem."}, {"text": "“District administrators and student assistant counselors attended a program last year about the dangers of vaping,” said Principal Dennis Lepold. “In our Health Curriculum, it is covered in just about every grade level.”"}, {"text": "During Back To School Night in the beginning of October, Mr. Lepold also spoke out about the dangers of vaping and drugs to parents."}, {"text": "In addition to educational means, rules have been put in place to protect students’ health. If a student is caught with a vape, he or she will be suspended for a day and counseling is required to assist the student in understanding the dangers of vaping."}, {"text": "Awareness about vaping is no longer a suggestion–it is a necessity."}], "file_structural_elements": {"title": "Editorial: vaping epidemic gets increasingly serious", "date": "November 1, 2019", "writer": null, "description": "Vaping is an epidemic spreading in schools. One in four teenagers have vaped, 1,500 vaping-related illnesses have been reported and 33 deaths according to the Centers for Disease Control as of Oct. 21, 2019.\n“I think vaping is a big issue in school right now,” said senior Romelo Collier. “A lot of k", "image": "https://thepirateseye.org/wp-content/uploads/2019/11/VapingEditorialWebsite.png"}}