{"tree_elements": [{"text": "Honking, revving engines, and blasting music: the symphony of the South parking lot at the end of the school day. The madness of students trying to leave the school parking lot at the end of the day can lead to dangerous and expensive consequences."}, {"text": "Senior Arjun Jaswal describes the parking lot after school as “a war zone with people rushing out of their spot and giv[ing] no regard to other cars.”"}, {"text": "This chaos stems from a variety of reckless behaviors that newly licensed drivers seem to excel at in crowded parking lots."}, {"text": "Let’s start with reversing. When you reverse a car, it is imperative to look through your back window to make sure no one is walking behind you, there are no cars zooming by behind you or another car isn’t backing up at the same time as you. This means physically turning around and looking back — not only looking into the rear view camera or just checking through the rearview mirror."}, {"text": "Students don’t tend to look all the way back due to the physical effort it takes to rotate for a moment They also may be on their phones, or their modern cars have a camera to show the pavement behind them."}, {"text": "With the density of the parking lot at the end of the day, there is almost always someone or something behind you when you are reversing. So, the message is: if you’re going backward in your car, you should be looking backward, too."}, {"text": "Even the parking itself is something that we need to talk about. The lines painted on the pavement are there for you to park between. This doesn’t mean on them, through them, or across them. The parking lot is meant for parking. So, if you can’t learn to park, maybe don’t try in the school parking lot."}, {"text": "One of the main reasons students exhibit reckless driving is to show off to their friends. Senior Alexis Esi said, “If you feel that the school parking lot is an appropriate place to show off your car’s prowess to your friends, you’re simply wrong. It is unfair to the rest of us for you to put us in danger for a couple of revs.”"}, {"text": "Many times, students will speed through the aisles of the parking lot, ignoring people walking through or other cars driving. Whether this is to look cool or to simply rush to their next destination, this behavior is dangerous and can cause accidents."}, {"text": "Esi explained, “Everybody feels like they need to go where they’re going as fast as they can, which leads to the kind of fast and risky behavior that leads to accidents.” Realize that it is better to get somewhere a few minutes late, rather than hours late and pay a few hundred dollars because you got into an accident."}, {"text": "“We should be more calm on the way out [of] school,” Jaswal said. “It takes time to get out of the lot and people should just understand that. There’s no reason to freak out and try to floor it.”"}, {"text": "If you have the privilege of having a car and the ability to park in the school parking lot, don’t abuse it by putting others in danger."}], "file_structural_elements": {"title": "Editorial: If you are parking in the South parking lot, drive safely", "date": "April 1, 2019", "writer": null, "description": "     Honking, revving engines, and blasting music: the symphony of the South parking lot at the end of the school day. The madness of students trying to leave the school parking lot at the end of the day can lead to dangerous and expensive consequences. \n     Senior Arjun Jaswal describes the parkin", "image": null}}