{"tree_elements": [{"text": "As you walk into the South bathrooms, you might notice a wet puddle. Maybe you’ll notice the stench of unflushed toilets, or the decaying passes left in the stalls. Maybe you’ll even notice someone walking out of the bathroom after they failed to take the time to wash their hands."}, {"text": "Many of you now have a queasy feeling in your stomach as you reflect on the state of South’s bathrooms. Why do these issues with our bathrooms continue to exist? There is a very simple answer to this question — the student body needs to start working towards making our bathrooms a cleaner place. This is what we need to do."}, {"text": "The first step in improving the quality of South’s bathrooms is learning to practice proper hygiene. When you enter the bathroom, before you do anything else, leave the pass that you brought to the bathroom outside of the stall."}, {"text": "Either put it on top of the sink or to have a friend hold it, but don’t take it into the stall, because other people will use that pass after you."}, {"text": "When you’re in the stall, do your business without trickling over the toilet. Junior Muku Tuppil describes seeing trickles on the floor as an experience that “makes [him] want to cry.” By taking an extra second to make sure you’re on target, walking through the bathroom will be without hazard for everyone else."}, {"text": "Next, flush the toilet. “No one wants to flush someone’s else’s business down the toilet,” Tuppil said."}, {"text": "Take an extra second to press the small, easily accessible black button placed above the toilet.  If you don’t want to touch the button with your hands, you can work on your flexibility until your foot can reach the flush button! This will improve both the look and smell of the bathroom tremendously."}, {"text": "In your final step to a pleasant and hygienic visit to the school bathroom, take time to wash your hands."}, {"text": "“When I see people not wash their hands it makes me angry and disgusted,” senior Sahil Srivastava said."}, {"text": "Many of us learn at a young age that when approaching the task of washing our hands we must first apply soap, sing the entirety of the ABC song while rubbing the soap between our fingers and the front and back of our palms, and then wash our hands off with water. This process should be ingrained in all of our minds."}, {"text": "Why is washing your hand after using the bathroom important?  80 percent of common infections are spread by hands. This number would lower significantly if people routinely washed their hands."}, {"text": "According to the Centers for Disease Control and Prevention, “researchers in London estimate that if everyone routinely washed their hands, a million deaths a year could be prevented.” Essentially, by washing your hands, you could be preventing your classmates from getting sick!"}, {"text": "At the end of the day, until everyone takes accountability for their actions in the South bathroom they will continue to be a place where people dread going. Be the change you wish to see in the South bathrooms."}], "file_structural_elements": {"title": "Editorial: how to keep bathrooms clean", "date": "May 21, 2019", "writer": {"vcRNXdDaPStd2IWpBNRh": {"name": "Alexa Bornstein", "year": "2018"}}, "description": "     As you walk into the South bathrooms, you might notice a wet puddle. Maybe you’ll notice the stench of unflushed toilets, or the decaying passes left in the stalls. Maybe you’ll even notice someone walking out of the bathroom after they failed to take the time to wash their hands. \n     Many of", "image": null}}