{"tree_elements": [{"text": "Africa is beautiful–it contains a unique ecosystem of deserts and forests with diverse animals, it is a great philosophical and cultural entity and it is the motherland of humans."}, {"text": "Education of African history and culture is lacking at South, just as it is in high school curricula nationally. The only information about Africa that most South students learn about is the slave trade or ancient Egypt, which only comprises about three percent of Africa’s geography."}, {"text": "History teacher Brian Levinson said, “Africans are creators of their own destiny.”"}, {"text": "Speaking about the history of colonization, Mr. Levinson said of newly formed African countries,  “They were not simply granted freedom; rather, they engaged in hard-fought resistance and they won that freedom.”"}, {"text": "While some may think that African history has nothing to do with the U.S, this is far from true."}, {"text": "According to the website for African American studies at the University of Pittsburgh, “Right now, African immigrants are establishing more and more communities in America, thus enriching our own American culture, which puts the study of African issues and cultures at our front doorstep.”"}, {"text": "Sydney Miller, World History teacher, said, “We should learn to celebrate the unique achievements and contributions of all places and cultures whenever we can. I say this because I think a lot of the social issues we see and hear about in America today result from a lack of cultural awareness.”"}, {"text": "I conducted a Google Forms survey about Africa to see what students have learned and understood about African history."}, {"text": ""}, {"text": "Though the study sample was small, the overwhelming response was that students are in favor of more education about African history."}, {"text": "Julian Huynh, a freshman, said in the survey, “We need to learn more about things happening outside of America, here in [WW-P] we live in bubbles, we need to go out more, learn about more than just what’s happening in the U.S.”"}, {"text": "*link to='https://www.ucis.pitt.edu/africa/why-study-africa'*University of Pittsburgh*/link*"}, {"text": "It’s one thing to talk about the lack of education about Africa, but it’s another to propose solutions for it. Mrs. Miller said, “While World History would likely be the course in which students could learn more about this region, it is difficult to fit in- as the course looks at [the] bigger picture.” However, she suggested that a global study or geography course could address the history of Africa more specifically."}, {"text": "A global studies class that is focused more on African history, one that goes over the African history region by region with a curriculum similar to curricula of European or American history classes. This would be an opportunity for students to become better informed about a neglected area in world history. This way, students can be more educated and better prepared to enter the world after graduation."}, {"text": "As Nelson Mandela, a former president of South Africa, once said, “Education is the most powerful weapon we can use to change the world.”"}, {"text": "Graphic by Jordan Blaise."}], "file_structural_elements": {"title": "Education on African history: First steps towards inclusion and change", "date": "January 12, 2021", "writer": {"441oJuAOMJ93mb04Urf2": {"name": "Jordan Blaise", "year": "2021"}}, "description": "     Africa is beautiful–it contains a unique ecosystem of deserts and forests with diverse animals, it is a great philosophical and cultural entity and it is the motherland of humans.          \n     Education of African history and culture is lacking at South, just as it is in high school curricula", "image": "https://thepirateseye.org/wp-content/uploads/2021/01/74B70E96-43EF-4673-A1A3-AC90236809EF-900x395.png"}}