{"tree_elements": [{"text": "In our era fake news, one of the latest trends in misinformation has led to the return of measles and a rise in the anti-vaccination movement."}, {"text": "*link to='https://www.cdc.gov/media/releases/2019/s0424-highest-measles-cases-since-elimination.html'*“695 cases of measles [in] 22 states*/link*"}, {"text": "Measles is a viral infection with symptoms including fever, fatigue, cough, irritated eyes and a blotchy red rash that characterizes the disease. Children are most vulnerable to the infection, which can be fatal, which is why the affected states are concerned."}, {"text": "*link to='https://www.nbcnews.com/health/kids-health/uc-davis-medical-center-warns-200-people-potential-measles-exposure-n991166'*The New York Department of Health has issued a ban on unvaccinated children and adults from public areas.*/link*"}, {"text": "Responding to this move, Mrs. Giambagno, a Health Administrator at South, explained, “If I had the measles vaccine and I didn’t realize that I was exposed, I’ve exposed everybody who has not been immunized against the disease so it was definitely justified.”"}, {"text": "The danger lies in the fact that measles is an airborne disease. Dr. Meenakshi Bhattacharya, who teaches Advanced Placement Biology at South, said that measles spreads “through contact, as airborne particles. Just by touching someone you can get measles. You can get measles even being in the same room or the same general area.”"}, {"text": "Because measles is an easily spread disease, it is important to get vaccinated; a choice that some are not making for their children."}, {"text": "*link to='https://www.cdc.gov/measles/about/history.html'*According to the CDC*/link*"}, {"text": "*link to='https://www.cdc.gov/measles/cases-outbreaks.html'*greatest number of cases since 1994”*/link*"}, {"text": "While some choose not to get vaccinated because of their faith, or medical reasons, the movement is mainly made-up of concerned parents that think vaccines are dangerous."}, {"text": "*link to='https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3136032/'*The MMR vaccine and autism: Sensation, refutation, retraction and fraud*/link*"}, {"text": "*link to='https://www.bmj.com/content/342/bmj.c7452'*this claim was disproved by the British Medical Journal (BMJ)*/link*"}, {"text": "*link to='https://www.who.int/emergencies/ten-threats-to-global-health-in-2019'*seen a 30% increase in cases globally*/link*"}, {"text": "While Wakefield’s study was published in 1998, false information continues to spread via the internet."}, {"text": "Circles of distrust on websites such as Facebook and Instagram propagate the doubts of anti-immunization supporters, and continuing the cycle of spreading misinformation."}, {"text": "Through these sites, seemingly credible blogs and links to articles written by false experts are spread. “It just becomes this cyclical feed, this positive reinforcement loop,” commented sophomore Alexander Valentino."}, {"text": "Vaccines are not a danger, but as long as false information circulates on the web, people are susceptible to believing that they are."}, {"text": "Valentino warned, “Just because we’re modern doesn’t mean that we can’t fall to these same traps.”"}, {"text": "Avoiding these circles is even more important when considering that some people can’t get vaccinated due to medical or religious reasons."}, {"text": "People whose immune systems are compromised cannot protect themselves by producing antibodies, blood proteins that fight disease. Their bodies cannot fight off vaccinations, a weaker strain of the disease, much less a healthy one. Others are not able to get immunized because of their faith."}, {"text": "For them, their only hope is that the rest of us are immunized."}, {"text": "“Say that if about 96% of the population is vaccinated, then the other 4% of the population is protected by the people who are vaccinated. And that’s called herd immunity. So as a result of that, there is protection for members in the population who cannot get vaccinated because of some really serious reasons,” explained Dr. Bhattacharya."}, {"text": "By getting vaccinated, we act as a shield for the unvaccinated people who are susceptible to measles. By choosing not to, we are a danger to those that do not have our choice."}, {"text": "Herd immunity is part of the reason why students at South are required by the state of New Jersey to get certain vaccines. Exceptions such as religious and medical reasons are allowed according to Mrs. O’Connor, a Health Administrator at South."}, {"text": "“We have very few of those families but we would reach out to those families and let them know that the student can’t come to school in the break of the measles, mumps, or rubella,” Mrs. O’Connor added."}, {"text": "Considering the fact that the unvaccinated populace is surviving off vaccinated people, people who are able to be immunized need to get vaccinated."}, {"text": "Vaccines do not pose a danger to common child’s developmental health, but anti-vaxxers do for those that cannot get immunizations due to religious or medical reasons."}, {"text": "There’s no excuse to not get vaccinated. Otherwise, you could be the cause behind another outbreak."}, {"text": ""}], "file_structural_elements": {"title": "False information: why vaccines are necessary", "date": "May 21, 2019", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}, "PFbYduz7YRHNd926Xd3Z": {"name": "Shriya Deshmukh", "year": "2020"}}, "description": "     In our era fake news, one of the latest trends in misinformation has led to the return of measles and a rise in the anti-vaccination movement.  \n    The growing popularity of the anti-vaccination, or anti-vax movement, in America has resulted in “695 cases of measles [in] 22 states,” according ", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/SYRINGECOLORED.png"}}