{"tree_elements": [{"text": "Prom season is here and along with it comes the stress of finding a dress, buying a corsage, and finding a date. Students have the option to go alone or with friends, but even then, many people still feel pressured to go with a date."}, {"text": "It’s understandable when you think about why people feel this way. Tabloids and social media constantly harp about finding a date for dances, and it’s difficult not to feel inclined to follow these patterns when everyone talks about them."}, {"text": "A lot of pop culture that we have grown up with features the idea of the esteemed prom date. “People feel pressured by the stereotype that everybody has a date,” says junior Aadil Makkar, “but you can have just as much fun on your own.”"}, {"text": "We also grow up with teenage-targeted movies focused on a wishful girl trying to find a date for a seemingly life-changing dance. Popular rom-coms such as “Sixteen Candles” and “Ten Things I Hate About You” are just a few of the many movies that perpetuate this theme."}, {"text": "Prom is a perfect example of this kind of dance: a dance where we feel obliged to conform to illogical standards."}, {"text": "According to the Odyssey, an American media website, many girls see prom as a wedding pre-trial, which is one of the reasons why so many people think it has such a pivotal influence in their life. They feel the need to do their hair, get their makeup done, and to find a date so it feels like an actual wedding."}, {"text": "This comparison seems a little extreme, but it’s evident that the underlying themes are there."}, {"text": "In retrospect, all of his hype for a prom date isn’t necessary. It’s simple: if you want a prom date, go with someone, if you don’t, then don’t bother."}, {"text": "Don’t let preconceived notions and norms determine how you spend an exciting night of your high school life."}, {"text": "We should normalize going to prom alone because not everyone wants to go with someone in a romantic way. Meghana Tera, a junior, said that “you can go alone, spend prom with your friends and still have a great time.” A recurring trend at South, she said, is that “most people end up ditching their dates anyways.” Even if they do have a date, they don’t end up spending the night with them."}, {"text": "There are benefits of going to your prom alone. “You don’t have to pay for someone else,” said junior Megha Senthil, “and when you’re a student, you’re on a budget.”"}, {"text": "In addition, Senthil said that “if you go alone, you’re not obligated to stay with a certain person” and “can wander and spend time with those you choose.”"}, {"text": "It doesn’t make sense for someone to spend time and energy on finding a date when they might not end up spending or enjoying that time with them in the end. Going without a date seems much simpler and much less stress-inducing."}, {"text": "So when prom season, or even just any regular dance comes along, keep in mind that the most important thing is enjoying yourself. Whether it be alone, with a friend, a group, or a date, there’s no judgement of the way you spend your night."}], "file_structural_elements": {"title": "Going with friends: alternative to coveted prom dates", "date": "May 21, 2019", "writer": {"SbITCtXVmWYkqTpn6l43": {"name": "Eugenia Ma", "year": "2019"}}, "description": "     Prom season is here and along with it comes the stress of finding a dress, buying a corsage, and finding a date. Students have the option to go alone or with friends, but even then, many people still feel pressured to go with a date.\n     It’s understandable when you think about why people feel", "image": "https://thepirateseye.org/wp-content/uploads/2019/05/CORSAGECOLORED.png"}}