{"tree_elements": [{"text": "When my LA II Honors students began James Baldwin’s The Fire Next Time in the second week of March, a student brought up Ahmaud Arbery’s shooting during class discussion on Google Meet.  By the time we finished Ta-Nehisi Coates’s Between the World and Me after the Memorial Day holiday, the George Floyd protests erupted."}, {"text": "A group of my students participated in a Socratic Seminar to discuss recent events.  Below, you will read a strategy of action they came up with to address racism in our own community."}, {"text": "-Ms. Sima Kumar"}, {"text": ""}, {"text": "At South, we think of ourselves as reasonably diverse, with a student body that is 65 percent Asian, 24 percent White, four percent Hispanic and five percent Black, according to the most recent demographic data from the Department of Education. This has, however, blinded us to the discrimination that black students face."}, {"text": "The culture of the student body is fundamentally flawed, as highlighted by recent inappropriate social media videos posted by a student. Although the school district took swift action in addressing the incident, we must ensure that it does not occur again. As students of South, we believe that our school — as an institution of learning — has an undeniable responsibility to educate its students, taking the first step toward fighting systems of oppression."}, {"text": "The recent murders of George Floyd, Breonna Taylor, Ahmaud Arbery and others have shocked our society and called us to dismantle the entrenched systemic racism that oppresses so many people in this country. High School South must be part of this movement. The school district is obligated to educate students on issues of oppression and systemic racism and to foster a culture of antiracism. We believe there are five actions, as detailed below, that we as a school can take towards accomplishing this task."}, {"text": "First, we encourage High School South students to make a commitment to reading Ibram X. Kendi’s book How To Be an Antiracist over the summer. Kendi is one of the leading scholars of race and discriminatory policy in America and a strong proponent of antiracism."}, {"text": "In his words, “One either allows racial inequities to persevere, as a racist, or confronts racial inequities, as an antiracist. There is no in-between safe space of ‘not racist.’” If we are to commit to confronting racism as per Dr. Aderhold’s letter, it is essential that we adopt this antiracist perspective; students must be provided the resources to do so on the individual level."}, {"text": "We suggest that while reading, students take notes, show evidence of discussion with a peer and prepare for further discussion at the start of the academic year. We believe that the school district should also provide an evolving database of resources — including but not limited to Kendi’s “Stamped from the Beginning,” Michelle Alexander’s “The New Jim Crow,” Ta-Nehisi Coates’s “Between the World and Me,” and James Baldwin’s “The Fire Next Time” — published on the district website and emailed to students and families to encourage further investigation and discussion."}, {"text": "Second, we believe that the establishment of an ally group or “Antiracism Club” would be invaluable to the school. Such a group would begin doing the work outlined in Kendi’s book, applying the knowledge accrued over the summer. It would encourage student involvement in actionable antiracism and collaborate with the school’s cultural clubs (i.e. the BSU, SAASA, KSU, JSU, Chinese Club and Hispanic Club) to support and amplify their voices."}, {"text": "This group would also be responsible for curating the school’s antiracism database and running a social media account so as to be more accessible to students and the WWP community. The official formation of such a club would help create a space for safe discussion and show the school’s commitment to antiracism."}, {"text": "Third, it is essential that the school district remain proactive toward issues of race in our school. It is not uncommon to hear racial slurs casually thrown around by students. This normalizes racism, allowing students to distance themselves from its viscerality while continuing to perpetuate it."}, {"text": "Even when a statement is intended as a joke, force of habit coupled with a culture of normalization means that such statements are thoughtlessly repeated. We feel that the school must make a conscious effort to dismantle this casual treatment of racism by holding school climate assemblies throughout the year where these issues are explicitly addressed."}, {"text": "Fourth, we feel that teachers must be equipped to address issues of race in the classroom. They are directly responsible for students’ learning and must therefore be able to act as upstanding examples, teach accurate information in a sensitive manner and maintain safe, equitable spaces for students. To us, the best way to implement this is to include it in teacher training sessions and Professional Development days."}, {"text": "Lastly, it is our belief that the social studies curriculum needs to undergo revision. Black history is not to be saved for Martin Luther King Day, or February. The experience of black Americans is treated as the exception, when it is in fact American history and therefore essential to an equitable curriculum. In particular, the Reconstruction era unit — the study of which is crucial to understanding the 20th and 21st centuries — lacks in substance and depth. Additionally, there is no discussion or condemnation of previous discriminatory policy (e.g. the 3/5ths compromise), as it would supposedly undermine the principle of historical neutrality. However, neutrality is not an option when issues of human rights and injustice are concerned; encouraging students to understand different historical perspectives is not license to legitimize those perspectives."}, {"text": "We can not be passive, as James Baldwin writes in “The Fire Next Time”: “we, with love, shall force our brothers to see themselves as they are, to cease fleeing from reality and begin to change it.”"}, {"text": ""}, {"text": "Photo Courtesy Ms. Sima Kumar"}], "file_structural_elements": {"title": "Guest editorial: South Students Commit to Antiracism", "date": "June 19, 2020", "writer": {"": {"name": "Dean Lourenco", "year": ""}}, "description": "When my LA II Honors students began James Baldwin’s The Fire Next Time in the second week of March, a student brought up Ahmaud Arbery’s shooting during class discussion on Google Meet.  By the time we finished Ta-Nehisi Coates’s Between the World and Me after the Memorial Day holiday, the George Fl", "image": "https://thepirateseye.org/wp-content/uploads/2020/06/20200619_122705-900x506.jpg"}}