{"tree_elements": [{"text": "My most vivid memory of childhood is walking between bookshelves, pulling out a book and flipping through pages of words. Words that described characters. Characters that created a story world. Stories that shaped me. Stories that taught me the meaning of equity and inclusion. Acceptance and friendship. Books were my joy."}, {"text": "But every year, books are banned from community and school libraries. According to the American Library Association, of the top ten banned books of 2019, eight of them venture into LBGTQIA+ and sexual orientation topics, such as “George,” “Beyond Magenta,” “Prince & Knight.” Some parents take days off from work and petition to remove these books. But this issue affects more than parents. Kids are reading these books–it is their voices that are not heard."}, {"text": "Gabrielle Izu from James Taylor High School said, “I ignored [my sexuality] for a really long time. And I think that as a young girl, if a book showed me that this is a life that could be lived, I could have had a lot more peace and coming to terms with bisexuality.”"}, {"text": "For many students, being part of the LGBTQIA+ community comes with a feeling of isolation and exclusion. By reading about a character in a book that they can connect with, these kids can avoid feeling isolated in their differences–a character who is a mirror of themselves. By banning these books, we are stealing the only friend many students have in adolescence."}, {"text": "What these decision makers feed children is that their identity will not be accepted. Students from Katy Independent School District collectively agreed, “It felt like my identity was seen as dangerous because of the banning of a story like that. What about my story? Am I seen as a bad influence?” These decisions to ban certain books are disappointing because they encourage exclusion. Societal norms force our minds to shun “queer” individuals. Let your children embrace them."}, {"text": "Many parents want their children to be protected from these seemingly uncomfortable topics and keep them in their shell. But I believe this shell needs to be broken to build tolerance and acceptance. The representation seen in these books explore positive themes in young minds–equity, inclusion, acceptance, and friendship."}, {"text": "Open your eyes. Open a book. Allow that “illegal” literature to be picked up and let each unread word be read."}, {"text": "PHOTO BY RENEE PUJARA"}], "file_structural_elements": {"title": "Guest Op-ed: Break the shell, keep the book", "date": "June 22, 2022", "writer": {"": {"name": "Sobhika Sampath", "year": ""}}, "description": "My most vivid memory of childhood is walking between bookshelves, pulling out a book and flipping through pages of words. Words that described characters. Characters that created a story world. Stories that shaped me. Stories that taught me the meaning of equity and inclusion. Acceptance and friends", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/IMG_6183-675x900.jpeg"}}