{"tree_elements": [{"text": "The end of the school day marks the start of every high school student’s evening filled with homework assignments and studying. Students work hard till late at night only to find that the hard work and effort they put into their homework assignments does not accurately reflect their overall grade."}, {"text": "Homework assignments are only 10 percent of a student’s entire marking period grade for most courses offered at South, such as World History and Biology. The remaining 90 percent is distributed differently depending on the class, but in most classes, it is reserved for assessment grades. In World Language classes, it is split up between Interpretive, Interpersonal, Presentational and Supportive Assessments. This means the time and effort students put in for homework does not shine through as much as acing a test does."}, {"text": "Biology teacher Meenakshi Bhattacharya said, “In order to understand the material better, we give you the home-work, in which you practice that material.” The weight of homework assignments toward the final class grade causes students to neglect this purpose and not use it as a learning tool because they don’t feel the hard work is worth it if it doesn’t affect their class’s overall grade."}, {"text": "French teacher Szilvia Juhasz said, “With some students, I see if you tell them this is something you need for an assessment, they will put more effort into it.” This is a common mentality among students: they are more likely to work harder on homework that will help them get a better course grade."}, {"text": "Students have little motivation to complete homework assignments. Freshman Riana Fazir said, “[The weight of homework assignments] motivates me less because the effort I spend on homework is only put into 10 percent of my grade.” If students aren’t motivated to complete these assignments because they feel that it is not important to their grade, then they are not getting extended learning experience that could help them with assessments."}, {"text": "Assessments do not offer the same learning experience as homework assignments because they assess how much the student knows. But assessments are given a significantly higher weight. Giving homework assignments such a small weight in comparison to assessment grades gives students the message that what they know is more important than how much they learn."}, {"text": "Tests may not correctly assess how much the student knows and has learned throughout a unit. Freshman Dharma Rajesh said, “In subjects like World History sometimes if you don’t remember something it can reflect that you don’t know anything, which is not really the case.” Homework assignments are created to help students practice the content they need more help with and to further their understanding."}, {"text": "Sophomore Sophia Kravets said, “It’s an opportunity to practice. Especially in a class like a math or science class, where it’s some difficult concept, I think it’s really good to, in moderation, to practice those things, so that you can really get it in your system.”"}, {"text": "Even though students dread having to do homework assignments, there is a lot to gain from them, including better performance and preparation for assessments, which can only happen if they approach it with a motivated mindset."}, {"text": "“Kids who take their homework seriously, they tend to do better on tests,” said Dr. Bhattacharya."}, {"text": "A good solution would be to increase the weight of homework assignments to 30 percent. This would allow for homework assignments to have more of an impact on the overall course grade, and still allow for assessments to have significant weight."}, {"text": ""}, {"text": "IMAGE BY VIVIAN XIE"}], "file_structural_elements": {"title": "Homework: is it worth its weight?", "date": "May 5, 2022", "writer": {"TtzLeEsqVllY4uMU8Zl6": {"name": "Manika Niwas", "year": "2022"}}, "description": "     The end of the school day marks the start of every high school student’s evening filled with homework assignments and studying. Students work hard till late at night only to find that the hard work and effort they put into their homework assignments does not accurately reflect their overall gra", "image": "https://thepirateseye.org/wp-content/uploads/2022/04/Screenshot-2022-04-01-11.24.27-AM.png"}}