{"tree_elements": [{"text": "Three people walk into a Halloween party. One is dressed as a princess, the second as a mouse, and the third as a Native American. See anything culturally inappropriate, even offensive, with one of them?"}, {"text": "Every Halloween, there are plenty of costumes in stores that depict other cultures. Many people wear the costume and do not even realize that there is cultural significance to what they are wearing. People who choose to wear these costumes wear it for one night but for the rest of their lives, do not face the prejudice that actual people from that culture face."}, {"text": "For example, Native American headdresses are commonly found in costume stores. While people attending a Halloween party wear the headdress as a fashionable outfit, they overlook the  significance a headdress has to Native Americans. According to Native American Language, many of these headdresses are used by different Native American tribes such as the Sioux, Crow and Cheyenne and these headdresses are made up of eagle feathers. They can earn an eagle feather only by performing a selfless act of courage and honor. Therefore, those with a full headdress made up of eagle feathers had performed many acts of courage. Most people don’t know of this meaning and sport a costume headdress casually. This is disrespectful to Native Americans because it reduces their complex culture to one thing: a plastic headdress made of colorful fake feathers that is cute and will be worn for only one night.."}, {"text": "One company that has been selling culturally inappropriate costumes is Yandy. Last year, a group of Native American women went to the company’s headquarters in Arizona to protest the “sexualization of indigenous women.” This is because Yandy was selling Native American costumes on their website. The protest occurred because Yandy was under attack by many people online for ignoring the racism that Native American women face and while making money off of their culture."}, {"text": "Some people argue that minority groups do not mind seeing their cultures reduced to a Halloween costume because people who wear cultural costumes for Halloween are appreciating other cultures. However, the issue with Yandy reveals the opposite. The truth is that people who wear cultural costumes do not have a true interest in those cultures."}, {"text": "Senior Jillian D’Souza said, “Cultural appropriation stems from ignorance and when people do this they aren’t respecting that person’s culture and they may not be aware of how they’re being disrespectful.”"}, {"text": "Since many people are confused about the difference between cultural appropriation and cultural appreciation, it is best to define the two terms. Cultural appropriation is a term used to describe when one group takes creative and artistic practices from another group without understanding the source. However, cultural appreciation is when people use parts of another culture while honoring that culture."}, {"text": "While many people may find cultural appropriation okay, as an Indian, it is offensive when someone puts on brownface and speaks in an Indian accent for their Halloween costume. This type of costume takes one ethnicity, which is made up of diverse people, and shrinks it into one overwhelming stereotype that the rest of the world sees."}, {"text": "I feel that the rest of the world should know that one race is not made up of one person, but a variety of people who all have different stories to tell."}, {"text": "Many people may be confused about what they can dress up as next year. The answer is any costume that you think is slightly offensive is best left alone. Even if you appreciate the culture and ask someone from the culture if they are okay with it – chances are someone will still find it offensive."}, {"text": "IMAGE COURTESY: WWW.PIXABAY.COM"}], "file_structural_elements": {"title": "Is cultural appropriation for Halloween costumes okay? – Con", "date": "November 14, 2018", "writer": {"BEBL4ArsEm9smMlIITfG": {"name": "Namitha Sethuraman", "year": "2018"}}, "description": "     Three people walk into a Halloween party. One is dressed as a princess, the second as a mouse, and the third as a Native American. See anything culturally inappropriate, even offensive, with one of them?      \n     Every Halloween, there are plenty of costumes in stores that depict other cultur", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/pumpkin-2327488_960_720-900x600.jpg"}}