{"tree_elements": [{"text": "For the longest time, I despised Halloween. I’d see costumes of people standing at my door waiting for candy: a Caucasian girl dressed as Pocahontas, an Indian girl sporting dreads and dressed as Michonne from The Walking Dead, a young boy dressed as Barack Obama wearing blackface."}, {"text": "I was uncomfortable with the idea of appropriating a person or character from a culture different from one’s own as costume and lost interest in Halloween. I brought it up with my mom, an Indian immigrant, and told her I felt  uncomfortable when people took something from my culture, and others, and wore it so casually, like during Halloween. She said Indian culture not just our culture."}, {"text": "Some see that the biggest issue with cultural appropriation is the fear that a costume may use a culture’s aesthetics and appear offensive to the people from that culture. Although this is true for some, for others this issue is non-existent . Everyone has their own attachment to their culture, creating different opinions on what may seem offensive."}, {"text": "When people are accused of cultural appropriation, they are asked if they discussed with someone from the culture if the costume was okay? But to give a random, single person the power to determine what is wrong or right is flawed."}, {"text": "Senior Aditi Pal believes people using Indian culture as a costume is not as offensive as others make it out to be. She believes that when people wear Indian clothes or jewelry, it “comes from a place of interest” and rather than offending people, they want to “appreciate or take part in something they find cool.”"}, {"text": "And it’s true. In a New York Times article, Kwame Opam interviewed people after the initial release of the movie “Black Panther” on what they thought about white children wearing costumes of African American characters from the movie."}, {"text": "Evan Narcisse, a senior writer for the website io9, a blog focused on all things science fiction, said, “You want that white kid to be able to think that he can dress up in a Black Panther costume, because, to that kid, there’s no difference between Captain America and Black Panther…”"}, {"text": "Children wear costumes because they want to be a character or celebrity they find admirable. A child would wear a Black Panther costume because they find the Afro-centric world exciting and the characters cool."}, {"text": "Like children, teens and adults have similar mindsets. Olivia Sloan, senior, says “I think most people don’t want to [cultural appropriate] during Halloween to purposely offend others,” as people want to take part of a culture they find intriguing."}, {"text": "Think of the traditional Kapa Haka of Hawaiian culture, the traditional buckskin dresses of Native Americans, even henna from South Asia; all of these things are beautiful to people and become part of costumes during Halloween."}, {"text": "If we open up our cultures to different people and they take part in it, it gives us an opportunity to show off the beauty of our heritage."}, {"text": "My mom taught me that the intensity of someone’s attachment to their culture sways what they find offensive or not. A costume shouldn’t bring out hurt feelings, it should bring out excitement."}, {"text": "Next Halloween, if you chose to wear a sari or a Pocahontas costume make sure your costume comes from a place of interest and appreciation rather than a place of disrespect."}, {"text": "IMAGE COURTESY: WWW.LUKE.AF.MIL"}], "file_structural_elements": {"title": "Is cultural appropriation for Halloween costumes okay? – Pro", "date": "November 14, 2018", "writer": {"818DmKSTZB84ddo0ViFd": {"name": "Maanya Narain", "year": "2018"}}, "description": "For the longest time, I despised Halloween. I’d see costumes of people standing at my door waiting for candy: a Caucasian girl dressed as Pocahontas, an Indian girl sporting dreads and dressed as Michonne from The Walking Dead, a young boy dressed as Barack Obama wearing blackface.\n     I was uncomf", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/171023-F-EC705-050.jpg"}}