{"tree_elements": [{"text": "New Jersey could be on its way to becoming a Republican state."}, {"text": "On Nov. 6, New Jersey voters will decide who fills one of two seats in the United States Senate. Less than a week away, the race is undeniably close. According to a recent Stockton University poll, Republican candidate Bob Hugin is only two percentage points behind Democratic candidate Robert Menendez."}, {"text": "Democrats Robert Menendez and Cory Booker are the current sitting senators for New Jersey. Booker’s position is not up for grabs until 2020, leaving Menendez fighting for his 3rd re-election this election cycle. A Republican has not filled a Senate seat for New Jersey since 1972, but the polls show this might change. In order for it to happen, New Jersey voters will need to put their morals above party politics."}, {"text": "Robert Menendez has been charged with 14 corruption charges including bribery and fraud. Someone embroiled with so much scandal should not continue to be in a position to determine New Jersey’s legislation."}, {"text": "New Jersey residents are aware of Menendez’s dishonesty and past scandals. “People don’t often pay attention to if Menendez is innocent or guilty,” said Walter Conner, an American studies teacher. “They pay attention to the fact that he was in a scandal.”"}, {"text": "In order for change to happen, people need to vote. It is essential that young voters, such as high school students who are eighteen, educate themselves about the political candidates to make an informed decision when voting."}, {"text": "“There’s a huge wave of young Conservative and [young] Libertarian men and women who are planning to vote,” said Eric Holder, a graduate of WWPRSD and current freshman at The College of New Jersey. It is important for younger voters to know that their votes count in this election, because the results will affect their lives."}, {"text": "A Democratic candidate with the low approval ratings that Menendez has is almost unheard of in this state. A Stockton University poll shows that 54 percent of New Jersey residents view Menendez unfavorably. New Jersey senator Cory Booker however, holds only a 31 percent disapproval rating. Menendez’s high percentage is because of his scandal this past year."}, {"text": "The people of New Jersey are calling out for change."}, {"text": "The reason Menendez is ineffective in New Jersey is because of legislation he has passed that heavily taxes residents. In fact, over the past few years, because of high property taxes, New Jersey residents have been leaving the state at the highest rate in history, according to nj.com."}, {"text": "Muku Tuppil, a junior , explains, “I think that the people of New Jersey aren’t satisfied with their current representation.”"}, {"text": "Menendez voted over 90 times to increase taxes. New Jersey is home to the 3rd highest taxes in the country, making it unaffordable to live in. Menendez does not intend to change that anytime soon."}, {"text": "On the other hand, Bob Hugin is on record saying that he wants to lower the state’s taxes and create more jobs. Lower taxes will make it easier for lower and middle class residents to stay in New Jersey."}, {"text": "Thinking about this on a broader scale, if Robert Menendez loses, it could very well impact the way New Jersey residents vote in the future. They could be on their way to voting their conscience instead of their political party."}, {"text": "Is New Jersey on its way to becoming a Republican state? “It’ll be a long way but it’s possible,” Conner said."}, {"text": "A party turnover will not happen in New Jersey overnight. But if voters vote their conscience this midterm election, they will affirm that immoral behavior and poor character in their leaders have no place in this state."}, {"text": "New Jersey is in fact, waking up."}, {"text": ""}, {"text": "The sun has not yet risen in New Jersey. Democratic candidate Robert Menendez."}, {"text": "He won the senate seat, receiving 53.7 percent of New Jersey’s votes, while Republican candidate Bob Hugin missed the mark with 43.1 percent of the votes. Even though there was promising hope in the polls leading up to the election, nothing has changed in New Jersey. This lack of change is clearly evident  when these 2018 results are compared to the last New Jersey senate race in 2014."}, {"text": "Democratic candidate Cory Booker received 55.8 percent of the votes while Republican candidate Jeff Bell had 42.4 percent. Both elections were pretty close in numbers. Comparing the two Democratic candidates, Booker received only around 2 percent more votes than Menendez did, and Menendez is an indicted criminal. This was surprising and concerning for New Jersey."}, {"text": "Because of the scandal with Menendez, there was a big question looming over New Jersey leading up to election day: Would New Jersey vote Republican?"}, {"text": "Voting in Menendez for a third term means that New Jersey disregarded the corruption, bribery and fraud charges against him . They voted him in with almost as much certainty as Booker in 2014, who had no legal issues at all. Clearly, New Jersey votes political party over everything else."}, {"text": "Is there still hope for New Jersey? Maybe. This election brought many new residents out to vote as New Jersey voter turnout was 48 percent higher than 2014. Even though Menendez was re-elected, his scandal got more New Jersey residents to pay attention to politics. That is a small step in the right direction."}, {"text": "New Jersey may not have had that big party turnover, but the future remains open."}, {"text": "IMAGE COURTESY: WWW.COMMONS.WIKIMEDIA.ORG"}], "file_structural_elements": {"title": "Is New Jersey finally waking up?", "date": "November 14, 2018", "writer": {"": {"name": "Alyse Dunn", "year": ""}}, "description": "     New Jersey could be on its way to becoming a Republican state.      \n     On Nov. 6, New Jersey voters will decide who fills one of two seats in the United States Senate. Less than a week away, the race is undeniably close. According to a recent Stockton University poll, Republican candidate Bo", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/Robert_Menendez_35570844945-900x600.jpg"}}