{"tree_elements": [{"text": "When ice caps are melting away, cities are drowning, and natural disasters are intensifying, many do not understand why space exploration should be pursued. However, space research is vital for predicting the future of Earth in the long term and promotes the invention of useful technology."}, {"text": "The National Aeronautics and Space Administration or NASA has a vision “[t]o discover and expand knowledge for the benefit of humanity,” according to its website. NASA greatly helped raise awareness in the beginning, when the consequences of global warming were not well-known. They may be most known for sending astronauts on missions to the moon during the Apollo program (1963-1972), helping achieve technological and political goals. But after having its budget cut in the ’70s, NASA decided to dedicate more of its time and resources to observing our own planet, and they realized how fast our climate could change."}, {"text": "This year, NASA has a $6.3 billion budget, which is 27% more compared to last year."}, {"text": "The United Nation’s Intergovernmental Panel on Climate Change (IPCC) estimates that around $30 trillion are needed to balance the level of greenhouse gas emissions."}, {"text": "“I think it’s important to make sure that we’re sustainable in the ways that we continue to use resources on Earth and we look at the way that we maintain our earth here before we move to space,” said sophomore Avi Agarwal. “I think it’s important to make sure that we all have a safe home because if we all focus on things that are too much outside of our planet, then we could end up perishing.”"}, {"text": "Because climate change is an urgent issue that needs to be addressed, some argue that the government should spend more money on efforts that would reduce greenhouse gas emissions, pollution, and other factors that cause climate change, instead of using it on pursuits such as space expeditions."}, {"text": "Contrary to this belief, issues here on Earth and discoveries in space are intertwined. Space exploration may seem like they can only help by finding a potentially habitable planet for the long term, but it can also have an immediate impact. For example, today there are technologies made because of space travel, such as phone cameras, water purification systems and even baby formula. When researching food supplies for travel to Mars, NASA and Martin Marietta Corporation discovered an algae-based additive that provides nutritional value, especially for babies."}, {"text": "Further, astronomy allows us to observe other planets as models for what might happen to our own.  For example, “Venus is a planet that is a little bit closer to the sun, so you’d expect it to be warmer,” said Mr. Dorfman, a chemistry and descriptive astronomy teacher. “But it’s a lot warmer than you would expect, and the reason why it is is because its atmosphere has a much higher percentage of carbon dioxide, which is an important greenhouse gas.”"}, {"text": "Venus is a potential model for what could happen to Earth if its greenhouse gas emissions continue rising.  We should choose to focus on both Earth preservation and space exploration by redirecting how the government spends money to fund these programs."}, {"text": "In 2020, NASA will continue to explore space, with events such as sending a new solar probe, a spacecraft that will be traveling closer to the sun."}, {"text": "“We have a new solar probe that’s approaching the sun ever closer – the Parker Solar Probe,” said Mr. Dorfman. NASA launched the probe on Aug. 18 last year. On Jan. 23, it encountered the sun. Its purpose is to explore the solar corona, a layer of plasma that surrounds the sun."}, {"text": "Additionally, there will be an expedition to Mars conducted by NASA."}, {"text": "Dylan Gaillard, a sophomore interested in becoming an astronomer, said, “They’re going to send a rover to the surface of Mars to look for certain chemicals and ways to extract oxygen from the atmosphere.  This would potentially allow us to figure out a way to live on Mars and create a habitable environment.”"}, {"text": "The rover is expected to leave between July 17 to Aug. 5, 2020, from Cape Canaveral Air Force Station in Florida. It will search for signs of life, and ancient microscopic organisms. The rover will land on Jezero, a crater believed to have once been a lake, and Jezero could contain organic molecules from a time when life existed on Mars."}, {"text": "By exploring these extraterrestrial habitats, we can also realize how precious our planet is. Instead of turning a blind eye towards space exploration, we should take interest in their findings, and look forward to new discoveries in 2020 and beyond."}, {"text": "IMAGE BY KIKO YOSHIHARA"}], "file_structural_elements": {"title": "Is space exploration worth it?", "date": "February 13, 2020", "writer": {"PTuqcNBCYMmmUhhB3nn3": {"name": "Kiko Yoshihira", "year": "2021"}}, "description": "     When ice caps are melting away, cities are drowning, and natural disasters are intensifying, many do not understand why space exploration should be pursued. However, space research is vital for predicting the future of Earth in the long term and promotes the invention of useful technology. \n   ", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/Dionysus-900x535.jpg"}}