{"tree_elements": [{"text": "Mark your calendars for Feb. 13, pick up a cake from the supermarket and get ready to celebrate Galentine’s Day with all of your gal pals. Whether you are in a happy relationship, gladly single, or “it’s complicated,” Galentine’s Day is a perfect time to convene and strengthen your relationships with your friends."}, {"text": "Unlike Valentine’s Day, which has its origins in the fifth century and was deemed a romantic holiday in the fourteenth century, Galentine’s Day began during an episode of  “Parks and Recreation” in 2010."}, {"text": "“Parks and Recreation” is a mockumentary sitcom television series about the inner workings of the Recreation Department of Pawnee, Indiana, a fictional town. The main character Leslie Knope, played by Amy Poehler, came up with the idea of Galentine’s Day in episode 16 of season two."}, {"text": "“Every February 13, my lady friends and I leave our husbands and our boyfriends at home and we just come and kick it, breakfast-style. Ladies celebrating ladies,” said Knope."}, {"text": "Beyond the sitcom universe, many South students also celebrate Galentine’s Day."}, {"text": "Senior Julianna Buchbinder said, “I’ve been celebrating Galentine’s Day with my friend group ever since freshman year and I feel like it’s always brought us closer together.”"}, {"text": "Galentine’s Day is an opportunity to cherish our high school friendships. This is important because the memories we make with our friends can last a lifetime."}, {"text": "According to Nicholas A. Christakis, a physician, sociologist and director of the Human Nature Lab at Yale University, a typical strong friendship lasts ten years. On the other hand, according to the National Institute of Health, the average high school romantic relationship lasts one to two years. So in the long run, our friends will be by our side longer than a significant other would."}, {"text": "While Valentine’s Day is a romantic holiday to celebrate with your significant other, the relationships you have with your friends are far more important. Ultimately, Galentine’s Day will be a more memorable experience because it is more likely that those friendships will last longer than your relationship with your partner."}, {"text": "“Especially since we are in high school,” said Buchbinder. “I don’t think relationships with a significant other last as long as friendships do since we are still maturing and learning to be independent.”"}, {"text": "Not only do friendships last longer than relationships, but they are more easy-going: for example, you don’t have to impress your friends. Whether you are going on a date or simply talking to them on the phone, you’re constantly worried about not living up to your significant other’s expectations."}, {"text": "“In a relationship, there is a lot of pressure and fear of the relationship being one sided so people are afraid to be their true selves in front of their significant other,” said senior Sedona Dunn. “With friends, I think people are more like themselves from the start because they aren’t trying to seek attention.”"}, {"text": "Unlike many high school relationships, when you’re hanging out with friends, you don’t have to worry about what they think of you. If you are worried, it’s time to get some new friends."}, {"text": "Romantic relationships come with other determinants as well."}, {"text": "“Relationships in high school give the person opportunities to learn important traits about themselves like strengthening one’s patience and listening skills, being considerate of others feelings and they learn to be more empathetic,” said guidance counselor Antonella Facchini. “But, relationships can also monopolize your time and you are not balancing it with your other activities like academic, extracurricular, family, and friend time.”"}, {"text": "Galentine’s Day is time to escape the realm of high school relationships, and kick it back with your laid-back friends."}, {"text": "On the contrary, while Valentine’s Day is dedicated to cherishing healthy relationships, it is very important to prioritize your time by celebrating Galentine’s day with your close friends before dedicating Valentine’s Day to cherishing a healthy love life."}, {"text": "Ultimately, whether you’re in a relationship or not, it’s important to stay close with your friends and to value your memories together; Galentine’s Day is a great way to do just that. This Feb. 13 is the perfect day to catch up with your friends, have a romcom movie marathon, or if you are socially distant, host a Zoom call and screen share a movie, you’ll be making meaningful memories that’ll last a lifetime."}, {"text": "IMAGE BY ELISE KO-DAVIS"}, {"text": ""}], "file_structural_elements": {"title": "It’s not cliché to celebrate Galentine’s Day", "date": "February 12, 2021", "writer": {"t1wNGC5vCu2m5zKSZgLI": {"name": "Sophia Englezos", "year": "2020"}}, "description": "     Mark your calendars for Feb. 13, pick up a cake from the supermarket and get ready to celebrate Galentine’s Day with all of your gal pals. Whether you are in a happy relationship, gladly single, or “it’s complicated,” Galentine’s Day is a perfect time to convene and strengthen your relationship", "image": "https://thepirateseye.org/wp-content/uploads/2021/02/Galentines-day-900x570.png"}}