{"tree_elements": [{"text": "A person is standing in line at a store paying for their goods. As they walk out of the store, goods in hand, the cheery cashier says a hearty “Merry Christmas.” Should the person be offended?"}, {"text": "As a society we have become hypersensitive to trivial matters such as saying “Happy Holidays” instead of “Merry Christmas” during the holiday season so as not to offend anyone’s cultural traditions or beliefs."}, {"text": "Hypersensitivity is a result of our culture’s trend towards a more politically correct America, one where phrases like “Merry Christmas” are no longer considered appropriate, but offensive."}, {"text": "There is, however, a fine line between political correctness and hypersensitivity."}, {"text": "“Personally I am not very offended when somebody that I don’t know very well says Merry Christmas to me,” said sophomore Levi Elias, a Jewish student. “They may not be aware of my religion so they’re just trying to be a friendly person.”"}, {"text": "In a perfect world, the best solution would be to simply assume that everyone is not Christian. However, America is simply too intertwined with Christian culture. According to the Pew Research Center, a nonpartisan polling company, about 71 percent of the population identify as Christian."}, {"text": "Television shows are only just now starting to feature more non-Christian holidays, like ABC’s “The Goldbergs,” which follows the life of a Jewish family in the 1980s."}, {"text": "In the past, Christmas was the only religious holiday recognized in the media. For example, the 1965 “Charlie Brown Christmas” special, which continues to be broadcast during the holiday season, has no reference to any other religious holidays."}, {"text": "No one is trying to be offensive when they wish someone a “Merry Christmas.” The opposite is true, in fact. The phrase is simply an endearing wish for joy."}], "file_structural_elements": {"title": "Merry Christmas vs Happy Holidays", "date": "January 23, 2019", "writer": {"hAatcVs9qdRuA5BzCBPf": {"name": "Damien Moshman", "year": "2018"}}, "description": "     A person is standing in line at a store paying for their goods. As they walk out of the store, goods in hand, the cheery cashier says a hearty “Merry Christmas.” Should the person be offended? \n     As a society we have become hypersensitive to trivial matters such as saying “Happy Holidays” in", "image": null}}