{"tree_elements": [{"text": "There are no perfect role models."}, {"text": "Everyone we look up to and follow has flaws. We are human, and humans make mistakes. Yet, some mistakes are hard to rationalize, especially in the people we look up to, such as musicians who make popular music that we enjoy."}, {"text": "Daniel Hernandez, professionally known as 6ix9ine, and Jahseh Onfroy, known as XXXTentacion, have managed to top musical charts despite being involved in crimes for which they have served jail time."}, {"text": "XXXTentacion, who also goes by X, rose to popularity with his song “Look At Me” in early 2017. As his song climbed the charts, his violent past became known to the public. X was in jail for aggravated battery, while still facing trial for assaulting his pregnant ex-girlfriend. Despite his conviction, X’s album “?” rose to number two on the US Top R&B/Hip-Hop Albums on Billboard. The rapper passed away June 18, 2018 from a shooting. After his death, his album went from number 52 to number one on the Billboard charts."}, {"text": "Like X, 6ix9ine was also accused of sexual assault. Currently, 6ix9ine is expecting a resentencing for a 2015 crime and is facing a minimum of 32 years for the assault."}, {"text": "Despite trials proving their crimes, the artists continue to prosper in their careers. The question is: should consumers reject controversial musicians?"}, {"text": "Many musicians have troubled pasts. For example, Paul McCartney, from the Beatles, served jail time for possession of marijuana and Demi Lovato, a famous singer and songwriter, admitted to having done other illegal substances."}, {"text": "Nikitha Gadangi, a senior, distinguishes the difference between minor offenses and more serious ones. She said using illegal substances such as marijuana is a choice a person makes, a choice that has consequences the person is aware of. On the other hand, sexual assault “leaves someone a victim, affected by a perpetrators actions.”"}, {"text": "Petty crimes are much different from sexual assault. New Jersey laws state that aggravated sexual assault is a first degree crime with up to 20 years in prison; on the other hand, possession of marijuana usually has a six month sentence."}, {"text": "Another question is: what does an artists’ flaws, such as a criminal past, have to do with listening to their music? Listening to an artists’ music doesn’t mean someone is a fan of the musician. However listening to their music, supporting their sales and promoting those artists is giving abusers a platform to stand on."}, {"text": "Raheen Syed, a senior, believes, “Listening to an artist doesn’t mean you always support what they do.” The actions and behaviors of an artist do not reflect the art they create. But Syed says,“It’s important to stay away from financially and socially giving controversial artists a platform.”"}, {"text": "When a song is popular, it’s hard to think of a victim impacted by the musician who produced it. Supporting the music of controversial artists provides a platform for them to thrive, sending a message that their actions are excusable, and that their music is worth more than the suffering and trauma they have caused others."}, {"text": "Though we cannot always control our taste in music, we can, and should, hold artists accountable for their actions."}, {"text": "PHOTO COURTESY: MAANYA NARAIN"}], "file_structural_elements": {"title": "Morals of musicians", "date": "January 23, 2019", "writer": {"818DmKSTZB84ddo0ViFd": {"name": "Maanya Narain", "year": "2018"}}, "description": "     There are no perfect role models.\n     Everyone we look up to and follow has flaws. We are human, and humans make mistakes. Yet, some mistakes are hard to rationalize, especially in the people we look up to, such as musicians who make popular music that we enjoy.\n     Daniel Hernandez, professi", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/MUSICIANS.png"}}