{"tree_elements": [{"text": "With a new year comes new resolutions. Some make a resolution to start going to the gym more; some that they will improve their diets; others to get eight hours of sleep. The first days of the New Year is a time to work towards the “better you.”"}, {"text": "Although a nice thought, I’m about to provide you with a shocking reality- you might want to sit down for this."}, {"text": "New Year’s resolutions don’t work–it’s as simple as that. Only three weeks after the New Year and, gyms are once again empty, chocolate sales are up, and dark bags return under the eyes of the sleep deprived. It’s time to re-evaluate the “new year, new me” mindset and be realistic- making a New Year’s resolution does not ensure reaching the end goal."}, {"text": "According to David Derezotes, a professor of social work at the University of Utah, while 45 percent of people make a New Year’s resolution, only eight percent end up reaching their goals. This is due to social conventions and psychological hopefulness."}, {"text": "Socially motivated resolutions when the New Year comes result from the dreaded question: “What is your New Year’s resolution?” Naturally, there must be a response."}, {"text": "“Every year, I find myself making all of these dreamy resolutions for the new year that I secretly know I’m never going to follow through with,”said junior Drishti Devnani. I just do it, because that’s what you’re supposed to do at that time of year."}, {"text": "So, exactly what is a resolution? A New Year’s resolution is another word for a goal. People make small goals every day; however, at this particular time of year people mask their new, unreachable goals as “New Year’s Resolutions.” These goals are often fueled by social pressure, not because people actually want to improve themselves."}, {"text": "“My New Year’s resolutions are always big typical goals most of the community also has, such as wanting to eat healthier,” said junior Kelly McElroy. “But the small goals I tend to make every day that are personal to me are the ones that end up becoming realities.”"}, {"text": "Aside from New Year’s resolutions being socially imposed, there is also a biological reason for why they rarely ever work. The hopeful resolutions made and disappointing failures can be attributed to two main lines of reasoning studied in behavioral science – the science of why we do the things we do."}, {"text": "A study published in the European Journal of Social Psychology conducted by Phillippa Lally, a health psychology researcher at University College London, explained just how long it really takes to form a new habit. Her study included 96 participants who all chose a new habit to form and recorded them over a 12-week period. In the end, she found that it takes an average of 66 days to change a habit."}, {"text": "Ensuring that something is done for 66 days takes commitment, something that cannot suddenly be practiced when the new year comes around."}, {"text": "In 2019, take it upon yourself to get rid of the “new year, new me” mentality. Take a moment to reflect on what you truly want to improve about yourself, make small goals to accomplish this, and most importantly begin the goal when it is most convenient for you."}, {"text": "Although the new year typically brings the same you, anytime is a good time for improvement."}, {"text": "PHOTO COURTESY: GRACE CHOE"}], "file_structural_elements": {"title": "New Year’s resolutions don’t work", "date": "January 23, 2019", "writer": {"vcRNXdDaPStd2IWpBNRh": {"name": "Alexa Bornstein", "year": "2018"}}, "description": "   With a new year comes new resolutions. Some make a resolution to start going to the gym more; some that they will improve their diets; others to get eight hours of sleep. The first days of the New Year is a time to work towards the “better you.” \n     Although a nice thought, I’m about to provide", "image": "https://thepirateseye.org/wp-content/uploads/2019/01/NEWYEAR.png"}}