{"tree_elements": [{"text": "Prison reform laws are probably something you don’t think about. But consider this: In late Dec 2019, Gov. Phil Murphy signed two pieces of legislation that will allow people involved in the criminal justice system to participate more in society."}, {"text": "The legislation aims to relieve some convicted felons of their charges under certain circumstances and also restore voting rights to New Jersey residents on probation or parole. While some New Jersey lawmakers felt that this legislation hurts the state, it actually makes a positive change and improves the lives of thousands of people."}, {"text": "New Jersey has been a leading example for other states in prison reform since 1999 when its prison population began to decrease because of a change in how drug-related crimes were treated. According to The Sentencing Project, a Washington-based criminal justice reform group, New Jersey leads the nation in prison reduction. It has continually decreased from 1999 when there were 31,000 people behind bars, to 2017 when there were 13,972 people."}, {"text": "Gov. Phil Murphy strives to keep this going, but also improve the prisoner’s lives overall. This is why he passed two new bills as part of his Second Chance Agenda."}, {"text": "The first bill Murphy passed restores the right to vote for thousands of New Jerseyians on probation and parole. This law will be in effect by March 2020, and will give 83,000 more people the right to vote."}, {"text": "“This is an important step for society,” senior Matt Odideron said. Granting former convicts with the right to vote helps them feel as if they can contribute to society again."}, {"text": "Giving these formerly incarcerated people a voice is important and beneficial because there is a lot of debate about criminal justice reform and mistreatment in prisons and the best people to voice their views on these topics are citizens who have experienced prison themselves."}, {"text": "“I think listening to the experiences these people had in prison would influence voters in a positive way,” said senior Maddy Vivona."}, {"text": "Some people feel that giving former prisoners the right to vote is going too far. They argue that if someone is not willing to follow the law, they should not have the power to help form laws for everyone else. Some Republican lawmakers suggest that former prisoners should earn their right to vote after getting released from prison, in order to prove that they have changed."}, {"text": "The second law passed by Murphy will prove to be just as effective as the renewal of voting rights. This law creates a petition process for a clean slate for residents who have not committed an offense in 10 years and have not committed a serious crime. It essentially clears someone’s criminal record with automation which is a huge step because now, individuals won’t even have to take the steps to petition a court."}, {"text": "Clearing records through automation is a fast, online process that saves people time and money."}, {"text": "This bill is a big step for integrating former prisoners back into our society. Having a criminal record and looking for a good paying job is very difficult. The Brennan Center for Justice found that having a criminal record will decrease someone’s chances of getting a job by 50 percent. This new law makes it easier for individuals to find work, and provide for their families."}, {"text": "“This is good for our former prisoners,” senior Suhruth Chamarthi said. “It will mean that deserving people who might have been wronged by the justice system will finally find their place again in society.”"}, {"text": "Some may argue that this law is not on track to improve much because in order for someone to successfully get their record clear, they must be eligible first. Eligibility can be difficult to get because there are certain criteria the inmate must meet."}, {"text": "Public defender Nila Bala from the R Street Institute thinks that even though convicted individuals have the right to find out if they’re eligible for record clearance, they might not even know that they have the opportunity to do so. “Or maybe they know it but they haven’t been able to do the paperwork or get the money to pay for it,” said Bala in an interview conducted by the Chan Zuckerberg Initiative."}, {"text": "Gov. Phil Murphy has taken a step to continue New Jersey’s fight to reform prisons, and it will definitely pay off. “We are a state that believes in second chances,” said Murphy when interviewed before signing the two bills into law."}], "file_structural_elements": {"title": "New Jersey supports second chances with prison reform bills", "date": "February 13, 2020", "writer": {"": {"name": "Alyse Dunn", "year": ""}}, "description": "     Prison reform laws are probably something you don’t think about. But consider this: In late Dec 2019, Gov. Phil Murphy signed two pieces of legislation that will allow people involved in the criminal justice system to participate more in society.\n     The legislation aims to relieve some convic", "image": null}}