{"tree_elements": [{"text": "Letter grades, school for six hours a day and tests: this is the American school system."}, {"text": "Because of the ongoing pandemic, this school year students are learning in either virtual or hybrid classes. Even with efforts to keep a sense of normalcy, I believe the regular way of grading is proving ineffective in this pandemic learning model."}, {"text": "Students are taught that getting good grades means getting into a good college and getting a good job. As a result of this false narrative, South students tend to be overly attached to the letter posted on Genesis."}, {"text": "“Grades do play an important role,” sophomore Saanch Shahdadpuri said, “but it is mostly a direct reflection of  my efforts, prioritization and time management. When it comes to mental health, grades do nothing but cause stress. The constant pressure of grades is like a Uno reverse card.”"}, {"text": "In other words, the more time we spend stressing about getting good grades, the more time we’ll have to spend later with self-care. The current grading system tends to create a fear of failure rather than serve as motivation to do better. Students put too much value on their grades rather than embracing the learning process. This often leads to students memorizing information for a test and forgetting it soon after."}, {"text": "Experts agree that the grading system is broken. According to an article by Kara Duriez on the Penn State University website, the pressure to achieve good grades leads to grade obsession, which can cause emotional and physical stress. It drives students away from the motivation of learning and leads them towards the fear of failure by constantly focusing on the outcome of a test."}, {"text": "Spanish teacher Senora Brandy Moncada agreed that grades should reflect a student’s learning progress and not just their performance during assessments. “I’d rather have progress indicators. I would love to be able to measure a students’ growth from the beginning of the year  instead of it being based on numbers.”"}, {"text": "The constant pressure of grades has only been heightened during the pandemic. As a result of quarantine, some students find themselves in challenging situations: some are now responsible for taking care of their siblings or have experienced a family member getting sick. Some students are just stressed from isolation. Even under all these added pressures, students are still expected to be active in school and are scored based on their performance. Since there is a link between a student’s well-being and how they perform at school, many students have experienced a decline in their grades."}, {"text": "According to a survey done by OnceClass, an educational company that provides virtual access to study resources, about 85 percent of respondents said the pandemic had a negative effect on their performance."}, {"text": "According to Betheny Gross, an associate director of the Center on Reinventing Public Education and a contributor to the 74 Million Press, in St. Paul Minnesota, about 40 percent of high school students failed their first semester this year. For many students, the grades they’re receiving during the pandemic aren’t reflective of their effort and don’t take into consideration the challenges the pandemic has had on them. This shows that, in many cases, grades do not authentically reflect a student’s mastery in a subject during a time of unprecedented stress, loss, fear and sickness."}, {"text": "According to a survey by the New York Times on ways to improve the school system, some students are in favor of eliminating standardized tests because it only leads to stress and memorizing facts they will soon forget. Yet, testing for the SAT and AP exams has continued even during these difficult times."}, {"text": "South has taken action to combat this issue by focusing on mental health and improving the learning environment for all students. The Campaign Dialogue club, South’s climate and culture team, is a place where students can advocate for a healthier learning environment at South."}, {"text": "Teachers have also been considerate of students’ mental health and grades. Language arts teacher Ms. Kathleen Reilly believes it’s important for students to self-reflect on their learning and communicate so teachers know how students are doing. She said, “For me, this year has  been really important to incorporate more than ever lots of reflections, lots of check-ins for students and giving value to that numerically because that’s the system that students already value.”"}, {"text": "The school system needs improvement and the pandemic has revealed exactly why we need to change the grading system. By placing less emphasis on grades and more on the learning process students will benefit not only academically but also mentally."}, {"text": "Another way we can deemphasize the importance of grades and tests is by having more than one way for students to show their mastery in a subject and not just by a few tests. Schools should also focus on real-world skills. According to Ms. Reilly these include applications, retrospection and self-reflection. These are necessary skills so students feel more engaged in the learning process."}, {"text": "Above all, schools should depict success in different ways since the narrative that grades are crucial for the future teaches students that if you don’t have good grades, you won’t be successful."}, {"text": "“There are so many different ways that people get to where they are meant to be, notwithstanding their grades,” said Ms. Reilly. “The first step is to acknowledge the reality that the narrative is more false than true. In terms of education, the question becomes ‘What are we showing students about what success means? Are we being clear about the bumps in the road and how to overcome them?’ Or how a bump in the road is actually may be a door of opportunity.”"}], "file_structural_elements": {"title": "Pandemic reveals flaws in grading system", "date": "May 15, 2021", "writer": {"l7VmOCUaYoPYE1PNDIbH": {"name": "Shivani Sadasivam", "year": "2020"}}, "description": "     Letter grades, school for six hours a day and tests: this is the American school system. \n     Because of the ongoing pandemic, this school year students are learning in either virtual or hybrid classes. Even with efforts to keep a sense of normalcy, I believe the regular way of grading is prov", "image": null}}