{"tree_elements": [{"text": "How do you approach someone you’ve always wanted to know and be friends with but haven’t seen in a long time?"}, {"text": "From,"}, {"text": "The Voice"}, {"text": ""}, {"text": "Dear The Voice,"}, {"text": "It is a long process to get to know someone and this can be even harder in a virtual environment. But don’t fret, here are some tried and tested methods that work."}, {"text": "Social Media"}, {"text": "Social media to the rescue! Most likely the person you want to befriend is using it. The first step is to connect with them by following them. If they are using social media and they know you, they are going to follow you back. After a couple of days, start chatting."}, {"text": "A good way to start a conversation is by finding common ground. For example, you can comment about a picture they posted recently in a restaurant. Food is one of the easiest things to bond over. Once you have something you share, it will become easier to connect with that person and have more conversations. They won’t always be receptive, but don’t be scared to try."}, {"text": "Homework"}, {"text": "We all struggle with homework and if your potential friend happens to be in the same class as you, ask them for help about something you’re struggling with. You might even be able to help them out in turn! This can be a great way to make friends and you can have regular conversations if you both want to check your homework answers. Just text them one day or send them a message on Google Hangouts about a question you have. Google Hangouts is the best way to contact someone during virtual school. If texting someone directly is too hard, take advantage of breakout rooms in classes. Don’t just turn off your audio and video. Start talking there first so it won’t feel awkward when you text them later."}, {"text": "Hallways"}, {"text": "If you attend in-person classes, hallways are one of the easiest places to make friends. As the bell rings and everyone starts to leave, talk to your friend while staying socially distant. Ask about homework, a test, or the extra credit assignment. On the way to your next class, you can also talk about what class they’re going to. The next day, maybe you just happen to be going past their desk when class ends. Keep saying “hi.”  Soon, these hi’s will lead to casual relationships and with time, this might develop into a deeper friendship. It might be scary, but it’s always worth it. The friendships I have made with my fellow pirates wouldn’t be possible without these everyday greetings. With time and some effort, you’ll find yourself leaving the class together. However, don’t force it, somethings are meant to happen organically."}, {"text": "It only takes a couple of friendly gestures to properly get to know a person. With these tips, you will be able to successfully make friends with anyone you want. And remember whatever you do, don’t be harsh on yourself.  Never compromise self-respect for friendship. Remember, friendships worth having are those worth waiting for."}, {"text": "Sincerely yours,"}, {"text": "Penny The Pirate"}, {"text": "Image by Kiko Yoshihira."}], "file_structural_elements": {"title": "Penny the Pirate", "date": "March 12, 2021", "writer": null, "description": "How do you approach someone you’ve always wanted to know and be friends with but haven’t seen in a long time?\nFrom,\nThe Voice \n \nDear The Voice,\n     It is a long process to get to know someone and this can be even harder in a virtual environment. But don’t fret, here are some tried and tested metho", "image": "https://thepirateseye.org/wp-content/uploads/2021/03/6848EB1B-3ED2-40BD-99B2-CB6B58BFE5F6.jpeg"}}