{"tree_elements": [{"text": "From the moment we are born, we are taught the value of independence: how to take care of ourselves, how to make our own decisions, and how to be secure in our identity as we continue growing. Our parents are an integral part of this journey, playing a large part in encouraging and helping us with their experience."}, {"text": "However, it is inevitable that every child will experience conflicts with their parents as they attempt to gain the freedom to live their own lives."}, {"text": "Most teenagers today have their own phones, which has given way to the following question: should parents check and monitor their kids’ phones?"}, {"text": "*link to='https://www.pewresearch.org/fact-tank/2019/03/22/how-parents-feel-about-and-manage-their-teens-online-behavior-and-screen-time/'*2018 survey from the Pew Research Center*/link*"}, {"text": "“As we all know, the world is not the same place as when our parents were kids,” said junior Vaani Bhatnagar. “I think because of this fact, parents do not know how to feel responsible for their child. They struggle with keeping a balance between caring too much and not caring enough about their child."}, {"text": "Bhatnagar believes that this has led many parents to become overprotective of their kids and feel the need to constantly monitor what they are doing, in order to make sure they stay safe."}, {"text": "Junior Madhura Edavayyanamath agrees, stating that she comes from a culture where parents are often blamed for their children’s actions. As a result, she says that she understands why a lot of parents have a fear of their children being led down the wrong path, such as getting involved in illegal or harmful activities."}, {"text": "However, she also believes that parents should take into account the behavior of their children before deciding whether or not to check their phones."}, {"text": "“A parent would need to monitor their child’s phone if they see signs of destruction from a child or a sudden drop in their health,” Edavayyanamath said. “If not, I feel it’s as important for the parents to keep trust in their child’s doings as much as the child does on the parent’s way of parenting.”"}, {"text": "In fact, this two-sided trust is critical to strengthening the bond between a parent and their child. At a certain point in their lives, parents have to trust their child enough to let them make their own decisions and mature on their own. Only when parents give their children the space to explore the world at their own pace will children exhibit trustworthy behavior."}, {"text": "Freshman Arthur You believes that this kind of privacy is something that everyone needs, including parents, and that it is important for parents to respect their kids’ boundaries, especially during a critical time like high school when students are still growing up and figuring things out about themselves."}, {"text": "“You discover weird things in high school that you are sometimes uncomfortable discussing with a parent and are more comfortable discussing with friends,” You said."}, {"text": "Giving children the freedom to grow on their own is particularly important during this time of quarantine when everyone has been forced to become more self-directed. Due to the pandemic, children have gained more free time that they can use to develop their interests and explore topics they are curious about."}, {"text": "Rather than monitoring their phones, parents should encourage their children to use this period of time to expand their horizons on their own."}, {"text": "Ultimately, in order to respect their children’s privacy and create a long-lasting bond of trust, parents should not check or monitor their children’s phone and should instead let them have freedom in their actions."}, {"text": "You said, “Children have their own lives to run and they deserve their own privacy.”"}], "file_structural_elements": {"title": "Pro/Con: Parents should not check their kids’ phones", "date": "June 17, 2020", "writer": {"7QmjWOmuijWLnsmxiDbP": {"name": "Tinney Mak", "year": "2019"}}, "description": "From the moment we are born, we are taught the value of independence: how to take care of ourselves, how to make our own decisions, and how to be secure in our identity as we continue growing. Our parents are an integral part of this journey, playing a large part in encouraging and helping us with t", "image": null}}