{"tree_elements": [{"text": "Technology has created many ways of communicating, which are essential in this time of social distancing. But with increased dependence on technology comes increased parental monitoring. Although the idea of parents monitoring their child’s phone may seem invasive and unnecessary to some, in the end, it is beneficial to both parent and child."}, {"text": "For example, some parents log onto their child’s Google Classroom to check that their child is staying on top of homework. Junior Alex Qin said, “[Monitoring] helps parents get the inside scoop on what their child is facing” in the classroom."}, {"text": "Some teenagers might feel like their parents are disrespecting boundaries and mutual trust. However, parents see it as staying involved in their child’s education and they mean well. Junior Fenil Gala said, “Parents wouldn’t do anything to harm their children.”"}, {"text": "Tracking apps are a way parents keep tabs on where their child is. This may come off as being overprotective, but it ensures that the child can be located easily. Whether children realize it or not, parents worry about them."}, {"text": "Some parents  rummage through the content of their child’s phone to see if there are any suspicious contacts. A few of the telltale signs parents look for are texts from strangers or unidentifiable website links."}, {"text": "*link to='https://www.cbsnews.com/news/teens-learn-lesson-in-online-vulnerability/'*Doane’s Teens Learn Lesson In Online Vulnerability*/link*"}, {"text": "Since most high school students have their own phone, they have to be smart about avoiding malware and faulty links which hackers and posers send out. But even though it is the student’s responsibility, many parents see themselves as a line of protection and that’s why they monitor their child’s cell phone use."}, {"text": "These precautions are necessary because it reassures parents of their child’s safety. After all, “[P]arents want the best for their kids,” Gala said."}], "file_structural_elements": {"title": "Pro/Con: Parents should check their kids’ phones", "date": "June 17, 2020", "writer": {"L2tabycjXwSAHtJCW6yQ": {"name": "Grace Choe", "year": "2019"}}, "description": "Technology has created many ways of communicating, which are essential in this time of social distancing. But with increased dependence on technology comes increased parental monitoring. Although the idea of parents monitoring their child’s phone may seem invasive and unnecessary to some, in the end", "image": null}}