{"tree_elements": [{"text": "The U.S. has the most expensive average college tuition in the world, so it’s no surprise that there is a growing number of students who are in favor of free college and debt cancellation."}, {"text": "With tuition inflation increasing at around eight percent each year, changing the current tuition system is unquestionably the right step. As more Americans acknowledge the need for this change, many are looking toward the government to answer their call."}, {"text": "As the 2020 presidential elections approach, Democratic presidential candidates have emerged as the central leaders in the conversation about canceling student debt and making college free. Sen. Bernie Sanders, an advocate of free college tuition, has proposed the College for All Act which will provide free tuition at any public college or university in the United States."}, {"text": "“Good jobs require a good education. That is why we are going to make public colleges and universities tuition-free, and cancel all student debt,” promised Presidential Candidate Bernie Sanders on his campaign website ."}, {"text": "He proposes to eradicate 1.6 trillion dollars of student debt, similar to his fellow Democratic Presidential Candidate Elizabeth Warren who has called to cancel $50,000 of each individual’s student debt."}, {"text": "Other Democrats such as Joe Biden and Sen. Amy Klobuchar also have similar plans, which include tuition-free community college and increasing grants and programs to repay student loan debt. Democratic Presidential Candidate Peter Buttigieg plans to make public college free for all students from families earning up to $100,000 annually, offer assistance for families earning up to $150,000 and programs that include student loan forgiveness."}, {"text": "Each Democratic Presidential candidate has supported some type of free four-year college. However idealistic free college may sound, the primary question on the minds of Americans is, “How will the government pay for it?”"}, {"text": "With most Americans earning a yearly income that is not comparable to college tuition, those who oppose a free college plan argue that their earnings will be further negatively impacted if the government had to pay for every public university student’s tuition."}, {"text": "World History teacher Sydney Miller said, “People right now think taxes would increase and are scared of that but if they realized where the money was actually coming from, they might be more open.”"}, {"text": "Each Democrat, though they have different propositions, plans to acquire the necessary money to pay tuition or cancel student debt through ways that will not further burden families who are already struggling financially. Sanders has proposed to derive the costs from speculations fees on stock trades, bonds, and derivatives."}, {"text": "“Wall street fees and bonds do impact our everyday life and our everyday business but I don’t think it would affect anyone’s quality of life as much as people might think,” said Miller."}, {"text": "Elizabeth Warren plans to implement a two percent annual income tax on Americans who earn more than 50 million dollars and a three percent annual income tax on those who earn more than 1 billion dollars, which would amass up to 275 billion dollars a year for canceling student debt."}, {"text": "College affordability has been a major topic of discussion prior to the presidential elections, and with almost every Democrat candidate advocating for it, it highlights just how impactful free tuition and student loan forgiveness can be. Debt has caused millennials to delay buying homes and becoming financially independent. Once they do start families, many start saving for their child’s college tuition immediately, while continuing to pay off their own debt."}, {"text": "“Because students are given federal aid and take out loans to pay for college, I think it allows universities to make their prices so high because they know they are going to get their money somehow,” said senior Jiya Wit. “But I don’t think that the current tuition is justifiable at all because so many kids are being put in debt for their whole entire lives.”"}, {"text": "The benefits of free college tuition is evident from the success of its implementation in Europe. In Germany, college tuition is completely free. The free college system in Germany does show the tradeoffs that come with having no tuition such as lower professor salaries, a lack of on-campus housing and dormitories and no grand athletic centers or lecture halls, many of which are reasons that make U.S. colleges so appealing."}, {"text": "However, because the U.S. provides so much more to students compared to Germany, the cost U.S. universities spend per student is almost twice as much, $30,003 compared to  $17,036 in Germany."}, {"text": "Keeping up with comfortable student life, numerous on-campus opportunities and luxurious buildings and centers, is often what makes college in the U.S. so expensive and hard to pay for, whether it is the student paying for it or the government. By compromising on some of these costly aspects, the U.S. could see long term benefits such as a more educated population and a workforce with more financial freedom, which Germany currently has."}, {"text": "“People are concerned that schools like Ivy Leagues would lose their distinction but I feel like knowing which schools are prestigious has been ingrained in our culture for long, that people would still view those schools in high regard,” said Miller. “I don’t think that the quality of education will go down if it is actually affordable.”"}, {"text": "Overall, the Democrats’ plans to make college free could set up generations for success. The U.S. could be on the path to finding a middle ground that maintains the quality of college education while being more affordable."}, {"text": ""}, {"text": "IMAGE BY GRACE CHOE"}], "file_structural_elements": {"title": "Pro: Should the U.S. government pay for college?", "date": "February 13, 2020", "writer": {"bXXGgMig9e1Wk6o1Nt2M": {"name": "Gauri Nema", "year": "2019"}}, "description": "    The U.S. has the most expensive average college tuition in the world, so it’s no surprise that there is a growing number of students who are in favor of free college and debt cancellation. \n     With tuition inflation increasing at around eight percent each year, changing the current tuition sys", "image": "https://thepirateseye.org/wp-content/uploads/2020/02/house-money.jpg"}}