{"tree_elements": [{"text": "Procrastination is seen as a terrible habit that’s completely self-accountable, and most believe that students with this habit are just downright lazy. But if you procrastinate, is it really your fault?"}, {"text": "The answer may seem obvious at first, but looking into it deeper can actually give insight into the origins of procrastination. There are lots of different reasons for procrastination, and it haunting you might not stem from laziness, but instead deeper psychological conflicts."}, {"text": "Victoria Hills, the editor in chief of Wellesley News, explains in her article that procrastination sometimes is the brain’s fault because of its primitive instincts. Hills explains that the limbic system encourages procrastination while the prefrontal cortex goes against it. In her words, “Our brains, in essence, are a battleground.”"}, {"text": "So procrastination is really just a natural human instinct, but there’s plenty of other reasons why procrastination probably isn’t all on you."}, {"text": "“I would say that if something happens to you that’s out of your control then that’s a valid reason to procrastinate,” said sophomore Nirbaan Maken."}, {"text": "When asked if procrastination is completely one’s fault, psychology teacher Mary Jenoriki said, “No, I do not think it’s your fault. I definitely think it’s a skill you can work on, and every single person, whether we’re talking about kids or adults, procrastinates. I did some research and, psychologically, the main reasons why people choose to procrastinate is because it’s something that they don’t enjoy doing.”"}, {"text": "Oxford Learning, an institution for helping students progress academically, stated on their website, “Much of the time procrastination has very little to do with laziness or a lack of caring. In many cases, there are deeper issues that lead students to develop a procrastination problem.”"}, {"text": "Oxford Learning lists low self-confidence, fear of failure, lack of understanding, trouble concentrating, perfectionism, low energy levels, etc. as issues that may cause procrastination. And these causes are all, in fact, not anyone’s fault. Pinpointing these underlying issues is important in order to understand how to effectively counter your procrastination, instead of just assuming that procrastination is because of your assumed laziness."}, {"text": "Most believe that the sole cause of procrastination is laziness, but according to Ms. Jenoriki, this is a misconception. “I would boil laziness down to what’s called a lack of motivation. So part of working on your procrastination habits has to do with figuring out a way to naturally motivate yourself.”"}, {"text": "Maken said, “Let’s say you’re not motivated one day, you can listen to music, take a rest, or go outside. You have to try different things. You can’t just give up, you have to keep going.”"}, {"text": "Josh Leechong, a junior, said, “I have control of when or the nature of how I procrastinate.”"}, {"text": "This does not mean procrastination should be rationalized, but you should understand why it might happen. Always blaming it on yourself for being lazy doesn’t do much because it doesn’t help you find the root of your procrastination or the solution to it."}, {"text": "So the next time you procrastinate, try to focus on what the reason could be for your procrastination so you can overcome it, instead of depreciating yourself by assuming that it’s your fault for being downright lazy."}, {"text": ""}, {"text": "IMAGE MY JORDAN BLAISE"}], "file_structural_elements": {"title": "Procrastination Isn’t You Being Lazy… Probably", "date": "May 5, 2022", "writer": {"441oJuAOMJ93mb04Urf2": {"name": "Jordan Blaise", "year": "2021"}}, "description": "     Procrastination is seen as a terrible habit that’s completely self-accountable, and most believe that students with this habit are just downright lazy. But if you procrastinate, is it really your fault?\n     The answer may seem obvious at first, but looking into it deeper can actually give insi", "image": "https://thepirateseye.org/wp-content/uploads/2022/03/Screenshot-2022-03-30-2.32.00-PM.png"}}