{"tree_elements": [{"text": "Two hurricanes ravaged the Caribbean U.S. territory of Puerto Rico in the late summer of 2017. Since then, over 3.2 million Americans are still without power and running water. Most Americans–including students at South– are still in the dark about the current state of recovery on the tropical U.S. territory.\n \n      First came Hurricane Irma, which was relatively tame, that knocked out power across the island. Then came Maria, a category five on the Saffir Simpson scale. The National Weather Service declared that the storm struck the island as a strong category four hurricane with sustained winds as high as of 155 mph."}, {"text": "Although the storm swept over Puerto Rico for only a few hours, it produced heavy rainfall that caused major catastrophic flooding and flash flooding, which resulted in significant   damage to property and the loss of lives.\n\n     “It’s definitely an incredibly traumatic event and quite disheartening,”said senior Fayiz Faruk. “Especially since the storms happened within a week of one another, and the survivors were not given a chance to stand before the next storm. We just have to feel for them.”"}, {"text": "Nearly 3,000 Puerto Ricans were injured. According to CNN Money’s Analytics, the initial storm damage represented almost an entire year’s economic output for Puerto Rico, at almost 40 billion dollars. In a recent report from the island’s government to Congress, the total recovery cost for the island’s infrastructure and industry is now at $139 billion.\n\n     The island’s federal recovery aid requests have also been hampered by a number of debt recovery measures forced upon the island to repay it’s almost $70 billion in accumulated debts."}, {"text": "Puerto Rico has no elected voice in Congress. Sure it does have congressional representatives, but they have no voting ability like representatives from the mainland, leaving the Puerto Rican people with no federal recourse to challenge the government’s decision to give only $19 billion of the initial request of $46 billion in aid."}, {"text": "According to some experts the current recovery effort hasn’t met the needs of the devastation. Many residents still live under the blue plastic tarps provided by FEMA."}, {"text": "Atharv Honap went as far to say that the recovery efforts were “abysmal, and the federal government should be doing a lot better.”\n\n    The Federal Emergency Management Agency, in a statement made this passed July,  sad that they had failed to mobilize an adequate response to the situation in Puerto Rico."}, {"text": "With the failure of the federal government to meet the needs of the recovery, the burden of responsibility has fallen to private donors. This however is easier said than done, as many mainland charities don’t consider the island to be American enough for local aid.  For example, national charities contributed $341 million in post-strom support to Texas and $128 million that was donated to Florida’s recovery. Thanks to these charitable efforts, as well as a much more “robust” government response, Texas and Florida were back on their feet in a matter of weeks."}, {"text": "Puerto Rico is  not “foreign” enough for foreign aid and  not local enough for domestic."}, {"text": "The storms were, by any stretch of the imagination, a catastrophe of the highest order.  And to people who have family on the island, like myself, it was a deeply personal one. After a recent trip back to the island last summer, I saw first hand the state of a population in mourning and recovery."}, {"text": "My grandfather’s house in the city of San Juan sustained damage to his roof. My uncle who lives in the mountains of historic Ponce lost a wall, in addition to similar roof damage."}, {"text": "But this experience also made me especially thankful for the efforts of South students to help those who were affected by the storms. Early in the 2017 school year there was a joint Red Cross club and Student Council fundraiser that raised money by selling  t-shirts. The resulting proceeds were sent to the International Red Cross, which at the time was involved in the response and relief effort on the island."}, {"text": "On an island where even the traffic lights are not yet working, every bit helps. But more needs to be done. “South is a giving school,” said Honap. “And if we knew how I’m sure we would do more.” South can help in many different ways; from volunteering their time or donating money."}, {"text": "The best way to help, though, is raising awareness. Many students have forgotten or are unsure about what is happening in Puerto Rico. We can’t pride ourselves on being globally aware citizens when we ignore domestic crises like these."}, {"text": "Faruk said, “Awareness would bode very well, as more hearts and minds at the end of the day mean more people willing to act overall.”\n     With the failure of efforts by federal and national charitable organizations, the only way Puerto Rico can heal right now is with the help of private citizens. ."}, {"text": "Our contributions may be an hour of volunteer time or raising awareness about the plight of our fellow citizens who are still calling for our assistance."}, {"text": "PHOTO COURTESY: RICHARD MAFFEI"}], "file_structural_elements": {"title": "Puerto Rico remains attempting to recover from devastating hurricanes", "date": "November 14, 2018", "writer": {"K0XYYhODXZQZ46XQPVNR": {"name": "Richard Maffei", "year": "2018"}}, "description": "     Two hurricanes ravaged the Caribbean U.S. territory of Puerto Rico in the late summer of 2017. Since then, over 3.2 million Americans are still without power and running water. Most Americans–including students at South– are still in the dark about the current state of recovery on the tropical ", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/20180809_153005-900x506.jpg"}}