{"tree_elements": [{"text": "To the Editor: Sobhika Sampath"}, {"text": "When we are children, we are impressionable and only subject to read or watch the literature/film that our parents allow us to. Oftentimes, even when parents or other adults think they are protecting us by supporting the ban of LGBTQIA+ books, they are instead marginalizing children who are part of the community who should have the opportunity to see characters like them. Others, who do not identify with the community, should also be exposed to diverse characters. Children want to see themselves represented in media so they can envision a future of inclusivity and acceptance for whoever they choose to be and however they choose to identify. Having representation in books is a beautiful pathway to achieve that."}, {"text": "The first time I read a book that had LGBTQIA+ representation was in my 8th grade IRLA class; it was\nLily and Duncan by Donna Gephart. My teacher was one of the only ones who covered a unit on LGBTQIA+. I enjoyed reading the books with LGBTQIA+ characters because it opened my eyes to a world of perspective that I had never been privy to before. It was imperative for me to read that book as it helped me understand where other students are coming from.It makes all the\ndifference for students who are part of the LGBTQIA+ community to see that they are accepted in literature."}, {"text": "Your line “let each unread word be read” particularly spoke to me, and I want to echo that by emphasizing that children’s books and books intended for students, in general, need reform as they need to be inclusive of all types of characters because in real life there is no character that fits a certain stereotype or fits in just one community."}, {"text": ""}, {"text": "Anushri Dwivedi"}, {"text": "2023"}], "file_structural_elements": {"title": "Re: Break the shell, keep the book", "date": "November 17, 2022", "writer": {"": {"name": "Sobhika Sampath", "year": ""}}, "description": "To the Editor: Sobhika Sampath\nWhen we are children, we are impressionable and only subject to read or watch the literature/film that our parents allow us to. Oftentimes, even when parents or other adults think they are protecting us by supporting the ban of LGBTQIA+ books, they are instead marginal", "image": null}}