{"tree_elements": [{"text": "To the Editor: Sidd Shetty, Aditi Kamal and Melvina Deb"}, {"text": "Quarantine has pulled in a storm of new worries for most of us and virtual schools and isolation have changed our relationships with not only academics but also our friends, family and even ourselves. While a good night’s sleep, soothing scents and a life routine will help students focus and destress, I think the topic of exercise and diet (mentioned in the article) requires more emphasis and a larger spotlight."}, {"text": "I’ve noticed that over the years, more people have been embracing the fitness community. Swapping denim jeans for spandex yoga pants, signing up their whole family for a gym, following a handful of attractive fitness gurus via YouTube and Instagram—even so, many people still treat exercise like a chore."}, {"text": "It may be painful to get into at first, but even 10 to 15 minutes of simple cardio or a mile-long walk can do so much for you. As the article stated, exercise releases endorphins and can improve your sleep. It also helps prevent certain medical problems and diseases, increases your energy levels, motivates you to try out new things and introduces you to a wider range of people simply because you have introduced fitness into your lifestyle. All these benefits can put you more at ease. Similarly, a good diet and the right food can easily help you get in the right mood. Exercise is still an underrated subject even in this era full of fitness and it’s something that needs to be included more for the good of our minds and bodies."}, {"text": "Samantha Syrek"}, {"text": "2023"}], "file_structural_elements": {"title": "Re: “Coping with school-related stress during the pandemic” (Jan. 6, 2021)", "date": "March 11, 2021", "writer": {"": {"name": "Samantha Syrek", "year": ""}}, "description": "To the Editor: Sidd Shetty, Aditi Kamal and Melvina Deb\n     Quarantine has pulled in a storm of new worries for most of us and virtual schools and isolation have changed our relationships with not only academics but also our friends, family and even ourselves. While a good night’s sleep, soothing s", "image": null}}