{"tree_elements": [{"text": "To the Editor: Renee Pujara, Manika Niwas, Ishani Konar"}, {"text": "As climate change causes hurricanes to worsen, the most effective thing we can do is prepare for it. As detailed in the article, Hurricane Ida left many people struggling to stop flooding, and fix the damages it had caused. We can expect that future hurricanes will be increasingly harsher due to the atmosphere’s higher temperatures. In our community it’s important that we prepare for future threats, so as to avoid such extreme flooding in our streets and homes. We need to think more creatively on how to mitigate the effects of strong storms. Looking at Austin, Minnesota, after experiencing constant floods due to a river running through their town, in 2004 they decided to put up flood walls to prevent this river from continuing to flood large businesses and buildings. In our own community we should focus on the biggest threats to our own local shops and homes, preventing future costly damages."}, {"text": "These preventative measures will be useful year round, since flooding is a problem not only during hurricane season.  Over the course of only 10 years, New Jersey has observed a 7.9% increase in precipitation. (Department of Environmental Protection) Austin, Minnesota was able to begin their improvements by acquiring the support of their community, and actively getting a hold of important businesses and landowners. Through these efforts they achieved the necessary support to fund their actions."}, {"text": "The West Windsor Community has improved itself in many ways over the years, and the next step is protecting itself from the ongoing threat of hurricanes and flooding. Articles such as this one are vital in bringing attention to topics regarding our environment and planet. Rather than continue to be plagued by flooding throughout the next few years, we can make changes now and avoid costly damages to businesses and homes."}, {"text": "Eliza Azaro"}, {"text": "2024"}], "file_structural_elements": {"title": "Re: “Intense storms: A consequence of climate change” (Nov. 9, 2021)", "date": "November 23, 2021", "writer": {"": {"name": "Eliza Azaro", "year": ""}}, "description": "To the Editor: Renee Pujara, Manika Niwas, Ishani Konar\n     As climate change causes hurricanes to worsen, the most effective thing we can do is prepare for it. As detailed in the article, Hurricane Ida left many people struggling to stop flooding, and fix the damages it had caused. We can expect t", "image": null}}