{"tree_elements": [{"text": "Say goodbye to heavy, suffocating, wasteful plastic bags. New Jersey will soon lead in environmentalism with its statewide ban on single-use shopping bags."}, {"text": "In November 2020, Governor Phil Murphy signed law P.L.2020 c.117, banning all single-use carryout bags from being distributed by grocery stores, retail, and other businesses. This is the most thorough bag ban ever imposed in the country, and is scheduled to go into effect starting May 4, 2022."}, {"text": "This is a significant action that New Jersey has been long overdue for. Plastic is one of the environment’s worst enemies, and plastic bags are certainly one of the most commonly used, environmentally harmful pollutants."}, {"text": "“I’m glad that this ban has finally been put in place,” said sophomore Advait Gupta, “I think that it’s a good start to improving the environment.”"}, {"text": "There is a considerable amount of opposition to the legislation, particularly from stringent retailers that believe they will lose potential business and critics of reusable bags."}, {"text": "Director of the American Progressive Bag Alliance Matt Seaholm stated in a Fox News article, “Plastic retail bags are the best options at checkout as long as they are disposed of properly.” He described the action as “taking a sledgehammer to a mosquito.”"}, {"text": "But in the long term, the benefits of the ban certainly outweigh the drawbacks."}, {"text": "“I think that this ban represents a new chapter of environmentalism in New Jersey,” said senior Anushya Shankar. “Over the last decade, we’ve been seeing more initiative towards being environmentally conscious, and I think that trend will continue through this ban as well.”"}, {"text": "Plastic is manufactured from petroleum, an oil that takes millions of years to form. Because of this, petroleum is easily exhausted without sustainable practices. What’s more, plastic products are incredibly difficult to break down and can produce microplastics, according to environmental science teacher Jamie Roder. Microplastics are tiny plastic particles capable of accumulating in the environment and within organisms."}, {"text": "“This can build up and block their intestinal systems and prevent them from digesting,” said Ms. Roder. “They can also fill up their stomachs and can cause a reduced feeling of hunger, they might not eat enough to survive. And then there is also the threat that there could be toxins in these plastics.”"}, {"text": "The ban also covers paper bags, which many businesses in the paper industry argue is too strict. While more eco-friendly, paper has its share of drawbacks. Paper consumes more resources than plastic when produced: large amounts of land, water, and nutrients are consumed as trees are grown and deforested. The process of refining wood into paper consumes a great amount of energy, some from renewable sources like biofuel and hydroelectric energy, but some from fossil fuels that emit large quantities of greenhouse gasses. So cutting paper bags out entirely conserves a substantial amount of resources."}, {"text": "“A huge amount of the water that we use is actually built into the products that we buy. And paper bags, especially since they depend on growing trees, will have a much higher water footprint than plastic bags,” said Ms. Roder."}, {"text": "The financial concerns that many businesses have are justified. Cutting out convenient carryout bags will reduce the amount of product that shoppers can carry. But, these bags are still an expense that stores have to invest in, and prohibiting the distribution of carryout bags will actually be a substantial benefit in the long run for businesses that won’t need to order batches of bags."}, {"text": "“Over time, if we as a society get into the habit of bringing our own bags to grocery stores, it will ultimately lower costs because the grocery stores would simply not have to provide that anymore,” said Ms. Roder. “The initial impact would be the greatest, but the stores will purposely have to adapt for the better of the environment.”"}, {"text": "The purpose of this ban extends beyond monetary costs and profits. By bringing reusable bags during shopping excursions, citizens will be forming sustainable long term habits that decrease the use of plastic and paper, lessening the demand for their production and reducing the amount of garbage that would pile into landfills."}, {"text": "“This legislation helps create a mindset that plastic should stop being the easy ‘go-to’ solution,” said junior Arushi Aggarwal. “It helps create awareness about the various alternatives and allows people to dive deeper into helping the environment as this ban is going to affect their daily lives.”"}, {"text": "Bad habits are the toughest to break, but this bag ban is sure to make people think and encourage them to consider the environmental effects of their actions. Overcoming the inconvenience of bringing your own shopping bags today is integral to promoting a cleaner Earth tomorrow."}, {"text": ""}, {"text": "PHOTO BY DEEPA SRINIDHI"}], "file_structural_elements": {"title": "Reduce and sustain", "date": "April 1, 2022", "writer": {"arVyKy5gQKK0nVfft2Bk": {"name": "Deepa Srinidhi", "year": "2021"}, "x0qtq92usjgRms9hU9NA": {"name": "Alexander Chang", "year": "2021"}}, "description": "     Say goodbye to heavy, suffocating, wasteful plastic bags. New Jersey will soon lead in environmentalism with its statewide ban on single-use shopping bags.\n     In November 2020, Governor Phil Murphy signed law P.L.2020 c.117, banning all single-use carryout bags from being distributed by groce", "image": "https://thepirateseye.org/wp-content/uploads/2022/04/Screenshot-2022-04-01-11.35.12-AM.png"}}