{"tree_elements": [{"text": "Organ donation is a gift of life for patients as many are not lucky enough to get an immediate transplant. In fact, according to Mountain Nittany Health Center, there are 116,000 patients in the US waiting for organs. Until they receive one, many have to stay in the hospital for months or years, living in a condition that is similar to being paralyzed."}, {"text": "People of all ages can be organ donors. When students  receive their driver’s permits and licenses, they are considered eligible for organ donations. But if a person is younger than 17 or older, and is willing to apply for organ donation,  the NJ MVC driver’s manual instructs that a person 14 years old may apply for a non-driver identification card. In this process, they will be asked if they want to be included in New Jersey’s Donate Life Registry."}, {"text": "“It was eye-opening to me when the sharing network first came into my life through driver education,” Driver’s Education teacher Colleen Spicer said. “They were able to make you understand the value of it and the simple act of one last gift you can leave at your death to make many other lives richer.”"}, {"text": "By answering “yes,” one is agreeing to donate one’s organs or eyes upon their death, essentially saving a life. “I feel an organ transplant is a gift of life to someone,” said Denise Peoples, Community Services Specialist of the NJ Sharing Network, a non-profit organ procurement organization. “But not every organ transplant patient is lucky enough to earn an organ.  In fact, Ms.Spicer’s family benefited greatly."}, {"text": "“My family has benefited from organ donation with my sister receiving a life-saving liver from complications of chronic disease,” she said."}, {"text": "While the necessity of organ donation is clear, many people are afraid to sign up for organ donation or avoid registering because of religious or academic reasons. Misconceptions and fears are abundant."}, {"text": "Apurva Nayak (‘23) said, “I think some people have the idea that being a donor means your organs can be taken from you during any kind of medical procedure, which is obviously not true. A lot of people might also not know about the long list of patients that need transplants, which stems from the lack of education on the topic.”"}, {"text": "One way to alleviate such fears, as Apurva said, is through education. Whether it’s in driver’s ed or health courses. The reason is, that people misunderstand the topic as a whole and as a result, they fear donating organs."}, {"text": "Ms. People agreed. “Educating kids about the importance of organ donation reduces their fears.”"}, {"text": "Students should undoubtedly step up. The organ donation department encourages all students to sign up who are 18 and if it’s acceptable with parents or guardians.“ Taking the right decision and discussing the matter with their family is really important before signing up.” Ms. Peoples said."}, {"text": "“I think the biggest problem in getting people to sign up is the lack of education,” Ms. Spicer said. “Now that NJ requires the teaching of organ donation in the curriculum I think people will be much more willing to participate.” Signing up can be tough but the rewards of saving a patient’s life are undoubtedly worth it and it is an offering that will stay in a patient’s memory for years."}], "file_structural_elements": {"title": "Save a life after life: The importance of organ donation", "date": "November 17, 2022", "writer": {"": {"name": "Padmaja Thirumalai", "year": ""}}, "description": "Organ donation in the past 5 years. Created by Aadya Srivastava (’26).\n     Organ donation is a gift of life for patients as many are not lucky enough to get an immediate transplant. In fact, according to Mountain Nittany Health Center, there are 116,000 patients in the US waiting for organs. Until ", "image": null}}