{"tree_elements": [{"text": "There is a particular joy in picking out the perfect living Christmas tree. Fir, pine, and spruce are all common varieties grown on Christmas tree farms. Bringing it home and adorning it with ornaments and lights is part of the Christmas tradition. On Christmas morning, families sit beside the tree, open presents and enjoy time together."}, {"text": "But what happens to the tree when Christmas is over?"}, {"text": "More often than not, these trees are collected and disposed in a landfill. Junior Chacrica Pagadala said, “[I]f this organic waste is used as manure for plants and trees, it’d be resourceful and helpful for the environment.”"}, {"text": "Although simply throwing out these trees is the more convenient way of disposing of them, it is detrimental to the environment. According to London’s waste clearance company, Envirowaste, “Six million trees are thrown out after Christmas, creating more than 9,000 tonnes of additional waste.”"}, {"text": "Since many of us buy these trees as part of celebrating Christmas, the question to be asked is: Should we just stop buying trees altogether?"}, {"text": "Not necessarily."}, {"text": "“One way to dispose of your Christmas trees in an eco-friendly way is to send them through a wood chipper and make mulch for your garden,” said senior Annika Baldwin, one of the officers of South’s environmental club. “That way you can reuse your dead tree in a way that will help you grow new plant life.”"}, {"text": "Mulch provides moisture and weed-resistance for plants. It also helps soil productivity, so by turning a Christmas tree into mulch, it can emulate what happens when a tree dies and falls to the forest floor to rot in nature. This is significantly better than just throwing out the tree."}, {"text": "Baldwin offered suggestions for buying a certain type of Christmas tree which would eliminate going through the time of making the mulch. Baldwin said, “If you have room in your backyard, you could also buy a Christmas tree with a root ball, so after Christmas is over you can take the tree outside and plant it rather than buy a dead tree.”"}, {"text": "A root ball is a mass of roots contained directly under a plant’s stem. These roots are attached to the soil surrounding it, and rely on this soil for water and nutrients to grow and develop. When a Christmas tree has its own root ball, it is possible to replant the tree right outside the house, and the tree will continue to live and grow. This same tree can be used for Christmas for many years to follow."}, {"text": "“We are a part of the environment too, so it is important to take care of it, especially with climate change on the rise,” Baldwin said. “Any local action to keep our natural world healthy makes a difference.”"}, {"text": "PHOTO BY PRIYANKA CHAKRABARTI"}], "file_structural_elements": {"title": "Saving the environment one tree at a time", "date": "December 20, 2019", "writer": {"AXvzZ0PQFIFcXDXWC3U8": {"name": "Priyanka Chakrabarti", "year": "2020"}}, "description": "There is a particular joy in picking out the perfect living Christmas tree. Fir, pine, and spruce are all common varieties grown on Christmas tree farms. Bringing it home and adorning it with ornaments and lights is part of the Christmas tradition. On Christmas morning, families sit beside the tree,", "image": "https://thepirateseye.org/wp-content/uploads/2019/12/Christmas-tree-675x900.jpg"}}