{"tree_elements": [{"text": "Strolling past the neighborhood shops of small towns and browsing through the isles of local stores has become a rare part of our holiday shopping routine. These days, we spend most of our time browsing online retailers like Amazon, Target or Walmart."}, {"text": "The convenience of Amazon and other big retailers comes at a price: the survival of small businesses in our country. This imbalance in the ability to thrive between large and small businesses have only been worsened by COVID-19. Since March, people have been shopping more from big retailer websites, which were able to transition smoothly into the pandemic, and left small businesses unable to operate efficiently."}, {"text": "Data from JP Morgan Chase shows that revenues from small businesses dropped 30-50% at the end of March and early April and 40% in May. Meanwhile, James Kwak from The Washington Post reported that big corporations such as Walmart and Target almost doubled online sales."}, {"text": "That we have shifted to purchasing from big corporations during the pandemic is particularly worrisome because small businesses contribute tremendously to our country’s economy."}, {"text": "According to the American National University, small businesses with less than 20 workers employ more than 20 million people and account for more than half of all U.S. sales."}, {"text": "Heidi Moon, the owner of Miya Table & Home in downtown Princeton, a third-generation family-owned small business selling Japanese tableware, said “It’s well known that small businesses are essential to a local economy. Local businesses provide jobs, pay taxes, utilize other local businesses and services, donate to more local non-profits, and generally have smaller carbon footprints.”"}, {"text": "Small businesses also benefit individuals and local communities."}, {"text": "World History teacher Brian Levinson said, “I think we’re losing this idea of tight-knit communities in the United States. We’ve become too car-reliant, we’ve become too internet-reliant and in a certain way that starts fraying the social fabric.”"}, {"text": "An easy but certainly effective way to address this concern is to help local businesses."}, {"text": "Dorothea von Moltke, co-owner of Labyrinth Books in Princeton, said, “Small businesses matter to the economy of the place where they are located, as well as to the social fabric. These businesses are what keep a town unique and heterogeneous, as opposed to looking like every other place with the same chain stores. Small businesses are places of encounter and conversation.”"}, {"text": "Like Moltke, students at South also recognize the benefits of small businesses. Junior Anushri Dwivedi said, “I like shopping at small businesses because it’s a really nice thing to do. I like the friendly and personal environment they have in the store. I like that there are so many unique and fun things to look at.”"}, {"text": "Faith Hu agreed on the benefits shopping local. She said, “You can get good products that you know are high-quality and reliable. It just feels more special.”"}, {"text": "Considering all the advantages small businesses bring to us and our community, we should support them while shopping this holiday season."}, {"text": "“And small businesses are places of encounter and conversation.”"}, {"text": "Moon said, “The holiday season is the most important retail season. Most businesses depend on these last few months of the year to stay afloat. So if you skip over the small businesses during this time and only shop online from big-box businesses or Amazon, it could be detrimental to a lot of us.”"}, {"text": "So turn off your phones and put on your shoes. Spend a day browsing local shops and give thanks not only to your loved ones but also to our local community and those who support it through their businesses."}, {"text": "Need help finding small businesses near us? Have a look at the list provided by The Pirate’s Eye."}, {"text": "PHOTOS BY VIVIAN XIE"}], "file_structural_elements": {"title": "Shopping Local for the Holidays", "date": "December 21, 2021", "writer": {"oZGSQKPCWdIpU60HDHNu": {"name": "Vivian Xie", "year": "2022"}}, "description": "\n\n\n\n\n\n\n\nGallery|3 Photos\n\n\n\n\n\n\t\t\t\t\t\t\tRows of bookshelves inside Labyrinth Books in Princeton\t\t\t\t\t\t\n\n\n\n\n\n\n\nStrolling past the neighborhood shops of small towns and browsing through the isles of local stores has become a rare part of our holiday shopping routine. These days, we spend most of our time ", "image": "https://thepirateseye.org/wp-content/uploads/2021/12/IMG_9926-900x675.jpg"}}