{"tree_elements": [{"text": "“With a longer winter break we can sleep and check up on a lot of things,” said Esha Mittal, a sophmore of South."}, {"text": "For most students winter break is a time of celebration and relaxation.  It is right in the middle of the second marking period, giving students a nice break.  They can travel locally or internationally or stay in the comfort of their own home. But this winter  break is only thirteen days."}, {"text": "South students come back a day after New Year’s.  This year, Jan. 2 is a Thursday. Since students and teachers are recovering from staying up till midnight to ring in the  New Year, we are not prepared to come back to school so soon."}, {"text": "In the West Coast, the Los Angeles highschool students, like most other California schools, return to school on Jan. 7.  This is a Monday, and by coming back on the first day of the week, California students have an extra two days plus a weekend off on their winter break."}, {"text": "If South were to implement a longer winter break that extended until Jan. 7 then students would be able to come back well rested and readjusted from any trip, especially if they go abroad."}, {"text": "Victoria Tiep, a sophomore, agreed “[E]veryone would be able to come back from their vacation and recover.”"}, {"text": "This would let students recover from jetleg and unpack before the next half of marking period two starts."}, {"text": "Of course not everyone goes on trips over winter break. But one thing that all students enjoy is sleep."}, {"text": "Research has found that sleep during breaks are beneficial for better brain function.  In 2019, a study from Edutopia used a neuro brain scanner on students to test the benefits of school breaks. They found time off from school is “crucial for consolidating memories, reflecting on past experiences, and planning for the future—in other words, it helps shape how we make sense of our lives.” said a scientist from Edutopia.  Families who travel abroad usually don’t return until the very last day of vacation. If these students are recovering from jetlag, how will they have a good night’s sleep to be ready for school the next day?"}, {"text": "With more days for winter break, students will have time to adjust back to their sleep schedule for school. Doesn’t everyone need a relaxing break to restart for the second half of the school year?"}], "file_structural_elements": {"title": "Should winter break be shorter or longer? – Pro", "date": "December 20, 2019", "writer": {"NQeL97Oq7Jy8RXhYXUIT": {"name": "Madoka Kondo", "year": "2019"}}, "description": "“With a longer winter break we can sleep and check up on a lot of things,” said Esha Mittal, a sophmore of South.  \nFor most students winter break is a time of celebration and relaxation.  It is right in the middle of the second marking period, giving students a nice break.  They can travel locally ", "image": null}}