{"tree_elements": [{"text": "There is nothing better than winter break to celebrate the holidays, spend time with family and finally get to relax. However, when winter break gets too long, students begin to experience  disadvantages."}, {"text": "A lot of students at South want the break to be longer, but I don’t agree that’s a good idea."}, {"text": "I agree with the view that a longer break puts students at an academic disadvantage and in the long run, ruins their summer plans.“If break were any longer, it would end up making the school year’s length extend because we need 180 days of school,” said junior Knicky Yeh."}, {"text": "Most students would rather have their summer break start earlier than later. This is affected by the amount of time it takes to hit that 180 school day mark."}, {"text": "According to a study by PBS in December 2017, students coming back from a longer break from school tend to have more academic anxiety for when they return."}, {"text": "“Whenever I come back to school after a long period of time, I always feel a little rusty on some topics, especially when we stop mid-marking period.” said junior Allie Rome."}, {"text": "Rome isn’t the only one who sees a longer break as a drawback from school. Junior Anha Mehta said, “When I come back after winter break, I’m going to be used to slacking off at home and sleeping in. It’s going to be really difficult to get into the mindset I need to be in to be prepared for my classes.”"}, {"text": "While winter break is beneficial for unwinding from school and not being stressed about upcoming assignments, in the long run, students are pushing themselves out of the same routine they have been keeping up since September."}, {"text": "If we had a longer break from school, students would easily get bored and have nothing to do. According to the New York Times, it is common for students who are bored after school to participate in extracurricular clubs, school sports and anything to preoccupy themselves, activities they can’t do if school is not in session."}, {"text": "Moreover, break is the right length which grants students with enough time to re-nourish the brain and body. “Winter break is long enough so that you have time to relax but it’s not too long that you get bored,” said sophomore Rishab Nalgundwar. “If it were any longer, I think I’d be struggling to stay energized.”"}, {"text": "A longer break is viewed by many as the nicest part of the winter season. But what students don’t realize is that they are suffering a drawback because they are giving their brain too much of a rest. The current winter break schedule should stay the same because it ends right after the new year begins, giving students a fresh start for the year."}], "file_structural_elements": {"title": "Should winter break be shorter or longer? – Con", "date": "December 20, 2019", "writer": {"t1wNGC5vCu2m5zKSZgLI": {"name": "Sophia Englezos", "year": "2020"}}, "description": "There is nothing better than winter break to celebrate the holidays, spend time with family and finally get to relax. However, when winter break gets too long, students begin to experience  disadvantages. \nA lot of students at South want the break to be longer, but I don’t agree that’s a good idea.\n", "image": null}}