{"tree_elements": [{"text": "Have you ever noticed people stumbling through corridors with a can of soda or a cup of coffee? These are sleepy students with glazed eyes and foggy brains trying to focus and work through their day to no avail."}, {"text": "Sleep deprived high schoolers are all over America. Juggling homework, clubs, and other extracurricular activities, teenagers can find it really hard to get the sleep they need."}, {"text": "According to the Centers for Disease Control and Prevention (CDC), teenagers should sleep for 8 to 10 hours every night, but 70 percent get less than 7 hours on a school night."}, {"text": "Sophomore Hiir Bhatt said, “I don’t think I get enough sleep — I only get about 6 hours, as I have a lot of homework. Especially on the days I have clubs, I sleep very late.”"}, {"text": "Getting enough sleep and rest might also seem hard to do for some high schoolers because of a natural biological shift that occurs in their circadian clock — a person’s internal clock that controls the sleep and wake cycle. This makes it difficult for most teenagers to fall asleep before 11 p.m. Sleeping late and getting up early for school the next day keeps their bodies from getting the sleep they need."}, {"text": "Not only do students experience sleep deprivation, teachers do as well. Ms. Brandy Moncada, a Spanish teacher and gymnastic coach, said, “I don’t get enough sleep, I probably get like six, maybe seven hours, if I am lucky, but I think my body could probably use more.”"}, {"text": "Often, students and teachers substitute sleep with caffeine. To make up for lost sleep, Anandabhirama Tirumala, a junior, said, “I drink coffee to get energized and sometimes eat chocolate.”"}, {"text": "Even though caffeine can make a person alert and active for some time, it affects their ability to concentrate and sleep easily. Too much caffeine can cause anxiety, and jitteriness."}, {"text": "Is nap time the fix?"}, {"text": "One radical solution is introducing nap time in school. “It would make them feel better and more rested,” said Dr. Meenakshi Bhattacharya, a biology teacher. “They will be more ready to tackle the second half of the day.”"}, {"text": "A study by the University of Delaware found that nap time improves neurological functioning in teenagers. In fact, many studies show that a 20-30 minute catnap can help students feel more alert and focused."}, {"text": "Freshman Anushka Sen said, “Sleep plays a role in your attention span, if you don’t get sleep, you don’t focus because you wanna sleep in class.”"}, {"text": "Like Sen, many students find it difficult to sit through a mentally tedious class when your brain hasn’t gotten the sleep that it needs to function."}, {"text": "Still, some students argue that nap time is not practical during school hours. “Students won’t be able to get a proper nap in school because of the conditions and noise,” said freshman Advik Vermani."}, {"text": "Although this is a valid concern, some schools have provided opportunities for rest during the day. Las Cruces High School in Mexico has napping pods, which are egg-shaped lounge chairs that recline with a circular lid to be pulled over the chest to shield students from light. Relaxing music plays inside that gives the student 20 minutes to take a breather."}, {"text": "Nap time is what students need to re-energize in the middle of a stressful day. Whether we have nap time in school or not, it’s important to get a good night’s sleep."}], "file_structural_elements": {"title": "Should high schools have nap time?", "date": "January 18, 2022", "writer": {"XETo63LBGDzjNVJ1rC0Q": {"name": "Shefali Saxena", "year": "2021"}}, "description": "     Have you ever noticed people stumbling through corridors with a can of soda or a cup of coffee? These are sleepy students with glazed eyes and foggy brains trying to focus and work through their day to no avail.\n     Sleep deprived high schoolers are all over America. Juggling homework, clubs, ", "image": "https://thepirateseye.org/wp-content/uploads/2022/01/Screen-Shot-2022-01-07-at-3.25.09-PM-900x722.png"}}