{"tree_elements": [{"text": "With 2.6 billion users on Facebook, 112.5 million on Instagram and 330 million on Twitter, social media has the potential to bring real change in the world."}, {"text": "Since the murder of George Floyd at the end of May, people around the world are using social media to show their support for the Black Lives Matter movement and to stand up for what is right. These events spark the question: is social media successful in bringing social change?"}, {"text": "While some argue that getting involved in social media activism won’t pilot any real change, in reality, the overwhelming amount of support on social media inspires people to take action and create that change. A 2018 study conducted by the Pew Research Center showed that 67 percent of Americans felt that social media is important to create sustained movements for social change."}, {"text": "The power of social media, especially during the current surge in support of the Black Lives Matter movement, is clear. Since Floyd’s death on May 25, millions of people have continued to use social media to fight for justice."}, {"text": "“I posted links to places people can donate and also a list of ways teenagers in New Jersey can help right now,” said senior Phoebe Elias. “Social media is a good way to get everyone involved with the movement.”"}, {"text": "The stream of support in the past weeks has gained a flood of public attention. Social media makes it convenient to get people’s attention because it’s the fastest way to reach a large public. This is why it’s so important that people and especially public figures, use their social media platforms to inspire change."}, {"text": "“People definitely get mad when they see celebrities and politicians not posting about whatever political issue is going on at the time. They have to be a voice for their millions of followers,” said senior Abbie Randow."}, {"text": "However, attention is not enough; action needs to be taken. Some people think social media activism is a surface level way to make a change, calling it unhelpful or preformative. But the more attention important issues get on social media the more this leads to substantial actions taken."}, {"text": "For example, in the past 2 weeks, millions of people have been posting different ways everyone can do their part to support Black Lives Matter. On Tuesday, June 2, over 14 million people posted a black screen on Instagram with #BlackoutTuesday in protest of Floyd’s murder."}, {"text": "On all social media platforms, there were links shared to different websites for donations, petitions to sign and information about protests the public could attend. All of these things are doing more than just sharing a post in support."}, {"text": "While social media is helping to drive the Black Lives Matter movement currently, it also played a big role in the worldwide March For Our Lives movement. In 2018, following the Marjory Stoneman Douglas High School shooting in Florida, March For Our Lives was created through social media to fight against gun violence. There were over 11 million posts about it, most encouraging people to attend local protests supporting the cause."}, {"text": "Some argue that it’s impossible to fight for social justice through a screen. In a 2010 New Yorker article entitled “Small change: why the revolution will not be tweeted,” author Malcolm Gladwell argues that social media activism will never accomplish more than physical or “high-risk” activism. Gladwell claims that social media generates weak ties and “weak ties seldom lead to high-risk activism.”"}, {"text": "The Civil Rights protests of the 60s have proven that high-risk activism leads to change. And while just posting a picture in support of something with a trending hashtag isn’t going to change a lot, the attention that it raises will."}, {"text": "Social media activism can be the building block of high-risk activism. As times have changed, the way people fight for what they believe in has changed too and social media is at the forefront of it all."}], "file_structural_elements": {"title": "Social Media activism creates impact", "date": "June 19, 2020", "writer": {"": {"name": "Alyse Dunn", "year": ""}}, "description": "     With 2.6 billion users on Facebook, 112.5 million on Instagram and 330 million on Twitter, social media has the potential to bring real change in the world. \n     Since the murder of George Floyd at the end of May, people around the world are using social media to show their support for the Bla", "image": null}}