{"tree_elements": [{"text": "In response to the May 24 school shooting in Uvalde, Texas, Students Demand Action, a student-run club committed to ending gun violence in schools, organized a walkout. During 3rd block, on Friday, June 3, students quietly left their classes and gathered on the bleachers in front of the football field to hear speeches given by student and teacher representatives of Students Demand Action."}, {"text": "Most speeches focused around the rampant gun violence in our schools and, more importantly, the lack of action taken to protect our nation’s children. Though most of the students agreed on the content of the speeches and the severity of the issue, some were doubtful of the effectiveness of walkouts."}, {"text": "“I don’t think [walkouts] are effective because no matter how many people walkout of the school, there’s still going to be gun violence. You can’t really stop it from a walkout,” said freshman Pulkit Chaudhary."}, {"text": "The frustration is understandable. After all, the Columbine High School shooting was 20 years ago and since then our government has failed to establish even the most basic gun violence prevention strategy of expanding background checks. More than 311,000 students have become victims of gun violence in the past 23 years and more have been gripped by the fear of gun threats at their own schools."}, {"text": "It’s easy for fellow students to feel helpless in situations like these."}, {"text": "Despite ineffective preventions of gun violence in schools, some remain hopeful that school walkouts will bring about the change they hope to see."}, {"text": "“When we see or hear these news stories about kids our age and kids even younger than us, it’s truly heartbreaking,” said Nirali Sanghvi, the president of Students Demand Action, speaking about the Uvalde shooting. “As youths, we are directly impacted by the issue of gun control and we have to make sure we make our voices heard. By walking out and standing with the families who are forever impacted by gun violence, we send a strong message by showing solidarity, unity, and discontent with our current regula tion policies.”"}, {"text": "Junior Anushri Dwivedi agreed. She said, “A lot of the times students don’t feel like they have the power to do anything because they’re not adults and no one will listen to them. But I think walkouts are an effective way for students to peacefully protest because if everyone is coming together for a certain cause and they’re walking out, it sends a message.”"}, {"text": "Whether you think walkouts are effective or not, action must be taken against gun violence in schools."}, {"text": "“Gun violence is the leading cause of death for children in the United States. It is an epidemic in this country and since Uvalde, there has already been a number of mass shootings. People are dying and something obviously needs to be done to fix that,” said Ms. Amanda Huelbig, a math teacher at South."}, {"text": "Students must do what is within our power to reduce gun violence whether it is through joining our school’s Students Demand Action club, voting, or educating others on the urgency of this issue. We are not powerless."}, {"text": "*link to='https://thepirateseye.org/wp-content/uploads/2022/06/IMG_5973.heic'**/link*"}], "file_structural_elements": {"title": "South students walk out to protest gun violence", "date": "June 22, 2022", "writer": {"oZGSQKPCWdIpU60HDHNu": {"name": "Vivian Xie", "year": "2022"}, "XETo63LBGDzjNVJ1rC0Q": {"name": "Shefali Saxena", "year": "2021"}}, "description": "In response to the May 24 school shooting in Uvalde, Texas, Students Demand Action, a student-run club committed to ending gun violence in schools, organized a walkout. During 3rd block, on Friday, June 3, students quietly left their classes and gathered on the bleachers in front of the football fie", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/IMG_5973-900x675.jpeg"}}