{"tree_elements": [{"text": "100-dollar shoes furiously ripped apart, thrown in the trash or burned.  This is what some customers recorded themselves doing with their Nike products, followed by posts of their pictures and videos online. The cause of the destruction was their reaction to the Colin Kaepernick ad campaign released by Nike. Though these customers are free to express their dislike for Kaepernick, they are overreacting and inflating the Kaepernick ad campaign into an issue greater than it really is."}, {"text": "Before the 2016 NFL game, Colin Kaepernick, playing for the San Francisco 49ers, knelt to protest against police brutality during the national anthem. His act of civil disobedience received backlash from the public. Some say that not standing for the national anthem was disrespectful to the nation and the military."}, {"text": "The NFL announced in March of 2017, with a mutual agreement between Kaepernick and the San Francisco 49ers, that he opted out of his NFL contract. He was no longer in the San Francisco 49ers team. However, NBC Sports said if Kaepernick had not left the team in a mutual agreement, he would have been asked to leave."}, {"text": "When Kaepernick was announced as the face of the Nike campaign in early September, some consumers criticized Nike for making Kaepernick a role model. The campaign contained Kaepernick’s face in a gray tone, with the phrase, “Believe in something. Even if it means sacrificing everything.” On Sept. 5, President Trump responded to the issue on Twitter: “Nike is getting absolutely killed with anger and boycotts.”"}, {"text": "Even so, at South, students are seen frequently wearing Nike products."}, {"text": "Elise Nass, a junior at South, said that even with the heated debate about the Kaepernick ad campaign, she “still think(s) it’s a good brand.”"}, {"text": "However, other students gave negative responses about the company. Junior Ryan Lee said, “I don’t use Nike products, and I’m very cynical of companies like Nike that tell you how much their items improve your performance.” Ryan believed Nike used the Kaepernick as a way of “strategic advertising” in order to garner attention, which Nike achieved."}, {"text": "Kaepernick has been misunderstood; his intentions for taking a knee during the national anthem was for the good -a symbol of social protest -rather than a gesture of disrespect for the flag or people in the armed forces. Senior Anish Sharma said that the people offended by Kaepernick “have a lack of understanding of the message” in the Nike campaign."}, {"text": "Lee said, “People are offended by the fact that Nike is now supporting one side of the political spectrum,” that is, Kaepernick’s."}, {"text": "People have the right to express their opinions and in this instance Kaepernick has respectfully done so. He doesn’t deserve the hate he has gotten for his part in the Nike campaign."}, {"text": "Nass said, “I feel it is the right of Kaepernick and any (sports) players to protest and support their cause.”"}, {"text": "Despite being controversial, Kaepernick has benefitted Nike more than hindering the brand. Nike is said to have made more profit than the weeks before the campaign aired. About two weeks after the campaign released, Nike’s stock rose 6.82 percent, as shown by the New York Stock Exchange."}, {"text": "Many students in our school have unchanging views of Nike since Kaepernick’s situation is overly saturated and the company still maintains their high standards in the quality of their products."}, {"text": "When the students were asked if they would ever buy Nike products again, they all agreed that they would."}, {"text": "PHOTO COURTESY: GRACE CHOE"}], "file_structural_elements": {"title": "South students views on the Nike Kaepernick Campaign", "date": "November 14, 2018", "writer": {"L2tabycjXwSAHtJCW6yQ": {"name": "Grace Choe", "year": "2019"}}, "description": "100-dollar shoes furiously ripped apart, thrown in the trash or burned.  This is what some customers recorded themselves doing with their Nike products, followed by posts of their pictures and videos online. The cause of the destruction was their reaction to the Colin Kaepernick ad campaign released", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/IMG-1152-900x654.jpg"}}