{"tree_elements": [{"text": "“I got to sacrifice a lot of money to perform,” Cardi B explained about not performing at the 2019 Super Bowl.“But there’s a man who sacrificed his job for us, so we got to stand behind him.”"}, {"text": "The National Football League (NFL) struggled to find performers for the 53rd annual Super Bowl, which took place on February 3, 2019. The league contacted Cardi B as well as artists like Rihanna and Jay-Z. But all declined for one reason: The NFL has been involved in an ongoing controversy surrounding Colin Kaepernick, the former quarterback of the San Francisco 49ers. Kaepernick has become the face of activism against police brutality and racial injustice."}, {"text": "During the 2016 preseason, he and his teammate Eric Reid decided to kneel during the national anthem of their 49ers games. Other players have supported his activism and have followed his example, such as Jeremy Lane of the Seattle Seahawks and Brandon Marshall of the Denver Broncos. Kaepernick’s inciting protests did not sit well with the NFL who viewed taking a knee as disrespect towards American veterans and the American flag. Although Kaepernick explained his reasons, he was banned from playing for the 49ers and he was not drafted by any other team."}, {"text": "Because of the controversy surrounding Kaepernick, the NFL found it difficult to find big-name musicians willing to perform during the show."}, {"text": "In fact there was more speculation surrounding the halftime show rather than the actual match. The Super Bowl halftime show is one of the biggest opportunities in the country for artists to put on a show promoting their newest albums and top singles. The halftime stage has a long history of starpower, including artists such as Bruno Mars, Beyonce, Katy Perry and P!nk."}, {"text": "But this year, big names like Rihanna and Cardi B declined. Some football fans criticize these artists’ decision to not participate in the show, saying that politics should not interfere with love of the game."}, {"text": "But I think that the performers choice to value their moral beliefs over fame is commendable."}, {"text": "Artists, like Rihanna and Cardi B, have the right to use their popularity and impact to advocate for social justice. When powerful leagues such as the NFL abuse their power and shun players, backlash from other cultural influencers is not surprising."}, {"text": "About the backlash, sophomore football fan Reva Alladi said, “The decision to decline the offer is understandable because of the way the NFL handled the situation and their stance on the Colin Kaepernick controversy.”"}, {"text": "In fact, Jay-Z dedicated a song to Kaepernick at his concert in New York early last year and announced he declined the NFL’s offer in his lyrics stating, “I said no to the Super Bowl, you need me, I don’t need you.”"}, {"text": "Despite the obstacles, the NFL was able to release the music lineup for the show prior to the game. The lineup included Maroon 5, Travis Scott and rapper Big Boi."}, {"text": "It was a big surprise to see Maroon 5, who are from California, as the headlining group because the NFL usually picks singers whose hometown is in the same place the game is being held. This year, the Super Bowl was held in Atlanta, Georgia, home to many prominent rappers. Maroon 5 received backlash for accepting to play at the show, due to many believing they should not support the NFL."}, {"text": "Travis Scott also received a lot of backlash. Being an African-American rapper, he was criticized by many people who believed he should have backed out from the lineup. Jay-Z reached out to the rapper, encouraging him not to perform. Scott did, however, accept the NFL’s offer but only on the condition that he and the NFL make a joint donation of $500,000 to Dreams Corps, a social justice organization."}, {"text": "Despite the initial uncertainty, both groups performed at the 53rd Super Bowl. South Pirates, however, were not impressed. Freshman Matthew Xu said, “The artists simply didn’t fit the vibe of the Super Bowl.”"}, {"text": "Sophomore Meg Hanson said, “The show just wasn’t the same as previous years.” Maroon 5 lacked the same starpower and energy shown in artists of past halftime performances such as Bruno Mars. While there was much anticipation surrounding Travis Scott’s performance, he only performed one song which left many people disappointed."}, {"text": "Like the halftime show, the game too lacked the spirit and enthusiasm of past Super Bowls."}, {"text": "One can only imagine what a Super Bowl performance from Cardi B or Rihanna would have been like. That they decided to put their beliefs ahead of gaining more fame at this Super Bowl,  seems to me like the real touchdown."}], "file_structural_elements": {"title": "Superbowl halftime show: the Kaepernick effect", "date": "March 28, 2019", "writer": {"bijQTp8MbBbMBsVjvq8V": {"name": "Varsha Gollarhalli", "year": "2018"}}, "description": "     “I got to sacrifice a lot of money to perform,” Cardi B explained about not performing at the 2019 Super Bowl.“But there’s a man who sacrificed his job for us, so we got to stand behind him.” \n     The National Football League (NFL) struggled to find performers for the 53rd annual Super Bowl, w", "image": null}}