{"tree_elements": [{"text": "Sweet, chewy, soft, mouth-watering cookies with delectable flavors can make anyone feel like they’ve gone to heaven. You’ll find like these at Crumbl Cookies located in Princeton at Nassau Park Pavilion. Crumbl Cookies at Nassau Park Pavilion opened on Oct. 14 2022 and according to crumblcookies.com,  the franchise first opened in Logan, Utah in 2017 and rapidly became the fastest-growing cookie company in the nation, having more than 600 bakeries in 47 states. The company is different from other cookie companies because they have a weekly menu and creative cookie flavors."}, {"text": "Former Pirate’s Eye Editor-in-Chief Kiko Yoshihira (‘23) and I went to Crumbl Cookies to try out these extraordinary cookies."}, {"text": "When we first walked inside, we realized  Crumbl Cookies was  a to-go bakery.  We loved the cute designs on the walls and the display of cookies at the cash register. We ordered a four-pack with Pumpkin Cake, Hazel Nut and Sea Salt Cookie, Apple Pie, and Lemon Blackberry, although they ended up giving us the Classic Pink Sugar Cookie. We each decided to eat only a quarter of each cookie as the cookies were larger than the size of my palm."}, {"text": "We first tried the Pumpkin Cake, a soft dough with icing and chocolate chips on top. From my first bite, I was impressed by the extreme softness of the cookie, the way it melted in my mouth, and a delightful punch of pumpkin flavor. The tastiness of the Pumpkin Cake Cookie was only slightly eclipsed by its icing, which I thought was a little too sweet to compliment the savory cookie."}, {"text": "Next, we  tried the Hazel Nut Sea Salt Cookie, which consisted of a soft dough with  chocolate drizzle on top. Unlike the Pumpkin Cake cookie, this flavor didn’t impress us as much. The sea salt present in its name was absent from what we tasted and it was too sweet for our liking. But the toasty chocolate drizzle along with a surprising hint of peanut butter brought the taste of the cookie together."}, {"text": "The third cookie was the Apple Pie. The apple toppings were sweetened perfectly and had the soft, creamy flavor that an apple pie would typically have. However, the cookie base was too sweet. The last cookie we tasted was the Classic Pink Sugar Cookie, it had a hard dough with  cute, light pink icing. But it was excessively sweet. Overall, we thought the cookies were overly sweet, but the flavors were unique and creative."}, {"text": "To learn more about the process of making Crumbl Cookies, I asked Crumbl Cookies employee Melina Fusco. She said, “ We’re a scratch kitchen. So, we start everything from scratch. We do it at the mixers at the front and we do everything from flour, sugar, and we use single packs to make the cookies and we keep them in warmers or coolers depending on what cookie they are.”"}, {"text": "Another important part of Crumbl Cookies is their weekly menu. Fusco said, “We like to try new things and it’s good to have them rotate or else you might get tired of new cookies that we’ve had. So, it’s good to have people come back.”"}, {"text": "South Student Fiorella Vitulich (‘23) added, “On one hand, I think that it is a fun idea because you can try new flavors and never get bored of the menu. On the other hand, if you had a favorite cookie one week, it will no longer be there the next, which can be a bit upsetting.”"}, {"text": "*link to='/cdn-cgi/l/email-protection#caf8f9abaefafbf2ff8abdbdbab8b9aee4a5b8ad'*Anushri Dwivedi*/link*"}, {"text": "Having sampled the cookies, Kiko and I were impressed with the creativity that went into creating them. Complex, multi-layered flavors like the Pumpkin Cake and Apple Pie, hit the heavenly spot."}, {"text": "Crumbl cookies is made for people who have a sweet tooth or like big portions. Dwivedi said, “I like having a large cookie because it’s fun to share with your friends, and you have leftovers for the next day"}], "file_structural_elements": {"title": "The Sweet Bakery of Princeton: Crumbl Cookies", "date": "January 5, 2023", "writer": {"qwSEbaCBnPbIwsO0WXu3": {"name": "Prisha Priyadarshini", "year": "2022"}}, "description": "     Sweet, chewy, soft, mouth-watering cookies with delectable flavors can make anyone feel like they’ve gone to heaven. You’ll find like these at Crumbl Cookies located in Princeton at Nassau Park Pavilion. Crumbl Cookies at Nassau Park Pavilion opened on Oct. 14 2022 and according to crumblcookie", "image": "https://thepirateseye.org/wp-content/uploads/2023/01/Untitled-1-e1673031830609-900x675.jpg"}}