{"tree_elements": [{"text": "A letter to the editor is a forum to express your opinion or unique perspective about an article you’ve read in the latest issue of The Pirate’s Eye that concerns you as students at South, as members of a nation and as citizens of a global community."}, {"text": "GUIDELINES TO CONSIDER WHEN WRITING A LETTER TO THE EDITOR:"}, {"text": "*link to='/cdn-cgi/l/email-protection'*[email protected]*/link*"}, {"text": "To the Editor:  (If directly addressing the writer, substitute Dear Mr./Ms. ___)"}, {"text": "Re: “headline” and date of the article."}, {"text": "BODY"}, {"text": "One to three paragraphs"}, {"text": "CLOSING"}, {"text": "Your full name"}, {"text": "Graduation year"}, {"text": "Note:  The Pirate’s Eye will contact you to verify that you really wrote the letter.  The Pirate’s Eye does not accept anonymous letters.  Be aware that letters may be edited for length, grammar and accuracy by The Pirate’s Eye staff."}, {"text": ""}, {"text": "Example #1:"}, {"text": "To the Editor:  Renee Pujara"}, {"text": "Re: “Use of plastic skyrockets”  (Dec. 22, 2020)"}, {"text": "Plastic in the sea is becoming a rising problem in the world and the pandemic is adding to this. Like you said, before the pandemic, we were focused on this problem and how to control this such that sea life is not affected. However, the current situation has increased the threat to sea life."}, {"text": "The pandemic has caused us to increase the supply of plastic for the production of any equipment needed. My work in a grocery store has made me aware of the increased use of plastic bags and because at the start of the pandemic that customers don’t know if they could bring tote bags. Honestly, at the time cashiers were unsure if they should even bag people’s groceries."}, {"text": "The plastic use, as you said, will take a long time to eliminate. Many countries don’t know about the misuse of plastic and its threat to marine life and humans. I believe that there should be increased communication to educate people on this matter so that we can make this elimination process quicker."}, {"text": "Your article is an amazing way to educate people about the use of plastic and we can all make this world better by spreading awareness and decreasing plastic use."}, {"text": "Haleema Shahid"}, {"text": "2023"}, {"text": ""}, {"text": "Example #2:"}, {"text": "To the Editor,"}, {"text": "Re: “Mental health during quarantine” (Dec. 22, 2020)"}, {"text": "Mental health is a topic that should be addressed much more throughout the nation and it is one that all students should try to understand."}, {"text": "With COVID-19, a whole new lifestyle has emerged and has changed the way we socialize with our friends and family. It is vital to try our best to remain in contact with friends that we may not see as much due to quarantine. Ms. Allen brought up the idea of joining clubs and nonprofits, a trend that has emerged during quarantine. Several sophomores have started nonprofits to give back to society during these challenging times."}, {"text": "This not only sets a platform for socializing and teamwork, but it also emphasizes the importance of respect and giving back to the community. It is crucial that we continue these positive acts, even with the challenges that COVID-19 presents."}, {"text": "Shekhar Shah"}, {"text": "Class of 2023"}], "file_structural_elements": {"title": "The Pirate’s Eye Guidelines for writing a letter to the editor", "date": "March 11, 2021", "writer": null, "description": "A letter to the editor is a forum to express your opinion or unique perspective about an article you’ve read in the latest issue of The Pirate’s Eye that concerns you as students at South, as members of a nation and as citizens of a global community.\nGUIDELINES TO CONSIDER WHEN WRITING A LETTER TO T", "image": null}}