{"tree_elements": [{"text": "In 1991, Anita Hill, a Yale Law School graduate, came forward with sexual harassment claims against the Supreme Court nominee Clarence Thomas. Less than two weeks after her testimony, Thomas was sworn in as Supreme Court Justice."}, {"text": "Nearly thirty years later, we see the same scene played out, this time between Brett Kavanaugh, the Supreme Court nominee, and Christine Ford, who accused him of sexual assault when they were in high school . Though multiple accusations of sexual assault were made against him, Ford’s being the most prominent, Kavanaugh was confirmed as Supreme Court Justice after a swift, one-week long investigation"}, {"text": "These two examples highlight the unequal weight given to the testimony of a man versus the testimony of a woman. There also seems to be an imbalance in attention to the credibility of one’s reputation against another. Kavanaugh used his academic history, graduate of Yale College and Yale Law School,  and qualifications for Supreme Court Justice as points toward gaining credibility. Meanwhile, Ford’s qualifications were disregarded."}, {"text": "Ford is an American professor of psychology at Palo Alto University and a research psychologist at Stanford University School of Medicine. Although she holds a prestigious and respected academic reputation, she was repeatedly mocked and threatened by critics for giving her testimony in an attempt to discredit her story. People believed she was making the story solely to bring down Kavanaugh."}, {"text": "This uninformed generalization sparked the spread of the #HimToo tag on social media, a counterprotest to the #MeToo movement. The purpose of the movement is to protect men from false accusations."}, {"text": "Unfortunately this mentality arose without consideration for the accuser’s credibility, or how that experience has hurt her future and wellbeing. After Ford came forward with her allegations, she received multiple death threats, which forced her to keep her sons at a friends home for their safety. This reaction to her allegation seems like it would be discouraging for victims of sexual assault to finally get justice or close that chapter of their life."}, {"text": "Interestingly, Ford’s bravery paved the way for others to address their experience. RAINN , a national sexual assault hotline, saw a 38 percent increase in hotline traffic from the day of Ford’s testimony on Thursday through the end of the week."}, {"text": "What this shows is the lasting impact that the #MeToo movement has had on people’s, especially women’s, attitudes towards sexual assault. Women’s voices need to heard and allegations need to be taken seriously."}, {"text": "IMAGE COURTESY: WWW.FLICKR.COM"}, {"text": ""}], "file_structural_elements": {"title": "View from the crow’s nest: the Kavanaugh trial", "date": "November 14, 2018", "writer": {"eQ4hzMgQyfADzpgfJuJG": {"name": "Jennifer Clancey", "year": "2018"}, "fvlskYg2CQHL59ccUZY2": {"name": "Ria Patel", "year": "2018"}}, "description": "     In 1991, Anita Hill, a Yale Law School graduate, came forward with sexual harassment claims against the Supreme Court nominee Clarence Thomas. Less than two weeks after her testimony, Thomas was sworn in as Supreme Court Justice.\n\n     Nearly thirty years later, we see the same scene played out", "image": "https://thepirateseye.org/wp-content/uploads/2018/11/44252275034_ca06acf2a0_b-900x600.jpg"}}