{"tree_elements": [{"text": "The world’s largest environmental call to action–Earth Day–had its 50th anniversary on April 22, 2020."}, {"text": "What has become a day for environmental advocates first started as a revolutionary movement for better environmental awareness."}, {"text": "Rachel Carson’s book Silent Spring, which was published in 1962, was a groundbreaking novel about the environmental threat of pesticides."}, {"text": "In 1970, Carson’s book inspired Wisconsin Senator Gaylord Nelson to organize gatherings of people nationwide to educate them about the state of the environment. It became known as Earth Day."}, {"text": ""}, {"text": "Congressman Pete McCloskey and student coordinator, Harvard graduate Denis Hayes, joined Nelson in organizing events, gatherings and protests nationwide to promote environmental activism."}, {"text": "Earth Day led to the creation of the United States Environmental Protection Agency, the Clean Air and Clean Water acts and the Endangered Species Act all in the interest of protecting the earth."}, {"text": "Despite its influence, Earth Day is only a 24-hour consideration for many. A time to recycle paper and buy from environmentally friendly companies. But after the day, the meaning of Earth Day is gone."}, {"text": "“We can’t let it become arbitrary because it’s too important,” said World History teacher Brain Levinson. “I feel like every time we turn on a cable news station there’s always a different crisis and some of them are real and some of them are manufactured and I think what they often forget to mention is a real long term crisis like climate change.”"}, {"text": "Earth Day serves as an important reminder of environmental issues around us, opening up conversations about action."}, {"text": "Jessica Verrault, Spanish 5 teacher, said, “I think Earth Day is a fantastic opportunity to talk about climate change and small steps we can take towards improving the environment. Now more than ever if we want to avoid irreversible damage.”"}, {"text": "Earth Day’s original purpose was to educate the public about environmental threats and guide them towards a change for the better. This purpose remains just as important today."}, {"text": "In Señora Verrault’s Spanish 5 class, students were doing just that before the school shutdown."}, {"text": "“Students have create[d] signs to be hung around the school to motivate their classmates to recycle, use hand dryers instead of paper towels, limit the use of single use plastics and save energy,” said Señora Verrault."}, {"text": "“In addition to teaching them how to be communicatively competent, we also hope they gain an awareness of what needs to be done for our planet,” Señora Verrault added."}, {"text": "Environmental education opened not only students’ eyes, but led to Señora Verrault making a change. “It has definitely motivated me to research and use alternative, environmentally friendly options,” Señora Verrault said."}, {"text": "Earth Day is a holiday for everyone to take a step back. With the right education, motivation to help our earth can turn into real change, and more than a 24-hour commitment."}, {"text": "During quarantine “it is easier than ever to be exposed to information about green practices for Earth Day since we are all online so frequently while we are stuck at home,” said senior Annika Baldwin, project manager for Environmental Club. “Every little thing we do at home to be more green counts.”"}, {"text": "“I’ll confess, there’s a gap between my goals for being more environmental, and what I’m actually doing day-to-day,” said Mr. Levinson. “And I could use reminders and holidays – and new rules and regulations – as I try to narrow that gap.”"}, {"text": "Photo by Ishita Jadon"}, {"text": "Photo courtesy of Vivek Jadon"}], "file_structural_elements": {"title": "We can’t let Earth Day lose its meaning", "date": "April 28, 2020", "writer": {"bKx3zLWGeeLfuT3uAvqi": {"name": "Ishita Jadon", "year": "2020"}}, "description": "     The world’s largest environmental call to action–Earth Day–had its 50th anniversary on April 22, 2020.\n     What has become a day for environmental advocates first started as a revolutionary movement for better environmental awareness. \n     Rachel Carson’s book Silent Spring, which was publish", "image": "https://thepirateseye.org/wp-content/uploads/2020/04/Earth-Day-675x900.jpg"}}