{"tree_elements": [{"text": "Schools should be safe places. But on Jun. 6, 2022, I was afraid to go to school. This feeling isn’t new at all. Millions of teenagers feel this way."}, {"text": "This isn’t surprising. According to the New York Times, the United States has the highest rate of mass shootings among developed countries. From 1998-2019 there were 101 mass shootings. More recently in Uvalde, Texas, 19 kids and 2 teachers were brutally shot by a nineteen-year old. These fourth graders, just like my sister, were looking forward to their summer vacation. Some were still reveling in joy after being recognized at an honor roll ceremony that morning. Their death is yet another reminder of our failure as a society to protect our children in their places of education."}, {"text": "I believe a key reason behind our widespread fear, like what I experienced on Jan. 6, is our weak and Ineffective gun laws. The Second Amendment states that we have the right to “bear arms”, but this is only justified in the context of a militia and in a different time period in America. We have let our safety and our students’ safety become a partisan issue instead of an important problem that deserves our immediate attention."}, {"text": "Although the Senate, according to the New York Times, recently struck a bipartisan deal on a gun control bill, which would increase background checks for people under 21, it does not go far enough as it fails to ban assault weapons and impose background checks for all."}, {"text": "These threats distract students from what really matters: their education. Weak gun laws make threats of school violence more possible. My fellow students and I shouldn’t be worried about school safety–we have too much else on our minds."}], "file_structural_elements": {"title": "We demand action", "date": "June 22, 2022", "writer": {"yrL7V8cZ9LpPMpvcLjI2": {"name": "Renee Pujara", "year": "2022"}}, "description": "Schools should be safe places. But on Jun. 6, 2022, I was afraid to go to school. This feeling isn’t new at all. Millions of teenagers feel this way.\nThis isn’t surprising. According to the New York Times, the United States has the highest rate of mass shootings among developed countries. From 1998-", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/IMG_5970-900x675.jpeg"}}