{"tree_elements": [{"text": "In “Trailblazers: 33 Women in Science Who Changed the World,” Rachel Swaby writes about the scientists featured in her book that “each woman held her curiosity tightly, as if gripping the string of a kite, and kept at her quest for answers even though it became difficult. Women face discrimination today, but it is almost harder to spot.”"}, {"text": "Swaby’s words are a wake-up call to young women thinking of pursuing a career in STEM because her words point out that a gender gap still exists in this field. For example, according to Ishani Singh, a student editor of the Yale Scientific Magazine, “In the biological sciences, 54.3 percent of undergraduate degrees were awarded to women,” but, she said, “0 percent of math and computer science majors were women.” While it is true that female students make up more than half of enrolled college students nationally, female representation in math and computer science remains discouragingly low."}, {"text": "One reason why, is because of the historical lack of representation of women in these fields. “Much of what is taught in biology class is from the late 20th century,” said physics teacher Barbara Fortunato. She explained that Chemistry covered discoveries from the late 19th to early 20th century. Physics from the 17th to the late 19th century. “At this time in history, the role of women was mainly to support their husbands in their intellectual pursuits, so there is a dearth of prominent female scientists in that time period.”"}, {"text": "Students notice the lack of representation in the science curriculum. Freshman Lina Lin said, “STEM is largely regarded as a ‘male dominant’ or a masculine field. In the past, people tried to persuade females to choose a more ‘feminine’ career path,” she said."}, {"text": "As a student, Ms. Fortunato faced the challenge of not having many female role models so she looked up to her father. “I think I always enjoyed science and math. I don’t recall learning about the names of many female scientists as a student. I suppose it is odd that I don’t think it alarmed me that it was mainly male scientists and I really didn’t think too much about it,” Ms. Fortuanto said. “As a kid, my greatest role model was my dad who worked in steel manufacturing. He encouraged me to pursue engineering, even though he comes from a culture where that would not have been common.”"}, {"text": "Like Ms. Fortunato, Dr. Heavers’ choice to enter a STEM field felt natural because of her family background. “I grew up on a 160-acre sheep farm in southern Rhode Island, and I fell in love with nature at an early age,” Dr. Heavers said. “It just so happened that my father was a physics professor and my mom was a biology teacher as well as a nursing professor. So, I’d say between growing up in nature, and being raised by two scientists, it was just a natural thing.”"}, {"text": "Junior Amy Xu said, “I don’t recall any particular unit on female scientists. Unfortunately, the legacy of many significant female figures in STEM fall into the same shadow. So many brilliant works and brilliant minds are not nearly recognized enough for the impact they have on our world.”"}, {"text": "One way of increasing the number of women in these underrepresented STEM fields is to provide students with role models. Unsung female scientists mentioned in science classes like Rosalind Franklin, Émilie du Châtelet, and Lise Meitner were ahead of their time and did not receive as much recognition as their male counterparts when they were alive. In some science units, students have an opportunity to learn about their unforgettable stories like that of Franklin and her key role in the race to decipher the structure of DNA, Châtelet’s contributions to the modern-day understanding of the conservation of mechanical and kinetic energy, and Meitner’s discovery of nuclear fission which ultimately led to the creation of the world’s deadlist weapon–the nuclear bomb."}, {"text": "Like female scientists before them, Ms. Fortunato, Lina Lin, Dr. Heavers, and Amy Xu “held [their] curiosity tightly. . . and kept at [their] quest for answers.”"}, {"text": "PHOTOS BY KALYANI SAMUDRLA"}], "file_structural_elements": {"title": "Well-behaved women seldom make herstory", "date": "May 5, 2022", "writer": {"Gxd1r1z0AAbCXQdmEWSS": {"name": "Kalyani Samudrla", "year": "2021"}}, "description": "In “Trailblazers: 33 Women in Science Who Changed the World,” Rachel Swaby writes about the scientists featured in her book that “each woman held her curiosity tightly, as if gripping the string of a kite, and kept at her quest for answers even though it became difficult. Women face discrimination t", "image": "https://thepirateseye.org/wp-content/uploads/2022/05/Screen-Shot-2022-05-05-at-1.15.14-PM-305x475-1.png"}}