{"tree_elements": [{"text": "“Bitcoin, Ethereum, DogeCoin, and LiteCoin,” explained sophomore Venkat Mamidi, an economics enthusiast at South, are some of the most popular cryptocurrencies influencing the financial world."}, {"text": "With more and more people getting in on virtual investing, the popularity of cryptocurrency exponentially grows, including among young people. At first glance, this might seem like a good time to invest in cryptocurrency, as it seems some people are getting rich off crypto. For example, Tyler Winklevoss amassed a 6 billion dollar net worth from Bitcoin according to an article in Motley Fool published last April by Emma Newberry. Unfortunately, such an example is the exception not the rule. The reality is that investing in cryptocurrency is risky."}, {"text": "Driving the craze for cryptocurrency investment was the financial data from last November. In that month, the global crypto market cap (total capital in the crypto market) stood at 578 billion dollars. Since then, it has grown five-fold and has reached a staggering 3 trillion dollar market cap during the month of Nov. 2021. According to a November Fortune Magazine article written by Yvonne Lau, ”Cryptocurrencies hit a market cap of $3 trillion for the first time as Bitcoin and Ether reach record highs.”."}, {"text": "This number, however, is not as attractive as it appears. With the growing popularity of cryptocurrencies like Bitcoin, the number of people investing increases and so do the price swings when a price of a certain stock goes up and down violently. With price swings escalating, an investors money can sporadically oscillate."}, {"text": "According to Google Finance, the price of BTC (Bitcoin) from 2020-2021 has gone up by a significant margin compared to the previous year–69.84% to be exact. Yet, the volatility–the fluctuating spiking and dipping of the price–is through the roof, making day-to-day investment nerve-racking and unsuitable. This reveals that investment is only a fitting choice if you are going to invest for the long term, and are willing to put in time and trust into a cryptocurrency that has a good chance of being eruptive."}, {"text": "With the volatility of crypto contributing to the risk of cryptocurrencies, there are many other dangers created that may put potential investors at threat. “Many people are losing money in pump and dump schemes and cybercrimes and market manipulation,” said sophomore Srujan Gopalam, a cryptocurrency enthusiast."}, {"text": "Market manipulation and cybercrimes such as pump and dump schemes are some ways scammers take advantage of investors. Scammers put money into the crypto beforehand, then convince the impressionable portion of investors to invest in crypto all at once, resulting in boosting its price which the scammers cash out on leaving the other investors at a deficit."}, {"text": "This scam is increasing in popularity. Many new people are getting into crypto at once, looking for quick cash, desperately going into pump and dumps with exaggerated promises of high returns. These scams are rising parallel with the growing rate of investors, making investments in crypto increasingly dangerous."}, {"text": "With the growing rate of practices like pump and dumps and naturally increasing volatility, the crypto market is almost bound for a wake-up call of sorts. Junior Josh Midha, officer of Business Club, said, “There is a big boom right now, which will fail soon. Demise of a market coming soon, every trend follows the cycle.”"}, {"text": "Although the current state of crypto might not be the best, it has the potential to become a major currency recognized by retailers and other places if crypto were to increase at a clean and stable rate. “More major retailers are starting to accept crypto as a currency–the sky’s the limit,” said sophomore Rishi Bajaj, a cryptocurrency investor."}, {"text": "With the future of crypto too fragile to, current investment in cryptocurrencies looks bleak."}, {"text": "As Srujan said, “Be very careful when investing in this market. Don’t just blindly follow trends but think about them and make informed financial decisions. This isn’t a situation where you either go big or go home since you could heavily suffer from this loss.”"}], "file_structural_elements": {"title": "What’s so cryptic about cryptocurrency?", "date": "January 18, 2022", "writer": {"CgW1fih1lGQwIcWjrhB6": {"name": "Josh Parmar", "year": "2021"}}, "description": "     “Bitcoin, Ethereum, DogeCoin, and LiteCoin,” explained sophomore Venkat Mamidi, an economics enthusiast at South, are some of the most popular cryptocurrencies influencing the financial world.\n     With more and more people getting in on virtual investing, the popularity of cryptocurrency expon", "image": "https://thepirateseye.org/wp-content/uploads/2022/01/IMG_1012-900x636.jpeg"}}