{"tree_elements": [{"text": "“So now it’s time to take a few minutes, as I guide you through the meditation.” As I hear these words, I feel my mind and body start to relax. I close my eyes and take a deep breath in."}, {"text": "I feel my shoulders rise as my lungs expand. After holding my breath for a few seconds, I exhale. My shoulders come down slowly and my body starts to loosen up."}, {"text": "As I repeat this process, I feel my stress and worries disappear."}, {"text": "According to Cady Lang of Time, Netflix partnered with the popular meditation app Headspace to release its brand new series “Headspace Guide to Meditation” on Jan. 1. Narrated by co-founder of Headspace, Andy Puddicombe, “Headspace Guide to Meditation” is a collection of eight episodes of soothing guided meditations. Unlike meditating on your own, in guided meditations the person who is meditating follows what is being said by a narrator. With Netflix being a leader in the world of streaming services, the addition of “Headspace Guide to Meditation” was big news."}, {"text": "“It’s a good step,” said junior Bhadra Gurjar. “I think Netflix is a big platform, and the more people that know about meditation the healthier we will all become.”"}, {"text": "According to a study by Headspace, meditating can help with stress, focus and happiness."}, {"text": "Lisa Hayden, who has been using Headspace in her Health classes for many years, said, “I would spend so much time before meditation explaining to kids the benefits of the practice. This new Netflix series has done that all for me.”"}, {"text": "At school, many students face stress due to their busy schedules and heavy workloads from their classes. According to the American Psychological Association, 31 percent of teenagers are overwhelmed by stress. Headspace has been a great support for many South students."}, {"text": "“Headspace has helped me with how I manage my anxiety and stress as well as [give me] tips to help me calm down in stressful times,” said sophomore Jinhu Chung."}, {"text": "During the coronavirus pandemic, many students have had struggles with mental health. According to a study by Active Minds, 80 percent of students have experienced a negative impact on their mental health because of the pandemic. But “Headspace Guide to Meditation” now acts as a great resource for students to improve their mental health."}, {"text": "“I think Headspace is able to put me in a better state of mind. Through meditation, it’s able to help calm me down [rather] than use my fears and anxieties,” said Gurjar."}, {"text": "The benefits of meditation are not the only enjoyable aspects of “Headspace Guide to Meditation.” Despite being the only cast member, Puddicombe makes watching the series an exclusive experience. From his calming voice, to his stories about meditation, Puddicombe has become a staple of the Headspace meditations."}, {"text": "“He works in a certain sequence,” said Ms. Hayden. “He gives them a personal [experience], he gives them a why, he gives research and science, which our kids are big on, and then he does the meditation.”"}, {"text": "Headspace is well known for its originality and simplicity. But what really separates the Netflix series from other guided meditations is its animations."}, {"text": "After watching a few episodes, the creative animations have been my favorite part of the series. There are many different animations, from a pleasing cartoon of a monkey swinging from one vine to another, to a calming visual of the sun and clouds. These animations complement Puddicombe’s narration, and help me focus and relax throughout the episode."}, {"text": "Chung said he was impressed with the animations in each episode because of “the mood and the environment it sets every time.”"}, {"text": "With so much going on in our everyday lives, taking a moment for yourself will be of great benefit. Along with the hardships that the coronavirus pandemic presents, the stress that students receive from school can be very difficult to face. Listening to an episode of Headspace can not only help with mental health, but also give us the opportunity to unwind and relax. From the animations, to the user experience, “Headspace Guide to Meditation” is a great series to watch on Netflix."}, {"text": "PHOTO COURTESY OF EDWARD KIM"}], "file_structural_elements": {"title": "What to watch next on Netflix: Headspace Guide to Meditation", "date": "February 12, 2021", "writer": {"QRo3uk5mtYwXdbxUvUF1": {"name": "Edward Kim", "year": "2021"}}, "description": "     “So now it’s time to take a few minutes, as I guide you through the meditation.” As I hear these words, I feel my mind and body start to relax. I close my eyes and take a deep breath in. \n     I feel my shoulders rise as my lungs expand. After holding my breath for a few seconds, I exhale. My s", "image": "https://thepirateseye.org/wp-content/uploads/2021/02/HeadspaceReviewImage1-1.jpeg"}}