{"tree_elements": [{"text": "I am a disabled Indian student living in America."}, {"text": "Last fall, in a survey I sent out called “The Pirate’s Eye Disability Awareness Survey” that received 150 responses from students and staff, 74 percent of responders indicated that they have never received any formal education on disability. In addition, 43.5 percent have also not learned anything about South Asian history and culture."}, {"text": "*link to='https://www.edutopia.org/article/setting-disability-inclusive-curriculum'*Edutopia article*/link*"}, {"text": "History teacher Matthew Coburn said that American studies classes in WW-P only briefly cover the subject of disability when students learn how Franklin Delano Roosevelt’s polio impacted his presidency. Specifically, Roosevelt was paralyzed below the waist and did everything possible to hide it out of embarrassment."}, {"text": "Few schools outside of WW-P also do not give adequate lessons on disabled people. As a result, those who don’t learn about these identities lack access to what professor emerita Rudine Sims Bishop calls in literature, “mirrors, windows and sliding doors.”"}, {"text": "According to Bishop’s article “Windows and Mirrors: Children’s Books and Parallel Literatures,” stories with characters whose identities allow the student to see themselves are considered mirrors. Stories that allow students to step into another character’s world are called sliding doors. Stories that allow students access to realities different from their own are called windows."}, {"text": "I had a “mirror” experience in 2021 when I watched the documentary “Crip Camp: A Disability Revolution” on Netflix. It documented important events in the Disabled Rights Movement and gave me an insight into my disabled"}, {"text": "identity. But most of all, it inspired me to be a disabled rights activist."}, {"text": "*link to='https://www.scholastic.com/parents/books-and-reading/raise-a-reader-blog/why-its-important-kids-to-see-themselves-books.html'*Scholastic*/link*"}, {"text": "Creating an impact comes from empathy. To empathize with others more, student Anti-Bullying Counselor Chelsea Allen said, “I think that the more we can have conversations about those experiences, the more compassion that we’re going to develop because it’s like you can read about something but when you actually talk to somebody who has a lived experience it’s much more different than just learning about it. So when we connect people to experiences, I think we by default have more compassion.”"}, {"text": "In Language Arts, when reading the book, “The House On Mango Street,” I learned about the misogyny women and girls experience in patriarchal cultures. In a unit about the play, “A Raisin in the Sun,” I learned about the Black experience. This year, after reading “The Great Gatsby,” I was aware of how the impoverished suffered at the hands of the rich. As a result, I gained empathy for these populations."}, {"text": "Sophomore Tobias Staples wrote in the fall survey I sent out that students could be taught about different races and sexualities. Sophomore Brett Pogoda added that teachers should expose students to differing political views so that they can decide on what to agree with."}, {"text": "Creating inclusive, equitable syllabi and lessons will encourage conversations about these topics in our daily conversations and normalize diverse experiences."}, {"text": "Science supervisor Richard Stec said that teachers must ask, “What is your understanding about this and do all professional teachers in the learning community understand it the same way? That’s our next step.”"}], "file_structural_elements": {"title": "Why I want my education to reflect my identity", "date": "March 30, 2022", "writer": {"zvlB1uq0RYxyMvCNpViY": {"name": "Nikhil Kishore", "year": "2021"}}, "description": "I am a disabled Indian student living in America.\nLast fall, in a survey I sent out called “The Pirate’s Eye Disability Awareness Survey” that received 150 responses from students and staff, 74 percent of responders indicated that they have never received any formal education on disability. In addit", "image": null}}