{"tree_elements": [{"text": "After an entire year and a half of online classes, it is a relief to be back in person again this year. But, virtual learning hasn’t completely disappeared. Some students still attended class through Zoom for personal reasons and at the start of 2022 after winter break, a hybrid schedule was put in place. This begs the question: how viable are online classes during non-virtual years?"}, {"text": "Last March, Governor Phil Murphy required all public schools to fully open for the 2021-22 school year. However, absent students may appear in class on Zoom “as a temporary solution when students are unable to attend school due to a positive Covid-19 result or necessary exclusion based upon Covid-19 quarantine rules put forth by the CDC,” explained Guidance Counselor Brooke Parrott. These students are an exception but show how readily in-person classes can accommodate virtual students."}, {"text": "This system has the potential to be maintained and expanded as a backup to in-person schooling. The biggest benefit that virtual school can bring is helping students attend class while they are out for extended periods. Though unnecessary for short absences, it can greatly help prevent missed lessons and homework from piling up."}, {"text": "Gym teacher Joseph Gambino acknowledged the value of virtual school under certain circumstances. “There are extenuating circumstances where online learning can make up for extended absences for medical emergencies. However, mild sickness or traveling would not fall under an emergency, in my opinion,” he said."}, {"text": "Math teacher Jeannine Yorke holds similar views. “In the event where we’re closed multiple days for snow, first snow day, yes, I’m all for it,” she said. “But then the rest of them [should be virtual] so you don’t lose them.”"}, {"text": "Of course, this also means “you can’t have that person-to-person contact and interaction online as you can in-person,” said senior Donna Nagorny, who was in virtual class for a week."}, {"text": "But virtual schooling does not have to be used for just accessibility. If a student is struggling with mental health problems, they can attend class from the familiarity of their home instead of feeling increased pressure from facing peers and teachers head-on."}, {"text": "“In school you’re always so stressed and worried about the next upcoming"}, {"text": "assignment, but when you’re in your home environment you’re a lot more calm and able to get more things done,” said senior Ishaan Sharma, who took online classes for three weeks after being injured."}, {"text": "Schooling during Covid brought many changes to traditional schooling. Even though it was caused by less-than-ideal circumstances, it was still an opportunity to explore and look through new perspectives. One thing we did find out is that online classes provide a way to attend school when no other way is possible, and the potential this resource provides us should not be looked over so lightly."}], "file_structural_elements": {"title": "Why we shouldn’t let virtual school go to waste", "date": "March 30, 2022", "writer": {"jDWiWuTI7F9KAJjATiXf": {"name": "Daniel Wu", "year": "2021"}}, "description": "After an entire year and a half of online classes, it is a relief to be back in person again this year. But, virtual learning hasn’t completely disappeared. Some students still attended class through Zoom for personal reasons and at the start of 2022 after winter break, a hybrid schedule was put in ", "image": null}}