{"tree_elements": [{"text": "Education advocate and youngest Nobel Peace Prize winner Malala Yousafzai famously said in her autobiography, “No struggle can ever succeed without women participating side by side with men. There are two powers in the world; one is the sword and the other is the pen.” She added, “There is a third power stronger than both, that of women.”"}, {"text": "In 1987, to recognize women’s contributions to history, Congress passed Pub. L. 100-9 which designated the month of March as Women’s History Month."}, {"text": "This month recognizes women’s significant, but often overlooked, accomplishments. Schools continue to work toward creating an inclusive learning environment and bring awareness to the contributions and accomplishments of women. Women’s Empowerment Initiative (WEI) club strives to promote gender equality."}, {"text": "“We aim to spread awareness of obstacles that women continue to face in our society,” said senior Sia Garg, president of WEI, “and how we as residents can encourage and help each other to understand the importance of this month.”"}, {"text": "Senior Manushree More, Vice President of WEI, said, “It’s also important to have this month to give these women the attention and celebration that they deserve not only for us and them, but for the little girls out there who want to accomplish something great.”"}, {"text": "WEI is doing its part in addressing gender disparity this month by having club members work on a project which will ultimately answer the question, “How are women helping women?”"}, {"text": "Garg said, “All our club members are working on a project, whether it be a documentary, art, or a fundraiser, to ultimately get society’s attention to gender inequalities, especially in poorer countries where Women’s History Month needs to be more highlighted.”"}, {"text": "Alongside the WEI club, teachers at South understand the importance of this month and the need for education about women’s history. Among these is French teacher Eva Martin."}, {"text": "“When I was young, in this country and in France, women had to work twice as hard only to earn a lower pay and less respect,” Professor Martin said."}, {"text": "“We are making progress, and I am looking forward to my students achieving so much more.”"}, {"text": "Professor Martin said she has infused lessons on women’s history in her classroom teaching. “In 4-Honors, we will explore inspirational women across several fields. In AP, we will study francophone women, business leaders and scientists.”"}, {"text": "By covering these topics in her classroom, Professor Martin hopes to see all students, regardless of gender, having confidence in the classroom by learning about women’s history. “I would like to see more of our young women take leadership roles in clubs and associations.”"}, {"text": "Sophomore Ovi Parekh has similar hopes. “I want to see women in top positions, where they get what they deserve and work hard for.” She added, “I want to live in a world where women are in a space where they are empowered and their opinions aren’t undermined.” Gender equality continues to be a relevant goal for my generation."}, {"text": "As Professor Martin aptly put it: “Women’s history is human history.”"}], "file_structural_elements": {"title": "Women’s History is human history", "date": "March 30, 2022", "writer": {"h6LJRFoJDlU8899sJKNW": {"name": "Ishani Konar", "year": "2022"}}, "description": "Education advocate and youngest Nobel Peace Prize winner Malala Yousafzai famously said in her autobiography, “No struggle can ever succeed without women participating side by side with men. There are two powers in the world; one is the sword and the other is the pen.” She added, “There is a third p", "image": null}}