{"tree_elements": [{"text": "4:30 am. You just fell asleep less than five minutes ago. You have a project due first period and you have three tests coming up today."}, {"text": "This is what life as a high school student feels like for many. According to a Pirate’s Eye survey taken by 81 South participants, the average Pirate gets 6-7 hours of sleep each night. Scientific research conducted by the National Sleep Foundation shows that teenagers and adults need to snooze least eight hours to stay healthy."}, {"text": "Getting less than eight hours of sleep a day means that you can make changes to your school life to increase this amount of time. The biggest changes you can make are choosing courses wisely and being productive."}, {"text": "Choosing your courses wisely"}, {"text": "Data from the Pirate’s Eye survey shows that students who took more intensive courses (e.g. AP Chemistry, Honors Biology) got less sleep than students who took more college prep (CP) classes, which give less work than honors or AP courses."}, {"text": "In high school, there are courses we are all required to take such as four years of Language Arts or three years of Social Studies, but you can choose the “difficulty” of the courses. For example, instead of taking Precalculus Honors, you can opt to take Precalculus CP if math is not your strongest subject. Similarly, if science is your strongest subject, you can take AP Chemistry or AP Biology."}, {"text": "Ultimately, the best courses for you all depends on what your favorite subjects are."}, {"text": "In my experiences, students end up taking courses that are harder than they can handle because of peer pressure and trying to look good on college applications. The best way to balance your schedule is to take the courses you love but also to make sure that you are not doing too many work heavy classes and extracurriculars at once that it interferes with your sleep."}, {"text": "Being Productive"}, {"text": "Rather than talking with friends or playing games during study hall, prioritize your work. This is one of the places where I see student procrastination in full display."}, {"text": "If you either get tired or have nothing to do, you can take a break. While it’s healthy to take breaks and relax for sometime, it is also necessary to plan your time and make sure you don’t end up finishing homework long after it should have been done."}, {"text": "For this, you can make a plan for how you will go about completing your homework. For example, there are many studying methods you can try. For example, you can try the Pomodoro Method which tells users to work for 25 minutes and then take a break for 5 minutes and repeat the cycle three more times. After the fourth cycle, the user should take a longer break."}, {"text": "If you don’t like using timers, you can try the Flowtime method which according to Marah Whitaker, Marketing Assistant for the University of Chattanooga, consists of setting a goal and working on it till you accomplish it."}, {"text": "*link to='/cdn-cgi/l/email-protection'*[email protected]*/link*"}, {"text": "While there are many ways to avoid procrastinating, each person has to find a method that works best for them."}, {"text": "Conclusion"}, {"text": "There are two excellent ways to work more efficiently so that you sleep by 10 pm. As mentioned, take courses that align with your ability and interest. And the second and most important, but most difficult to achieve, stop procrastinating."}, {"text": "If we did this, as a student body we would be able to change our sleep average from six-seven hours to eight-nine hours. Imagine a well-rested school community. That’s an idea to sleep on."}, {"text": "IMAGE BY ISHANI KONAR"}], "file_structural_elements": {"title": "You can get 8 hours of sleep and still finish all your homework on time", "date": "June 20, 2022", "writer": {"zvlB1uq0RYxyMvCNpViY": {"name": "Nikhil Kishore", "year": "2021"}}, "description": "\n\n4:30 am. You just fell asleep less than five minutes ago. You have a project due first period and you have three tests coming up today.\nThis is what life as a high school student feels like for many. According to a Pirate’s Eye survey taken by 81 South participants, the average Pirate gets 6-7 hou", "image": "https://thepirateseye.org/wp-content/uploads/2022/06/Screen-Shot-2022-06-20-at-3.30.44-PM-900x296.png"}}